[
  {
    "date": "2019-10-16T00:00:00",
    "rooms": [
      {
        "id": 6823,
        "name": "Room 1",
        "sessions": [
          {
            "id": "123229",
            "title": "Keynote: The Care and Feeding of Software Engineers",
            "description": "After years of excellence as a developer who gets things done, you are rewarded with a leadership title and more responsibility. Only now you are expected to manage people and not just code. What motivated you to improve doesn't seem to always work on your team. So what do you do? We will explore the art of managing talented people and learning what the human needs for guidance and support from their leader. ",
            "startsAt": "2019-10-16T09:00:00",
            "endsAt": "2019-10-16T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "da1a1990-71d2-45dd-a213-c04430b64d87",
                "name": "Heather Downing"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133518",
            "title": "The next 5 years of ASP.NET Core",
            "description": "Join Ryan Nowak on a tour of ASP.NET Core’s evolution from “Project K” to present day and look forward to a few possible futures. We’ll discuss technical design details of how the ASP.NET Core stack is changing from bottom (hosting and startup), through the server, middleware pipeline, and up to high-level frameworks like MVC and Blazor. This is a technical deep-dive talk, and will explore possible design directions of .NET 5 and future releases.",
            "startsAt": "2019-10-16T10:20:00",
            "endsAt": "2019-10-16T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d714f4ac-802a-4b8c-898c-32c816778fa0",
                "name": "Ryan Nowak"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133523",
            "title": "Hack to the Future",
            "description": "Infosec is a continual game of one-upmanship; we build a defence and someone breaks it so we build another one then they break that and the cycle continues. Because of this, the security controls we have at our disposal are rapidly changing and the ones we used yesterday are very often useless today.\r\n\r\nThis talk focuses on what the threats look like *today*. What are we getting wrong, how do we fix it and how do we stay on top in an environment which will be different again tomorrow to what it is today. It's a real-world look at modern defences that everyone building online applications will want to see.",
            "startsAt": "2019-10-16T11:40:00",
            "endsAt": "2019-10-16T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "ce01d375-cbea-4295-bdc6-d11ba0f7cdd0",
                "name": "Troy Hunt"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133515",
            "title": "Blazor, a new framework for browser-based .NET apps",
            "description": "Blazor is a new web UI framework that has become one of the headline features of .NET Core 3.0 and beyond. It lets you build rich interactive user experiences in C# and Razor, offering the benefits of a single-page app (SPA) framework while keeping all your code and data in .NET. It gives you a modern component-based architecture for powerful code reuse, first-class development tools, and all the productivity of .NET.\r\n\r\nThis talk will focus mostly on Blazor WebAssembly, which lets you create true client-side applications. We'll go right from \"getting started\" up to much more advanced features such as strongly-typed API access, testing, deployment, and offline support. We'll even take an early preview of future features that are still being prototyped by the team.",
            "startsAt": "2019-10-16T13:40:00",
            "endsAt": "2019-10-16T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "874615f7-95fe-4651-b3e1-68f15d4c446e",
                "name": "Steve Sanderson"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "147545",
            "title": "The Moon: Gateway to the Solar System",
            "description": "In 1972, the last human to walk on the Moon headed back to Earth. Is it time to go back? Join Richard Campbell as he explores the potential of a return of humans to the Moon.\r\n\r\nMuch has been learned about the Moon since the Apollo missions, and interest in the Moon as a place of science, exploration and learning is growing. Even today there are new spacecraft and new science being done on and around the Moon. The Moon can be a catalyst to humankind traveling the solar system - it's time to go back!",
            "startsAt": "2019-10-16T15:00:00",
            "endsAt": "2019-10-16T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d4d7850a-526e-4959-aab1-36460081fcf5",
                "name": "Richard Campbell"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "135643",
            "title": "Chinafy your apps + Lessons you can steal from China",
            "description": "Adam Cogan will talk about his experiences getting applications ready for the Chinese market. He has been in the China software world for over 12 years and has seen their ecosystem evolve, and it has been truly amazing.\r\n\r\nThere is so much software built in the west, that makes $ in America and $ in Europe but at the same time also has zero users in China. Let’s fix that!",
            "startsAt": "2019-10-16T16:20:00",
            "endsAt": "2019-10-16T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "7ddee6db-ced0-4c0d-847c-5ea4e1f2a35c",
                "name": "Adam Cogan SSW"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "129116",
            "title": "GraphQL, gRPC or REST? Resolving the API Developer's Dilemma",
            "description": "GraphQL, gRPC, REST and WebHooks are among a bewildering array of technologies and architectural styles that are available to API developers today. Presented with such myriad options, how can we be confident of making an appropriate decision for the problem at hand? In search of guidance, developers often turn to online communities. This can exacerbate the problem as discussions about API styles often descend into statements about the superiority of one approach over another being presented as universal truths. Such comments invariably earn emotive rebuttals that also lack sufficient nuance. The result of such exchanges is increased confusion and uncertainty. Join me on a tour of these API styles where we will cut through this noise, demonstrate where each style shines (plus where they don't!) and ultimately resolve this dilemma of choice.\r\n\r\nIn this session we'll take an in-depth look at API design; the best practices that have evolved; the game changing supporting technologies that are now available including HTTP/2; and most importantly what you need to do to deliver a world class developer experience:\r\n\r\n- How to determine the suitability of an API style for your application context. Don't be a victim of technology hype!\r\n- What is required to support graceful evolution of the API contract including the potential implications of both Hyrum's Law and the Law of Implicit Interfaces\r\n- Understand the supporting toolchains and technologies that dovetail with each API style.\r\n- The importance of treating your API as a product with an unwavering focus on improving the ease of consumption for your clients.\r\n\r\nBy the end of the session, you will not only understand the concepts underpinning these various API styles but also have the knowledge to put them into practice. If you want to take to your API design expertise to the next level, then this is the session for you. See you there!",
            "startsAt": "2019-10-16T17:40:00",
            "endsAt": "2019-10-16T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "22385c57-1142-4eb0-9b08-719c3d875bf8",
                "name": "Rob Crowley"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6824,
        "name": "Room 2",
        "sessions": [
          {
            "id": "150043",
            "title": "Back to Basics: Efficient Async and Await ",
            "description": "We've all experienced deadlocks, and we all hate them, but how do we prevent (and potentially fix) them? \r\n\r\nThat's right, no one likes applications crashing or giving users an unexpected behavior. \r\n\r\nIntroducing asynchronous patterns is so much more than just applying async and await to your methods; you really, I mean really, need to understand what's going on. \r\n\r\nIn this session, we'll make sure you know how to avoid crashing your applications, and how to adhere to best practices when applying asynchronous patterns in our .NET applications.",
            "startsAt": "2019-10-16T10:20:00",
            "endsAt": "2019-10-16T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1f8704d7-04db-4f09-9c0e-d5abcbc7c9ff",
                "name": "Filip Ekberg"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "133509",
            "title": "ASP.NET Core 3.0 Overview",
            "description": "Damian Edwards from the ASP.NET Core team will give an overview of all the new features and changes in the just-released ASP.NET Core 3.0 in this packed session.\r\n\r\nHear about the latest performance improvements, new documentation, diagnostics features, gRPC support, Worker Service apps, library authoring changes, authentication changes, and SignalR streaming & reconnect.",
            "startsAt": "2019-10-16T11:40:00",
            "endsAt": "2019-10-16T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "dd70a67e-82fd-42e2-b3f3-218690ad2812",
                "name": "Damian Edwards"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "132563",
            "title": "Understanding Git — Behind the Command Line",
            "description": "Git has become the de-facto version control system of our industry, and for good reason. What you're able to achieve with Git is unmatched by any other version control system that came before it. But for all its power and flexibility, Git has one terrible flaw: its complexity. You won't find me arguing with that. However, I don't believe that Git is hard to understand. In fact, it's quite the opposite — Git is surprisingly simple at its core. The key to unlock its power is to understand it at a fundamental level.\r\n\r\nIn this session, we'll do just that by going through how Git works from the ground up. We'll start out by understanding Git's fundamental concepts and how they're implemented in the object model. From there, we'll work our way up to the user-facing commands and learn to take advantage of Git's unique features to craft a beautiful history without having to compromise on our working style.\r\n\r\nIf you ever wished you knew how Git really works, come to this session and find out.",
            "startsAt": "2019-10-16T13:40:00",
            "endsAt": "2019-10-16T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "63b2c908-a6f0-41b6-ace8-46a3f5482c54",
                "name": "Enrico Campidoglio"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "114841",
            "title": "Internals of Exceptions",
            "description": "You know how to throw and catch exception. But do you know how are they implemented internally? Do you know what is SEH, VEH and VCH in Windows? Or do you know why C# introduced exceptions filters or how to catch everything, even StackOverflowException? \r\n\r\nIn this presentation I show internal mechanisms used by Windows for handling exceptions. We will see constructs used by C++ and C# languages, CLR instructions and machine code details of those. There will be some live debugging and low to high level code.\r\n\r\nLevel 400, intense session.",
            "startsAt": "2019-10-16T15:00:00",
            "endsAt": "2019-10-16T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "9deb5b26-1e5c-4e13-af4a-da5489bd2680",
                "name": "Adam Furmanek"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "132143",
            "title": "Building Trust in Teams",
            "description": "Today businesses run on software, and the quality of that software is directly affected by the level of trust the team members responsible for that software have with each other - from management to developers to operations folks to data administrators - everyone has a hand in the success of software, but without trust, that success is hampered. What can you do to improve the levels of trust in your team? Join Richard Campbell as he discusses his experiences building trust within teams with time, effort, honesty and pizza.",
            "startsAt": "2019-10-16T17:40:00",
            "endsAt": "2019-10-16T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d4d7850a-526e-4959-aab1-36460081fcf5",
                "name": "Richard Campbell"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6825,
        "name": "Room 3",
        "sessions": [
          {
            "id": "150560",
            "title": "Building a Realtime \"Backend in a Box\" with PostgreSQL and Vue",
            "description": "Modern frontend applications are easy to build thanks to their powerful CLI tooling - but what about the backend API? Sure I can use crusty frameworks on the server like Rails or Django, or maybe roll my face in glass building an API using Node... but I want something more. Something that's as drop-dead simple to use as the Vue CLI or Nuxt and that stores data in a system I trust: *PostgreSQL* - so I built it and in this talk I'm going to show you how it works and what I learned building it.\r\n\r\nI'll show you how I prototyped a realtime (yes, realtime), document-based (JSONB) backend-in-a-box powered by PostgreSQL (yes, realtime PostgreSQL), GraphQL, Node, socket.io and the Express web framework. It's called Velzy and I'm actively working on it - but I thought it would be fun to share some of the more interesting and horrible things I was able to do with PostgreSQL's functions, executing dynamic SQL within the database itself. I'll show you how I plugged this all into Vue's state manager, VueX, and how I abused GraphQL just enough to make it worth using.",
            "startsAt": "2019-10-16T10:20:00",
            "endsAt": "2019-10-16T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "a243f417-6cc7-44c2-bbb7-1306b714f59a",
                "name": "Rob Conery"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "126925",
            "title": "Async demystified",
            "description": "Do you struggle to understand async/await in C#? How it works and why?\r\nI did. So I asked the best - the author of async, Stephen Toub. This talk is summary of the most interesting insights from him that helped me and my colleagues on CoreFX team to finally truly understand the magic behind async/await.\r\n\r\nThe talk will cover:\r\n* History and evolution of asynchronous programming patterns in C# and their problems. Leading to async/await and demonstrating the \"why\" behind its design choices.\r\n* Touch on the \"how\" it works behind the scenes.\r\n* Reasons for customizing and hyper-optimizing async for high-performance areas (like Networking stack).\r\n* Touch on related building block - ThreadPool.\r\n* Hands on sync-over-async pattern and associated problems. Workarounds in your code if you hit it. Potential solutions in future .NET versions.",
            "startsAt": "2019-10-16T11:40:00",
            "endsAt": "2019-10-16T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "731fd563-13a2-4fa9-87b6-331dc1293ec1",
                "name": "Karel Zikmund"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "139451",
            "title": "DDD really matters!",
            "description": "Over the years we have learnt the hard way that there are a lot of important aspects in software development initiatives. Project management, user experience and operational details are examples of such aspects. They are necessary. However, they are not sufficient.\r\n\r\nIn this presentation, Jimmy will discuss what really matters. Domain-Driven Design is very important to him, so it should come as no surprise that he believes deep collaboration with the domain experts to be one of the most important things to do and master. He'll delve into this in ways you probably haven't tried yet. Furthermore, he will discuss five other musts for reaching excellency.\r\n",
            "startsAt": "2019-10-16T13:40:00",
            "endsAt": "2019-10-16T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "14ae0e48-36b5-48ff-9b3a-5581bbd7742d",
                "name": "Jimmy Nilsson"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "129990",
            "title": "Building Great Teams",
            "description": "How do you build your dream team and ensure it continues to thrive? \r\n\r\nIn this talk I will run through the life cycle of growing, developing and retaining a great team. Starting with strategies to create a great culture within your existing team, tips for interviewing to ensure you hire the right people and lastly practical ways to manage or influence behaviour and have \"difficult\" conversations to ensure you keep a great team!\r\n\r\nThis talk is aimed at team leads / tech leads / senior developers / and anyone who is going to be involved in this life cycle. ",
            "startsAt": "2019-10-16T15:00:00",
            "endsAt": "2019-10-16T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "aff02f28-da1d-4681-817c-6cc42bf9484e",
                "name": "Donna Edwards"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "99246",
            "title": "Getting Started with Cosmos DB + EF Core",
            "description": "Cosmos DB is great and awesomely fast. Wouldn't be even more amazing if we could use our beloved entity framework to manage it? Let see how we can wire it up and get started",
            "startsAt": "2019-10-16T16:20:00",
            "endsAt": "2019-10-16T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c739e2f1-ecf5-43e1-abcf-90cf13dd7b8f",
                "name": "Thiago Passos"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "132473",
            "title": "Using Flutter to develop cloud enabled mobile applications",
            "description": "Flutter is one of the newest cross-platform mobile application development frameworks and brings with it the ability to generate high-fidelity applications that look amazing on every device. This session begins with a very brief overview of Flutter, covering the tools and resources required to get started. The remainder of the session connects a Flutter application to key Azure services such as Identity and App Center. The key takeaway from this session is how Azure accelerates the development of mobile applications irrespective of what technology or framework the app is developed with.",
            "startsAt": "2019-10-16T17:40:00",
            "endsAt": "2019-10-16T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e195f3c7-4eba-4c7f-9cdd-fc0bc151d47f",
                "name": "Nick Randolph"
              },
              {
                "id": "20bd7c5d-9811-404c-befd-df22f8c48f9f",
                "name": "Pooja Bhaumik"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6826,
        "name": "Room 4",
        "sessions": [
          {
            "id": "133621",
            "title": "Going 0 to 100 with Kubernetes",
            "description": "Containerization has completely revolutionized the way we develop and deploy, rapidly becoming the tool of choice when we need platform control, but don't want the responsibility of running infrastructure. Taking these technologies and transforming them into production ready systems is the next big step! Introducing Kubernetes, the open-source system for automatically deploying, scaling, and managing containerized systems.\r\nThis session will run through the basics of Kubernetes, setting up your first cluster, deploying your first workload, and taking it to the extreme with automated build and release tooling using AKS and Azure DevOps.",
            "startsAt": "2019-10-16T10:20:00",
            "endsAt": "2019-10-16T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "6aa42e99-46f5-487b-8916-fdf277c96e78",
                "name": "Scott Holden"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "123814",
            "title": "Continuous Intelligence: Keeping your AI Application in Production",
            "description": "It is already challenging to transition a machine learning model or AI system from the research space to production, and maintaining that system alongside ever-changing data is an even greater challenge. In software engineering, Continuous Delivery practices have been developed to ensure that developers can adapt, maintain, and update software and systems cheaply and quickly, enabling release cycles on the scale of hours or days instead of weeks or months. Nevertheless, in the data science world Continuous Delivery is rarely been applied holistically.\r\nThis is partly due to different workflows: data scientists regularly work on whole sets of hypotheses, whereas software engineers work more linearly even when evaluating multiple implementation alternatives. Therefore, existing software engineering practices cannot be applied as-is to machine learning projects. Learn how we used our expertise in both fields to adapt practices and tools to allow for Continuous Intelligence–the practice of delivering AI applications continuously.",
            "startsAt": "2019-10-16T11:40:00",
            "endsAt": "2019-10-16T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "ae286561-c5dd-4b4e-b6e1-2c887d803070",
                "name": "Arif Wider"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "133074",
            "title": "Safer, Faster, Smarter - Simple patterns for better cloud native applications",
            "description": "Are you getting the most from the cloud? \r\nAre you confident that your app is secure, that it can scale, that you have planned for things going wrong,  and when they do you will find out quickly, and have what you need to resolve it ? \r\nIn this demo-heavy session Rebecca and Adam will demonstrate how extend your current cloud applications with patterns and architectures to add insights, resiliency, performance and security. ",
            "startsAt": "2019-10-16T13:40:00",
            "endsAt": "2019-10-16T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "81ccb948-0157-4ef0-bd80-c11ad108d7cb",
                "name": "Adam Stephensen"
              },
              {
                "id": "07e89638-1c20-403d-9c7e-bb82103c8b7c",
                "name": "Rebecca Lyons"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "100364",
            "title": "Being cheap with the cloud",
            "description": "The commoditization of the cloud has made it easier than ever to build an application that scale up or out as we desire. However, a traditional mindset of building applications to be deployed into web farms can result in a cost explosion that might make us question whether we’re really enjoying any cost-saving benefits.\r\n\r\nWhen we’re building a web application with a rich front end experience do we really need beefy webservers to run it?\r\n\r\nThis is where the power of serverless comes in, allowing us to scale rapidly with a minimal cost impact.\r\n\r\nIn this talk we’ll look at how to build a Single Page Application (SPA), that can handle thousands of requests per second but cost us only dollars per month by being smart about the kinds of Azure resources we are consuming. ",
            "startsAt": "2019-10-16T15:00:00",
            "endsAt": "2019-10-16T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "9abda5b3-cde8-40aa-aa4c-933857e65ae6",
                "name": "Aaron Powell"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "130135",
            "title": "Picking up the pieces - A look at how to run post incident reviews",
            "description": "We all know that the beautiful world of software is like a basketball balanced on a Jenga game. It's fine while it's fine but all it takes is a semi colon in the wrong place, a bad database failover or some unlucky road worker to cut a cable and the whole world comes crashing down. Fortunately we're all good people and when the pieces are on the floor we pull together and get it all balanced again. But then what?\r\n \r\nIt’s not good enough to just forget about it. Sweep it under the run and pretend it never happened. Production incidents are part of life. More than that, they are great learning opportunities. By examining what went wrong and identifying the contributing factors, we can not only learn how to prevent this happening again, but also pre-empt other issues within our system.\r\n \r\nThis talk looks at the strategies for Post Incident Review starting with the common place practices including the Fishbone Diagrams, Sticky Note Brainstorming and the Five Whys methods of root cause analysis. This talk will go beyond these practices to show how leveraging modern monitoring practices along side ChatOps we can the contributing factors, not just a single cause. These contributing factors can be used to find actionable outcomes that not only help prevent the same thing happening again but feed back into the incident lifecycle to make the team better prepared to Detect, Respond to, Remediate and Analyse the next incident.\r\n",
            "startsAt": "2019-10-16T16:20:00",
            "endsAt": "2019-10-16T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "603664bb-dfd2-482f-b6ab-c3ed9ac873e6",
                "name": "Klee Thomas"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "133003",
            "title": "Cognitive biases in software development",
            "description": "Our brains have evolved over millions of years to help us function in a complicated and crazy world, but the heuristics of our ancestors can sometimes give rise to unfortunate beliefs and behaviours that don’t correlate to the world we live in today.\r\n\r\nAs a software consultant, part of my role is helping teams and customers to understand the problems they’re trying to solve and how best to solve them. Throughout my career I have seen and fallen into many of these common cognitive biases and helped myself and others to try to negate them.\r\n\r\nIn this talk I will explore the most common biases I’ve seen in software development teams and how we can build practices and think our way out of these misconceptions.",
            "startsAt": "2019-10-16T17:40:00",
            "endsAt": "2019-10-16T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "af24f91d-252d-4cdf-b148-78110c91a803",
                "name": "Ian Hughes"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6827,
        "name": "Room 5",
        "sessions": [
          {
            "id": "131365",
            "title": "A brief history of Cloud",
            "description": "Familiarity with one of the major cloud platforms such as Azure, AWS or GCP is almost essential knowledge for any dev now but do you know the origins of cloud computing and where its (probably!) going?\r\n\r\nCome with me for this fireside talk full of useless trivia from a time when Amazon meant a river/rain-forest and Azure wasn’t even Project Red Dog yet..",
            "startsAt": "2019-10-16T10:20:00",
            "endsAt": "2019-10-16T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c8fb8671-9000-4565-9d02-e7dfb985268d",
                "name": "Alex Mackey"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "132930",
            "title": "Modern JavaScript For Web Dinosaurs",
            "description": "Back in the day, you'd roll out some jQuery and build websites with the best of them. But nowadays terms like \"Webpack\" and \"React\" and \"Node\" kept cropping up, and the new code you see looks nothing like the JavaScript you thought you knew... Uh oh - you've become a web dinosaur!\r\n\r\nIf you've been out of the game for even a little in frontend development it can be a huge trial to get back in. In this session I'll take you on a trip from basic jQuery all the way up to React and explain how we got from Point A to B. It'll be packed with examples - so not matter what year your JS knowledge is from, you'll walk away feeling less like an extinct dinosaur and more like a state-of-the-art web developer.",
            "startsAt": "2019-10-16T11:40:00",
            "endsAt": "2019-10-16T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "80f9dc64-788b-42c1-9c10-1a268170838e",
                "name": "Ryan Preece"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "148895",
            "title": "Lightning  Talks",
            "description": "Talk 1: Am I a Good Developer? - Emad Alashi\r\n\r\n\"Am I a good developer\", a questions we probably ask ourselves every day. We, developers, are in a continuous quest to discover our value within our community, we always try to measure ourselves, and often in doubts of our skills and capabilities.\r\nThe question though is, how?! How can we evaluate ourselves? \"Am I really a good developer\"?\r\n\r\nIn this lightning talk, I will share with you questions I found extremely important in this journey, the answers to which will give you a valuable gauge that you can use to answer the ultimate question, and it will open your eyes to the path of being a \"Good developer\".\r\n-------------------------------------------------------------------\r\n\r\nTalk 2: Have lunch and impact on your company! - Nelly Sattari\r\n\r\nNot all companies are as forward thinking as you might expected and you might planning of leaving those companies because of that.\r\nHowever, there is always a way to fix the issues. At least you can try! I will show you how you can have lunch in your company and impact the culture, technology and behavior in your company. and become a star!\r\n--------------------------------------------------------------------\r\nTalk 3: Finding your tribe. It all starts with community - Megan Mallin\r\nAs a tech professional, there’s a good chance you are or have been part of a community. Whether it be a Meetup, Slack or Facebook group, contributing to an open source project or part of a recognised community program, how do you know if a tech community is providing you with the knowledge, connections and insights you need to survive and thrive as a technical professional?\r\n\r\nDuring this talk, I’ll catch you up with the latest trends in tech communities, share with you where like-minded peers are hanging and celebrate those that are helping to make tech communities more awesome. Whether you’re looking for a new tribe, want to know who is shaking things up or just looking for inspiration, I’ve got you covered.\r\n-------------------------------------------------------------------\r\nTalk 4: Developing great tech videos on a budget - Stephen Carter\r\n\r\nWant to produce your own tech videos that are engaging, with your own unique touch, but thought the setup costs would be too great, or the learning curve too steep? Well you can, and for less than you probably think! You’ll come away from this session knowing what equipment you need, the software tools, resources to help you along the way and presentation tips to get you kick started.",
            "startsAt": "2019-10-16T13:40:00",
            "endsAt": "2019-10-16T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "53a4f8c5-9fbe-455b-b392-7b403259cb30",
                "name": "Nelly Sattari"
              },
              {
                "id": "c02d6f83-b12b-4b91-85c2-f001f9de8bdd",
                "name": "Emad Alashi"
              },
              {
                "id": "fdf0922f-6be2-440b-9ece-d920aa8344e6",
                "name": "Megan Mallin"
              },
              {
                "id": "94373bf4-852d-4126-a969-52ed0d651010",
                "name": "Stephen Carter"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "125068",
            "title": "Dissecting Kubernetes (K8s) - An Intro to Main Components",
            "description": "People talk about Kubernetes as if it is a single, opaque system and rarely dig in to see what makes it tick. This isn’t the standard talk about why you need Kubernetes or how to deploy into it. Instead, join us to demystify some of the inner workings of a Kubernetes cluster. Learn what actually deploys containers, what decides where they should go, and understand the component that handles the famous scaling of containers. We will build up a mini cluster one Kubernetes component at a time, explore why we need them, and gain a better sense of what happens to all those YAML files you throw at it.",
            "startsAt": "2019-10-16T15:00:00",
            "endsAt": "2019-10-16T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "86b94933-b41b-4b82-8bf3-855c2f90a445",
                "name": "Joshua Sheppard"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "132511",
            "title": "Cloud Governance: Winning the battle between speed and control",
            "description": "Left unrestrained, your Cloud environment can be like the wild west. Traditional approval processes just slow developers down though, so how can we maintain both our agility and our compliance & organisational requirements? In this session, you’ll learn about foundational planning decisions, controls available through policies and how to programmatically enforce standards beyond just resource templates (including configuration sprawl over time). Finally, you’ll learn about controls to prevent or manage Cloud cost blowouts. ",
            "startsAt": "2019-10-16T16:20:00",
            "endsAt": "2019-10-16T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4c7b8d47-0b4d-4376-9538-0d9b648080d2",
                "name": "Sonia Cuff"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "133170",
            "title": "Unity for the enterprise developer",
            "description": "C# has a reputation as an enterprise language, but there’s an entire other industry of developers using C# to build videogames, virtual reality and even films. Unity is a massively popular platform that runs on mobile devices, desktops and consoles, providing an engine for graphics, physics and audio, used by the videogame industry and movies, and even manufacturing and sales. And the scripting logic is all powered by C# and Mono. Hey, I know C#. Fancy building a game?  \r\n\r\nIn this session, let’s take a beginner’s look at how Unity works, from the ground up. We’ll see how to use the building blocks of game objects and physics, and how C# can add animation, logic and interactive to your game. More importantly, we'll spend some time checking out how a Unity project is different to an enterprise C# project - what does the project structure look like? What C# language version can I use? What libraries and packages can I use? What files go into source control? All the everyday, vital little things you'll need to know to work with a Unity project.",
            "startsAt": "2019-10-16T17:40:00",
            "endsAt": "2019-10-16T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d7dedbba-5fed-47fd-be25-4fb9b1342629",
                "name": "Matt Ellis"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "123229",
              "title": "Keynote: The Care and Feeding of Software Engineers",
              "description": "After years of excellence as a developer who gets things done, you are rewarded with a leadership title and more responsibility. Only now you are expected to manage people and not just code. What motivated you to improve doesn't seem to always work on your team. So what do you do? We will explore the art of managing talented people and learning what the human needs for guidance and support from their leader. ",
              "startsAt": "2019-10-16T09:00:00",
              "endsAt": "2019-10-16T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "da1a1990-71d2-45dd-a213-c04430b64d87",
                  "name": "Heather Downing"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133518",
              "title": "The next 5 years of ASP.NET Core",
              "description": "Join Ryan Nowak on a tour of ASP.NET Core’s evolution from “Project K” to present day and look forward to a few possible futures. We’ll discuss technical design details of how the ASP.NET Core stack is changing from bottom (hosting and startup), through the server, middleware pipeline, and up to high-level frameworks like MVC and Blazor. This is a technical deep-dive talk, and will explore possible design directions of .NET 5 and future releases.",
              "startsAt": "2019-10-16T10:20:00",
              "endsAt": "2019-10-16T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d714f4ac-802a-4b8c-898c-32c816778fa0",
                  "name": "Ryan Nowak"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "150043",
              "title": "Back to Basics: Efficient Async and Await ",
              "description": "We've all experienced deadlocks, and we all hate them, but how do we prevent (and potentially fix) them? \r\n\r\nThat's right, no one likes applications crashing or giving users an unexpected behavior. \r\n\r\nIntroducing asynchronous patterns is so much more than just applying async and await to your methods; you really, I mean really, need to understand what's going on. \r\n\r\nIn this session, we'll make sure you know how to avoid crashing your applications, and how to adhere to best practices when applying asynchronous patterns in our .NET applications.",
              "startsAt": "2019-10-16T10:20:00",
              "endsAt": "2019-10-16T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1f8704d7-04db-4f09-9c0e-d5abcbc7c9ff",
                  "name": "Filip Ekberg"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "150560",
              "title": "Building a Realtime \"Backend in a Box\" with PostgreSQL and Vue",
              "description": "Modern frontend applications are easy to build thanks to their powerful CLI tooling - but what about the backend API? Sure I can use crusty frameworks on the server like Rails or Django, or maybe roll my face in glass building an API using Node... but I want something more. Something that's as drop-dead simple to use as the Vue CLI or Nuxt and that stores data in a system I trust: *PostgreSQL* - so I built it and in this talk I'm going to show you how it works and what I learned building it.\r\n\r\nI'll show you how I prototyped a realtime (yes, realtime), document-based (JSONB) backend-in-a-box powered by PostgreSQL (yes, realtime PostgreSQL), GraphQL, Node, socket.io and the Express web framework. It's called Velzy and I'm actively working on it - but I thought it would be fun to share some of the more interesting and horrible things I was able to do with PostgreSQL's functions, executing dynamic SQL within the database itself. I'll show you how I plugged this all into Vue's state manager, VueX, and how I abused GraphQL just enough to make it worth using.",
              "startsAt": "2019-10-16T10:20:00",
              "endsAt": "2019-10-16T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "a243f417-6cc7-44c2-bbb7-1306b714f59a",
                  "name": "Rob Conery"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133621",
              "title": "Going 0 to 100 with Kubernetes",
              "description": "Containerization has completely revolutionized the way we develop and deploy, rapidly becoming the tool of choice when we need platform control, but don't want the responsibility of running infrastructure. Taking these technologies and transforming them into production ready systems is the next big step! Introducing Kubernetes, the open-source system for automatically deploying, scaling, and managing containerized systems.\r\nThis session will run through the basics of Kubernetes, setting up your first cluster, deploying your first workload, and taking it to the extreme with automated build and release tooling using AKS and Azure DevOps.",
              "startsAt": "2019-10-16T10:20:00",
              "endsAt": "2019-10-16T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "6aa42e99-46f5-487b-8916-fdf277c96e78",
                  "name": "Scott Holden"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "131365",
              "title": "A brief history of Cloud",
              "description": "Familiarity with one of the major cloud platforms such as Azure, AWS or GCP is almost essential knowledge for any dev now but do you know the origins of cloud computing and where its (probably!) going?\r\n\r\nCome with me for this fireside talk full of useless trivia from a time when Amazon meant a river/rain-forest and Azure wasn’t even Project Red Dog yet..",
              "startsAt": "2019-10-16T10:20:00",
              "endsAt": "2019-10-16T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c8fb8671-9000-4565-9d02-e7dfb985268d",
                  "name": "Alex Mackey"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "11:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133523",
              "title": "Hack to the Future",
              "description": "Infosec is a continual game of one-upmanship; we build a defence and someone breaks it so we build another one then they break that and the cycle continues. Because of this, the security controls we have at our disposal are rapidly changing and the ones we used yesterday are very often useless today.\r\n\r\nThis talk focuses on what the threats look like *today*. What are we getting wrong, how do we fix it and how do we stay on top in an environment which will be different again tomorrow to what it is today. It's a real-world look at modern defences that everyone building online applications will want to see.",
              "startsAt": "2019-10-16T11:40:00",
              "endsAt": "2019-10-16T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "ce01d375-cbea-4295-bdc6-d11ba0f7cdd0",
                  "name": "Troy Hunt"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "133509",
              "title": "ASP.NET Core 3.0 Overview",
              "description": "Damian Edwards from the ASP.NET Core team will give an overview of all the new features and changes in the just-released ASP.NET Core 3.0 in this packed session.\r\n\r\nHear about the latest performance improvements, new documentation, diagnostics features, gRPC support, Worker Service apps, library authoring changes, authentication changes, and SignalR streaming & reconnect.",
              "startsAt": "2019-10-16T11:40:00",
              "endsAt": "2019-10-16T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "dd70a67e-82fd-42e2-b3f3-218690ad2812",
                  "name": "Damian Edwards"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "126925",
              "title": "Async demystified",
              "description": "Do you struggle to understand async/await in C#? How it works and why?\r\nI did. So I asked the best - the author of async, Stephen Toub. This talk is summary of the most interesting insights from him that helped me and my colleagues on CoreFX team to finally truly understand the magic behind async/await.\r\n\r\nThe talk will cover:\r\n* History and evolution of asynchronous programming patterns in C# and their problems. Leading to async/await and demonstrating the \"why\" behind its design choices.\r\n* Touch on the \"how\" it works behind the scenes.\r\n* Reasons for customizing and hyper-optimizing async for high-performance areas (like Networking stack).\r\n* Touch on related building block - ThreadPool.\r\n* Hands on sync-over-async pattern and associated problems. Workarounds in your code if you hit it. Potential solutions in future .NET versions.",
              "startsAt": "2019-10-16T11:40:00",
              "endsAt": "2019-10-16T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "731fd563-13a2-4fa9-87b6-331dc1293ec1",
                  "name": "Karel Zikmund"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "123814",
              "title": "Continuous Intelligence: Keeping your AI Application in Production",
              "description": "It is already challenging to transition a machine learning model or AI system from the research space to production, and maintaining that system alongside ever-changing data is an even greater challenge. In software engineering, Continuous Delivery practices have been developed to ensure that developers can adapt, maintain, and update software and systems cheaply and quickly, enabling release cycles on the scale of hours or days instead of weeks or months. Nevertheless, in the data science world Continuous Delivery is rarely been applied holistically.\r\nThis is partly due to different workflows: data scientists regularly work on whole sets of hypotheses, whereas software engineers work more linearly even when evaluating multiple implementation alternatives. Therefore, existing software engineering practices cannot be applied as-is to machine learning projects. Learn how we used our expertise in both fields to adapt practices and tools to allow for Continuous Intelligence–the practice of delivering AI applications continuously.",
              "startsAt": "2019-10-16T11:40:00",
              "endsAt": "2019-10-16T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "ae286561-c5dd-4b4e-b6e1-2c887d803070",
                  "name": "Arif Wider"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "132930",
              "title": "Modern JavaScript For Web Dinosaurs",
              "description": "Back in the day, you'd roll out some jQuery and build websites with the best of them. But nowadays terms like \"Webpack\" and \"React\" and \"Node\" kept cropping up, and the new code you see looks nothing like the JavaScript you thought you knew... Uh oh - you've become a web dinosaur!\r\n\r\nIf you've been out of the game for even a little in frontend development it can be a huge trial to get back in. In this session I'll take you on a trip from basic jQuery all the way up to React and explain how we got from Point A to B. It'll be packed with examples - so not matter what year your JS knowledge is from, you'll walk away feeling less like an extinct dinosaur and more like a state-of-the-art web developer.",
              "startsAt": "2019-10-16T11:40:00",
              "endsAt": "2019-10-16T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "80f9dc64-788b-42c1-9c10-1a268170838e",
                  "name": "Ryan Preece"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "13:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133515",
              "title": "Blazor, a new framework for browser-based .NET apps",
              "description": "Blazor is a new web UI framework that has become one of the headline features of .NET Core 3.0 and beyond. It lets you build rich interactive user experiences in C# and Razor, offering the benefits of a single-page app (SPA) framework while keeping all your code and data in .NET. It gives you a modern component-based architecture for powerful code reuse, first-class development tools, and all the productivity of .NET.\r\n\r\nThis talk will focus mostly on Blazor WebAssembly, which lets you create true client-side applications. We'll go right from \"getting started\" up to much more advanced features such as strongly-typed API access, testing, deployment, and offline support. We'll even take an early preview of future features that are still being prototyped by the team.",
              "startsAt": "2019-10-16T13:40:00",
              "endsAt": "2019-10-16T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "874615f7-95fe-4651-b3e1-68f15d4c446e",
                  "name": "Steve Sanderson"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "132563",
              "title": "Understanding Git — Behind the Command Line",
              "description": "Git has become the de-facto version control system of our industry, and for good reason. What you're able to achieve with Git is unmatched by any other version control system that came before it. But for all its power and flexibility, Git has one terrible flaw: its complexity. You won't find me arguing with that. However, I don't believe that Git is hard to understand. In fact, it's quite the opposite — Git is surprisingly simple at its core. The key to unlock its power is to understand it at a fundamental level.\r\n\r\nIn this session, we'll do just that by going through how Git works from the ground up. We'll start out by understanding Git's fundamental concepts and how they're implemented in the object model. From there, we'll work our way up to the user-facing commands and learn to take advantage of Git's unique features to craft a beautiful history without having to compromise on our working style.\r\n\r\nIf you ever wished you knew how Git really works, come to this session and find out.",
              "startsAt": "2019-10-16T13:40:00",
              "endsAt": "2019-10-16T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "63b2c908-a6f0-41b6-ace8-46a3f5482c54",
                  "name": "Enrico Campidoglio"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "139451",
              "title": "DDD really matters!",
              "description": "Over the years we have learnt the hard way that there are a lot of important aspects in software development initiatives. Project management, user experience and operational details are examples of such aspects. They are necessary. However, they are not sufficient.\r\n\r\nIn this presentation, Jimmy will discuss what really matters. Domain-Driven Design is very important to him, so it should come as no surprise that he believes deep collaboration with the domain experts to be one of the most important things to do and master. He'll delve into this in ways you probably haven't tried yet. Furthermore, he will discuss five other musts for reaching excellency.\r\n",
              "startsAt": "2019-10-16T13:40:00",
              "endsAt": "2019-10-16T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "14ae0e48-36b5-48ff-9b3a-5581bbd7742d",
                  "name": "Jimmy Nilsson"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133074",
              "title": "Safer, Faster, Smarter - Simple patterns for better cloud native applications",
              "description": "Are you getting the most from the cloud? \r\nAre you confident that your app is secure, that it can scale, that you have planned for things going wrong,  and when they do you will find out quickly, and have what you need to resolve it ? \r\nIn this demo-heavy session Rebecca and Adam will demonstrate how extend your current cloud applications with patterns and architectures to add insights, resiliency, performance and security. ",
              "startsAt": "2019-10-16T13:40:00",
              "endsAt": "2019-10-16T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "81ccb948-0157-4ef0-bd80-c11ad108d7cb",
                  "name": "Adam Stephensen"
                },
                {
                  "id": "07e89638-1c20-403d-9c7e-bb82103c8b7c",
                  "name": "Rebecca Lyons"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "148895",
              "title": "Lightning  Talks",
              "description": "Talk 1: Am I a Good Developer? - Emad Alashi\r\n\r\n\"Am I a good developer\", a questions we probably ask ourselves every day. We, developers, are in a continuous quest to discover our value within our community, we always try to measure ourselves, and often in doubts of our skills and capabilities.\r\nThe question though is, how?! How can we evaluate ourselves? \"Am I really a good developer\"?\r\n\r\nIn this lightning talk, I will share with you questions I found extremely important in this journey, the answers to which will give you a valuable gauge that you can use to answer the ultimate question, and it will open your eyes to the path of being a \"Good developer\".\r\n-------------------------------------------------------------------\r\n\r\nTalk 2: Have lunch and impact on your company! - Nelly Sattari\r\n\r\nNot all companies are as forward thinking as you might expected and you might planning of leaving those companies because of that.\r\nHowever, there is always a way to fix the issues. At least you can try! I will show you how you can have lunch in your company and impact the culture, technology and behavior in your company. and become a star!\r\n--------------------------------------------------------------------\r\nTalk 3: Finding your tribe. It all starts with community - Megan Mallin\r\nAs a tech professional, there’s a good chance you are or have been part of a community. Whether it be a Meetup, Slack or Facebook group, contributing to an open source project or part of a recognised community program, how do you know if a tech community is providing you with the knowledge, connections and insights you need to survive and thrive as a technical professional?\r\n\r\nDuring this talk, I’ll catch you up with the latest trends in tech communities, share with you where like-minded peers are hanging and celebrate those that are helping to make tech communities more awesome. Whether you’re looking for a new tribe, want to know who is shaking things up or just looking for inspiration, I’ve got you covered.\r\n-------------------------------------------------------------------\r\nTalk 4: Developing great tech videos on a budget - Stephen Carter\r\n\r\nWant to produce your own tech videos that are engaging, with your own unique touch, but thought the setup costs would be too great, or the learning curve too steep? Well you can, and for less than you probably think! You’ll come away from this session knowing what equipment you need, the software tools, resources to help you along the way and presentation tips to get you kick started.",
              "startsAt": "2019-10-16T13:40:00",
              "endsAt": "2019-10-16T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "53a4f8c5-9fbe-455b-b392-7b403259cb30",
                  "name": "Nelly Sattari"
                },
                {
                  "id": "c02d6f83-b12b-4b91-85c2-f001f9de8bdd",
                  "name": "Emad Alashi"
                },
                {
                  "id": "fdf0922f-6be2-440b-9ece-d920aa8344e6",
                  "name": "Megan Mallin"
                },
                {
                  "id": "94373bf4-852d-4126-a969-52ed0d651010",
                  "name": "Stephen Carter"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "15:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "147545",
              "title": "The Moon: Gateway to the Solar System",
              "description": "In 1972, the last human to walk on the Moon headed back to Earth. Is it time to go back? Join Richard Campbell as he explores the potential of a return of humans to the Moon.\r\n\r\nMuch has been learned about the Moon since the Apollo missions, and interest in the Moon as a place of science, exploration and learning is growing. Even today there are new spacecraft and new science being done on and around the Moon. The Moon can be a catalyst to humankind traveling the solar system - it's time to go back!",
              "startsAt": "2019-10-16T15:00:00",
              "endsAt": "2019-10-16T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d4d7850a-526e-4959-aab1-36460081fcf5",
                  "name": "Richard Campbell"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "114841",
              "title": "Internals of Exceptions",
              "description": "You know how to throw and catch exception. But do you know how are they implemented internally? Do you know what is SEH, VEH and VCH in Windows? Or do you know why C# introduced exceptions filters or how to catch everything, even StackOverflowException? \r\n\r\nIn this presentation I show internal mechanisms used by Windows for handling exceptions. We will see constructs used by C++ and C# languages, CLR instructions and machine code details of those. There will be some live debugging and low to high level code.\r\n\r\nLevel 400, intense session.",
              "startsAt": "2019-10-16T15:00:00",
              "endsAt": "2019-10-16T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "9deb5b26-1e5c-4e13-af4a-da5489bd2680",
                  "name": "Adam Furmanek"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "129990",
              "title": "Building Great Teams",
              "description": "How do you build your dream team and ensure it continues to thrive? \r\n\r\nIn this talk I will run through the life cycle of growing, developing and retaining a great team. Starting with strategies to create a great culture within your existing team, tips for interviewing to ensure you hire the right people and lastly practical ways to manage or influence behaviour and have \"difficult\" conversations to ensure you keep a great team!\r\n\r\nThis talk is aimed at team leads / tech leads / senior developers / and anyone who is going to be involved in this life cycle. ",
              "startsAt": "2019-10-16T15:00:00",
              "endsAt": "2019-10-16T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "aff02f28-da1d-4681-817c-6cc42bf9484e",
                  "name": "Donna Edwards"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "100364",
              "title": "Being cheap with the cloud",
              "description": "The commoditization of the cloud has made it easier than ever to build an application that scale up or out as we desire. However, a traditional mindset of building applications to be deployed into web farms can result in a cost explosion that might make us question whether we’re really enjoying any cost-saving benefits.\r\n\r\nWhen we’re building a web application with a rich front end experience do we really need beefy webservers to run it?\r\n\r\nThis is where the power of serverless comes in, allowing us to scale rapidly with a minimal cost impact.\r\n\r\nIn this talk we’ll look at how to build a Single Page Application (SPA), that can handle thousands of requests per second but cost us only dollars per month by being smart about the kinds of Azure resources we are consuming. ",
              "startsAt": "2019-10-16T15:00:00",
              "endsAt": "2019-10-16T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "9abda5b3-cde8-40aa-aa4c-933857e65ae6",
                  "name": "Aaron Powell"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "125068",
              "title": "Dissecting Kubernetes (K8s) - An Intro to Main Components",
              "description": "People talk about Kubernetes as if it is a single, opaque system and rarely dig in to see what makes it tick. This isn’t the standard talk about why you need Kubernetes or how to deploy into it. Instead, join us to demystify some of the inner workings of a Kubernetes cluster. Learn what actually deploys containers, what decides where they should go, and understand the component that handles the famous scaling of containers. We will build up a mini cluster one Kubernetes component at a time, explore why we need them, and gain a better sense of what happens to all those YAML files you throw at it.",
              "startsAt": "2019-10-16T15:00:00",
              "endsAt": "2019-10-16T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "86b94933-b41b-4b82-8bf3-855c2f90a445",
                  "name": "Joshua Sheppard"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "16:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "135643",
              "title": "Chinafy your apps + Lessons you can steal from China",
              "description": "Adam Cogan will talk about his experiences getting applications ready for the Chinese market. He has been in the China software world for over 12 years and has seen their ecosystem evolve, and it has been truly amazing.\r\n\r\nThere is so much software built in the west, that makes $ in America and $ in Europe but at the same time also has zero users in China. Let’s fix that!",
              "startsAt": "2019-10-16T16:20:00",
              "endsAt": "2019-10-16T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "7ddee6db-ced0-4c0d-847c-5ea4e1f2a35c",
                  "name": "Adam Cogan SSW"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "99246",
              "title": "Getting Started with Cosmos DB + EF Core",
              "description": "Cosmos DB is great and awesomely fast. Wouldn't be even more amazing if we could use our beloved entity framework to manage it? Let see how we can wire it up and get started",
              "startsAt": "2019-10-16T16:20:00",
              "endsAt": "2019-10-16T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c739e2f1-ecf5-43e1-abcf-90cf13dd7b8f",
                  "name": "Thiago Passos"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "130135",
              "title": "Picking up the pieces - A look at how to run post incident reviews",
              "description": "We all know that the beautiful world of software is like a basketball balanced on a Jenga game. It's fine while it's fine but all it takes is a semi colon in the wrong place, a bad database failover or some unlucky road worker to cut a cable and the whole world comes crashing down. Fortunately we're all good people and when the pieces are on the floor we pull together and get it all balanced again. But then what?\r\n \r\nIt’s not good enough to just forget about it. Sweep it under the run and pretend it never happened. Production incidents are part of life. More than that, they are great learning opportunities. By examining what went wrong and identifying the contributing factors, we can not only learn how to prevent this happening again, but also pre-empt other issues within our system.\r\n \r\nThis talk looks at the strategies for Post Incident Review starting with the common place practices including the Fishbone Diagrams, Sticky Note Brainstorming and the Five Whys methods of root cause analysis. This talk will go beyond these practices to show how leveraging modern monitoring practices along side ChatOps we can the contributing factors, not just a single cause. These contributing factors can be used to find actionable outcomes that not only help prevent the same thing happening again but feed back into the incident lifecycle to make the team better prepared to Detect, Respond to, Remediate and Analyse the next incident.\r\n",
              "startsAt": "2019-10-16T16:20:00",
              "endsAt": "2019-10-16T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "603664bb-dfd2-482f-b6ab-c3ed9ac873e6",
                  "name": "Klee Thomas"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "132511",
              "title": "Cloud Governance: Winning the battle between speed and control",
              "description": "Left unrestrained, your Cloud environment can be like the wild west. Traditional approval processes just slow developers down though, so how can we maintain both our agility and our compliance & organisational requirements? In this session, you’ll learn about foundational planning decisions, controls available through policies and how to programmatically enforce standards beyond just resource templates (including configuration sprawl over time). Finally, you’ll learn about controls to prevent or manage Cloud cost blowouts. ",
              "startsAt": "2019-10-16T16:20:00",
              "endsAt": "2019-10-16T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4c7b8d47-0b4d-4376-9538-0d9b648080d2",
                  "name": "Sonia Cuff"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "129116",
              "title": "GraphQL, gRPC or REST? Resolving the API Developer's Dilemma",
              "description": "GraphQL, gRPC, REST and WebHooks are among a bewildering array of technologies and architectural styles that are available to API developers today. Presented with such myriad options, how can we be confident of making an appropriate decision for the problem at hand? In search of guidance, developers often turn to online communities. This can exacerbate the problem as discussions about API styles often descend into statements about the superiority of one approach over another being presented as universal truths. Such comments invariably earn emotive rebuttals that also lack sufficient nuance. The result of such exchanges is increased confusion and uncertainty. Join me on a tour of these API styles where we will cut through this noise, demonstrate where each style shines (plus where they don't!) and ultimately resolve this dilemma of choice.\r\n\r\nIn this session we'll take an in-depth look at API design; the best practices that have evolved; the game changing supporting technologies that are now available including HTTP/2; and most importantly what you need to do to deliver a world class developer experience:\r\n\r\n- How to determine the suitability of an API style for your application context. Don't be a victim of technology hype!\r\n- What is required to support graceful evolution of the API contract including the potential implications of both Hyrum's Law and the Law of Implicit Interfaces\r\n- Understand the supporting toolchains and technologies that dovetail with each API style.\r\n- The importance of treating your API as a product with an unwavering focus on improving the ease of consumption for your clients.\r\n\r\nBy the end of the session, you will not only understand the concepts underpinning these various API styles but also have the knowledge to put them into practice. If you want to take to your API design expertise to the next level, then this is the session for you. See you there!",
              "startsAt": "2019-10-16T17:40:00",
              "endsAt": "2019-10-16T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "22385c57-1142-4eb0-9b08-719c3d875bf8",
                  "name": "Rob Crowley"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "132143",
              "title": "Building Trust in Teams",
              "description": "Today businesses run on software, and the quality of that software is directly affected by the level of trust the team members responsible for that software have with each other - from management to developers to operations folks to data administrators - everyone has a hand in the success of software, but without trust, that success is hampered. What can you do to improve the levels of trust in your team? Join Richard Campbell as he discusses his experiences building trust within teams with time, effort, honesty and pizza.",
              "startsAt": "2019-10-16T17:40:00",
              "endsAt": "2019-10-16T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d4d7850a-526e-4959-aab1-36460081fcf5",
                  "name": "Richard Campbell"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "132473",
              "title": "Using Flutter to develop cloud enabled mobile applications",
              "description": "Flutter is one of the newest cross-platform mobile application development frameworks and brings with it the ability to generate high-fidelity applications that look amazing on every device. This session begins with a very brief overview of Flutter, covering the tools and resources required to get started. The remainder of the session connects a Flutter application to key Azure services such as Identity and App Center. The key takeaway from this session is how Azure accelerates the development of mobile applications irrespective of what technology or framework the app is developed with.",
              "startsAt": "2019-10-16T17:40:00",
              "endsAt": "2019-10-16T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e195f3c7-4eba-4c7f-9cdd-fc0bc151d47f",
                  "name": "Nick Randolph"
                },
                {
                  "id": "20bd7c5d-9811-404c-befd-df22f8c48f9f",
                  "name": "Pooja Bhaumik"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133003",
              "title": "Cognitive biases in software development",
              "description": "Our brains have evolved over millions of years to help us function in a complicated and crazy world, but the heuristics of our ancestors can sometimes give rise to unfortunate beliefs and behaviours that don’t correlate to the world we live in today.\r\n\r\nAs a software consultant, part of my role is helping teams and customers to understand the problems they’re trying to solve and how best to solve them. Throughout my career I have seen and fallen into many of these common cognitive biases and helped myself and others to try to negate them.\r\n\r\nIn this talk I will explore the most common biases I’ve seen in software development teams and how we can build practices and think our way out of these misconceptions.",
              "startsAt": "2019-10-16T17:40:00",
              "endsAt": "2019-10-16T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "af24f91d-252d-4cdf-b148-78110c91a803",
                  "name": "Ian Hughes"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "133170",
              "title": "Unity for the enterprise developer",
              "description": "C# has a reputation as an enterprise language, but there’s an entire other industry of developers using C# to build videogames, virtual reality and even films. Unity is a massively popular platform that runs on mobile devices, desktops and consoles, providing an engine for graphics, physics and audio, used by the videogame industry and movies, and even manufacturing and sales. And the scripting logic is all powered by C# and Mono. Hey, I know C#. Fancy building a game?  \r\n\r\nIn this session, let’s take a beginner’s look at how Unity works, from the ground up. We’ll see how to use the building blocks of game objects and physics, and how C# can add animation, logic and interactive to your game. More importantly, we'll spend some time checking out how a Unity project is different to an enterprise C# project - what does the project structure look like? What C# language version can I use? What libraries and packages can I use? What files go into source control? All the everyday, vital little things you'll need to know to work with a Unity project.",
              "startsAt": "2019-10-16T17:40:00",
              "endsAt": "2019-10-16T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d7dedbba-5fed-47fd-be25-4fb9b1342629",
                  "name": "Matt Ellis"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      }
    ]
  },
  {
    "date": "2019-10-17T00:00:00",
    "rooms": [
      {
        "id": 6823,
        "name": "Room 1",
        "sessions": [
          {
            "id": "135758",
            "title": "Pragmatic DevOps - How and Why",
            "description": "DevOps is about delivering value to your users faster and safer. This sounds great, but it's a goal, not a guide. Let's forget the buzzwords and the tools for a moment and talk about the practical steps you can take to improve your own DevOps story. More importantly, let's talk about why DevOps is worthwhile in the first place.\r\n\r\nStarting from basic principles, we'll look at practical tips for your whole process with the aim of actually delivering value to our users as effectively as we can. From taming your backlog, managing your code, and dealing with parallel workstreams, all the way to building and versioning, maintaining infrastructure, deploying safely to production, and gathering feedback to guide your next work.",
            "startsAt": "2019-10-17T09:00:00",
            "endsAt": "2019-10-17T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "29cb77cd-590c-44a0-8dc0-4cc46186ebe5",
                "name": "Damian Brady"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "155018",
            "title": "Deep Learning with CNTK and F#",
            "description": "Deep Learning is a powerful and mysterious sounding Machine Learning technique. It is based on neural networks, and has shown impressive results in areas as different as computer vision, speech recognition, or automated language translation. And, with the recent release of the Microsoft Cognitive Toolkit (CNTK) .NET API, it is now possible to train and use deep learning models in .NET.\r\n\r\nIn this talk, we will introduce some of the ideas behind the approach, explain how it works behind the scenes, and demonstrate how F# makes it easy to learn models from data and used them from within your .NET code.",
            "startsAt": "2019-10-17T10:20:00",
            "endsAt": "2019-10-17T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4b8d886a-c63c-4b78-a829-ef0ffae50a81",
                "name": "Mathias Brandewinder"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "124194",
            "title": "C# 8 and Beyond",
            "description": "One of the most popular programming language on the market is getting even better. With every iteration of C# we get more and more features that are meant to make our lives as developers a lot easier. \r\n\r\nJoin me in this session to explore what's new in C# 8, as well as what we can expect in the near (and far) future of C#!\r\n\r\nWe'll talk about:\r\n- News in C# 8\r\n- Pattern Matching (incl. Record Types)\r\n- Nullable Reference Types and How to Avoid Null Reference Exceptions\r\n- How Async & Await is Improving",
            "startsAt": "2019-10-17T11:40:00",
            "endsAt": "2019-10-17T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1f8704d7-04db-4f09-9c0e-d5abcbc7c9ff",
                "name": "Filip Ekberg"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133511",
            "title": "Modern day C# development in Visual Studio 2019",
            "description": "In this demo-filled session from a Microsoft engineer who has worked on VS for over 15 years, you'll get the inside story on improvements across the board: from performance improvements in startup, and solution load, to editing, code style, quick fixes, refactorings, unit testing, debugging, deployment, and more.",
            "startsAt": "2019-10-17T13:40:00",
            "endsAt": "2019-10-17T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "9970d04b-f1b1-4b09-8acd-c1034a1507e4",
                "name": "Kevin  Pilch"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133265",
            "title": "Quantum Computing Concepts",
            "description": "Quantum Computing is all over the news these days. Lots of mysterious words like `superposition` and `entanglement`, and unfamiliar physical phenomena.\r\n\r\nHow do you tell fact from fiction in the news? What do these things really mean? How does quantum computing work?\r\n\r\nUsing many pictures, a tiny bit of physics, and a little bit of mathematics, John will walk you through what the main concepts of quantum computing are, and how to get some intuition for how it works. We'll honestly talk about what Quantum Computing is great at, and where it's not. We'll look at what Quantum Computing code looks like, and we'll dissect a Quantum Algorithm to see how it works.\r\n\r\nWhen you leave this talk you should have a few concepts clear, and some tools to get started with exploring Quantum Computing further.\r\n\r\nThis is a follow-up talk to my \"Introduction to Quantum Computing\" talk, and will dive a little deeper into quantum computing than before.\r\n\r\nJohn was one of the original designers of Microsoft Q#, and works on the Microsoft Quantum Computing team with the software engineers and physicists who are building a full-stack quantum computer. ",
            "startsAt": "2019-10-17T15:00:00",
            "endsAt": "2019-10-17T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "5dc5066d-b1ea-4aef-b40b-16c6eb579281",
                "name": "John Azariah"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "132455",
            "title": "Clean Architecture with ASP.NET Core 3.0",
            "description": "The explosive growth of web frameworks and the demands of users have changed the approach to building web applications. Many challenges exist, and getting started can be a daunting prospect. Let's change that now.\r\n\r\nThis talk provides practical guidance and recommendations. We will cover architecture, technologies, tools, and frameworks. We will examine strategies for organizing your projects, folders and files. We will design a system that is simple to build and maintain - all the way from development to production. You leave this talk inspired and prepared to take your enterprise application development to the next level.",
            "startsAt": "2019-10-17T16:20:00",
            "endsAt": "2019-10-17T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3a5abb12-c9e2-4641-8ace-a4c067ad8e8d",
                "name": "Jason Taylor"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "150684",
            "title": "Blazor in more depth",
            "description": "In this talk, Blazor's two architects will take you deeper into the framework, showing a range of more advanced features and their internal workings. We'll dig into server-side Blazor and how we built the SignalR-based mechanism for efficiently streaming UI updates, as well as authorization in Blazor WebAssembly, and more.\r\n\r\nThis will be a fairly informal talk that encourages conversation with the audience, so bring your questions! If you want to request any specific demos in advance, feel free to tell us on Twitter (Steve:@StevenSanderson, Ryan: @aVerySpicyBoi).",
            "startsAt": "2019-10-17T17:40:00",
            "endsAt": "2019-10-17T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "874615f7-95fe-4651-b3e1-68f15d4c446e",
                "name": "Steve Sanderson"
              },
              {
                "id": "d714f4ac-802a-4b8c-898c-32c816778fa0",
                "name": "Ryan Nowak"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6824,
        "name": "Room 2",
        "sessions": [
          {
            "id": "131042",
            "title": "How to build web apps with Vue.js and friends",
            "description": "Curious about \"that other framework\" for building web front ends? Wondering why people are talking about it so much?\r\n\r\nWell, wonder no more! This is a session you definitely want to come to.\r\n\r\nThis will be a mostly-code session where you'll see how Vue works, how you can manage application state, how you can structure and bundle larger applications, and how you can communicate with SignalR and REST APIs, and so much more!",
            "startsAt": "2019-10-17T09:00:00",
            "endsAt": "2019-10-17T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "04ed3fa6-9ce1-4c9c-8991-d429a8f73b39",
                "name": "Richard Banks"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "102649",
            "title": "Getting Started with Apache Spark",
            "description": "As companies work to gain insight from ever-increasing amounts of data, data platform practitioners need tools which can scale along with the data. Early big data solutions in the Hadoop ecosystem assumed that data sizes overwhelmed available memory, emphasizing heavy disk usage to coordinate work between nodes. As the cost of memory decreases and the amount of memory available per server increases, we see a shift in the makeup of big data systems, emphasizing heavy memory usage instead of disk. Apache Spark, which focuses on memory-intensive operations, has taken advantage of this hardware shift to become the dominant solution for problems requiring distributed data. In this talk, we will take an introductory look at Apache Spark. We will review where it fits in the Hadoop ecosystem, cover how to get started and some of the basic functional programming concepts needed to understand Spark, and see examples of how we can use Spark to solve issues like calculating PageRank and analyzing large data sets.",
            "startsAt": "2019-10-17T10:20:00",
            "endsAt": "2019-10-17T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "7c382501-a37f-49b7-bb28-eb7692995323",
                "name": "Kevin Feasel"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "102496",
            "title": "Monitoring a Global Multitenant Service",
            "description": "Monitoring, or handling and governing, your Service in the Cloud is not for the faint hearted. The Holy Grail is ever so elusive! Holy Grail meaning that Global Multitenant amazing Service that is going to take over the world and bring you lots of dough! Recent updates to Azure Monitoring create a clearer picture and providing for us more of a unified experience where all diagnosing, metrics, logs, alerting and more happens in one place. It’s like walking up to a “single pane of glass” where you can overview manage and act all in one place! Let us define the needs for monitoring a modern service hosted in the Cloud and walk through the landscape of services and features that makes this possible for us!",
            "startsAt": "2019-10-17T11:40:00",
            "endsAt": "2019-10-17T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c173d7ee-e503-46dc-9392-d016ca0c39f8",
                "name": "Magnus Mårtensson"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "101381",
            "title": "Handling Angular Forms Without Losing Your Sanity",
            "description": "“Why’d you have to go and make things so complicated?” - Avril Lavigne, implementing Angular forms in 2019\r\n\r\nForms are such a basic part of web applications; how did they get so complicated? This talk will walk through Angular template driven vs. reactive forms and use cases for their implementation, basic & more complex form-validation, & custom component implementations like typeahead and date-pickers. This talk will also include some useful workarounds for those more complex PITA requirements that always seem to pop up in projects.",
            "startsAt": "2019-10-17T13:40:00",
            "endsAt": "2019-10-17T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "e5b9e6c6-1477-4b19-8347-06683a7417de",
                "name": "Jennifer Wadella"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "98973",
            "title": "I Don’t Need No Stinkin’ Framework - Mastering Shadow DOM",
            "description": "Want to create components that work regardless of the front-end framework you are using?\r\n\r\nTired of throwing away your components when you change front-end frameworks?\r\nWish you could just code it once and reuse it on all of your projects?\r\n\r\nMe too! Components are a staple of front-end development as they increase development speed, consistency, and reduce the need for repeat code. To create components often we turn to frameworks such as Angular, React, and Vue but we don't need to. \r\n\r\nUsing nothing more than HTML and Javascript that is readily available to us in all modern browsers we can create components that work without being tied to any one front-end framework. \r\n\r\nYou will walk away with the knowledge you need to go forth and create your own components, understand how to make them look gorgeous, and what if any limitations there are. Also, find out how you can bring back the blink tag!\r\n",
            "startsAt": "2019-10-17T15:00:00",
            "endsAt": "2019-10-17T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3336b62f-c81b-4892-8247-d34043767210",
                "name": "Martine Dowden"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "138598",
            "title": "Beyond infrastructure as code DSLs",
            "description": "What if I told you that there was a way to use TypeScript (also python and GO) to declare your infrastructure. Once you do, there is no turning back, this is the next step in infrastructure as code.\r\n\r\nPulumi is a new generation open source infrastructure as code tool which opens up a new world of amazing possibilities without making your team learn a new language. It allows you to write code to declare your infrastructure, write tests for that code, then it will manage your infrastructure allowing you to preview changes against any environment just like you would expect from a good infrastructure management tool.\r\n\r\nIt also opens up a number of opportunities like easily being able to create composite resources, wrap APIs as dynamic resources, share your common infrastructure modules using and a whole bunch of other stuff. This will be a code heavy session so having some understanding of AWS/Azure/GCP will be highly beneficial. If you use an infrastructure as code tool, or want to, you need to come to this session.",
            "startsAt": "2019-10-17T16:20:00",
            "endsAt": "2019-10-17T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1ae7a4a9-3668-4703-840c-05b4cf857d7d",
                "name": "Jake Ginnivan"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "132901",
            "title": "Thousands of concurrent connections with Azure SignalR Service",
            "description": "As much as everyone loves having real-time applications, it is a pain to have them in high traffic websites. Scaling is a big issue which can be easily solved by using Azure's SignalR Service.\r\n\r\nHow can we add real-time functionality to cloud hosted web applications? How can we test and handle high traffic volume without disrupting real-time capabilities? What new and interesting problems can we solve with a bi-directional-web feature-set?\r\n\r\nOur speakers will explain, demonstrate and guide the audience through current ASP.NET Core SignalR technology and the possibilities that real-time features can give to modern web applications.\r\nThey will also show how to use Serverless technology in the Azure cloud with Azure App Services, Azure Storage and Azure Functions to use SignalR APIs to build your Real-time web application.\r\n ",
            "startsAt": "2019-10-17T17:40:00",
            "endsAt": "2019-10-17T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "53a4f8c5-9fbe-455b-b392-7b403259cb30",
                "name": "Nelly Sattari"
              },
              {
                "id": "6aa26696-c92b-4fc5-ba6c-38b8875ca9ff",
                "name": "Stafford Williams"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6825,
        "name": "Room 3",
        "sessions": [
          {
            "id": "116059",
            "title": "gRPC for ASP.NET Core, a new framework for high performance APIs",
            "description": "gRPC is a modern high performance RPC (Remote Procedure Call) framework that can run in any environment. gRPC is based on HTTP/2, Protocol Buffers and other modern standard-based technologies. Together with excellent tooling, it helps you create high throughput, low latency, real-time services.\r\n\r\nIn this talk, I will introduce gRPC for ASP.NET Core, a new gRPC framework that Microsoft is contributing to the Cloud Native Computing Foundation. I will compare gRPC with familiar REST-based JSON APIs, and recommend scenarios for using gRPC over other technologies. You will see how to integrate gRPC services with existing ASP.NET Core technologies like dependency injection, logging, and authentication, as we use gRPC to create lightning fast microservices and frontend applications.",
            "startsAt": "2019-10-17T09:00:00",
            "endsAt": "2019-10-17T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1a189579-1bb7-4d96-a54e-956c636e664a",
                "name": "James Newton-King"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "126428",
            "title": "Iterative metrics, dashboards and monitors",
            "description": "From our code to our processes, at Atlassian we had learned to harness the power of iterative development. However, when it came to our dashboards and monitors, we noticed we were often falling short. In this talk, we share how we applied a more agile approach to solve a variety of challenges surrounding the definition and maintenance of some of our operational tooling, providing tips for how you can do the same.",
            "startsAt": "2019-10-17T10:20:00",
            "endsAt": "2019-10-17T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3f430a08-b385-4ee4-8179-6e83f2d93164",
                "name": "Carmel Hinks"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "132498",
            "title": "Service degraded: Tackling burnout in the IT industry",
            "description": "IT has always been a high performance industry, but the pace of continual deployment and technology platform change is skyrocketing. What impact does this have on the humans behind the systems? In this session, you’ll hear real, vulnerable stories of burnout and the warning signs. Learn how to look after yourself and how to help others, so we can build supportive teams, managers, organisations and technical communities.",
            "startsAt": "2019-10-17T11:40:00",
            "endsAt": "2019-10-17T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4c7b8d47-0b4d-4376-9538-0d9b648080d2",
                "name": "Sonia Cuff"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "114637",
            "title": "Microservices for building an IDE – The innards of JetBrains Rider",
            "description": "Ever wondered how IDE’s are built? In this talk, we’ll skip the marketing bit and dive into the architecture and implementation of JetBrains Rider. We’ll look at how and why we have built (and open sourced) a reactive protocol, and how the IDE uses a “microservices” architecture to communicate with the debugger, Roslyn, a WPF renderer and even other tools like Unity3D. We’ll explore how things are wired together, both in-process and across those microservices. Let’s geek out!",
            "startsAt": "2019-10-17T13:40:00",
            "endsAt": "2019-10-17T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b425717f-25c3-4863-b893-8f8bb943825a",
                "name": "Maarten Balliauw"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "132338",
            "title": "Bank Grade Security",
            "description": "Banks and financial services providers love to make some big claims when it comes to the security of their products and networks. The truth is, the phrase \"bank grade security\" has become an oxymoron. Many institutions have failed to implement basic security controls, least to keep ahead of security curve. Yet we continue to place considerable trust in them, and put up with security controls that are counter-productive, all to maintain the theatre of security.\r\n\r\nThis session will look at some of Australia's largest institutions. With simple tools we will make some of our own assessments on how well they secure their networks.",
            "startsAt": "2019-10-17T15:00:00",
            "endsAt": "2019-10-17T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b091fa67-10d0-4231-a405-f0a1ec32c120",
                "name": "Kieran Jacobsen"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "143156",
            "title": "Access All Areas: Making Accessibility More Accessible",
            "description": "In this modern age more and more information is created in digital form, and there are an increasing amount of ways to consume this information (TV screens, smartwatches, computers, car systems, etc.) It is therefore vitally important that it should not only be available through different media, but also that you reach more and more people, regardless of their technical prowess, disabilities or means of interacting with technology. It is to address these challenges that several rules and regulations were created, to allow everyone the same basic access to this information that we sometimes take for granted.\r\n\r\nAchieving this lofty aim though is difficult. Although we have tools to create U/A (Universally Accessible) compliant documents from scratch, converting and validating existing documents is (for now at least) work that requires care and manual inspection, which takes time.\r\n\r\nIn addition, whilst the Universal Accessibility standards may have been created primarily to address the needs of people with disabilities, there are other issues that could be addressed. The ability to collect data can easily outstrip the throughput of data analysis, leading to masses of documents containing unknown information. It is tempting to make a small foray into this world of “dark data” to analyze and re-purpose some of these documents so that their contents can be processed more easily.\r\n\r\nIn this talk, we will demonstrate typical accessibility cases found in the wild that we should try to address, and discuss some existing strategies that can be used to mitigate the migration costs. In the near future we can automate this process to some extent with Machine Learning and Image Recognition tools, making the vast amount of existing digital information (whether it is in HTML, PDF form, or others) available to a much broader audience, and through an increasingly varied set of delivery mechanisms.",
            "startsAt": "2019-10-17T16:20:00",
            "endsAt": "2019-10-17T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "3a215fc5-484c-4558-b646-ab2984a41da1",
                "name": "André Lemos"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "101342",
            "title": "Kubernetes - going beyond the basics",
            "description": "So you've got a good grasp of the Kubernetes basics, you can create a cluster and deploy some applications to it, what about taking things up a notch?\r\n\r\nIn this talk and with demos we'll cover some more advanced topics within Kubernetes such as:-\r\n\r\nInfluencing the scheduling of pods\r\nControlling applications being scheduled using admission controllers\r\nAuto scaling of applications and clusters\r\nOptions for extending/customising Kubernetes using Custom Resources\r\nAdding a service mesh to improve traffic shaping\r\n\r\nAfter this talk attendees should have a much clearer understanding of the additional capability in Kubernetes and associated platforms that they may want to use to improve their application platform.\r\n\r\nAttendees should have a good understanding of the basic Kubernetes concepts and constructs.",
            "startsAt": "2019-10-17T17:40:00",
            "endsAt": "2019-10-17T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "fb14f65c-538d-4980-9010-8ffbd2d8d4b5",
                "name": "Shahid Iqbal"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6826,
        "name": "Room 4",
        "sessions": [
          {
            "id": "132859",
            "title": "API team characteristics and best practices",
            "description": "After years of designing and developing APIs, I realized the value of API teams as a key component to build and manage APIs.\r\nWhat do API teams do? In “API-as-a-Product”(AaaP) approach, API teams maintain close communication with product customers and developers using their product while they create an API program.\r\nThis  enables API teams to design API based on customers needs. API program will eventually become a strong product that will survive longer in a world with ever-changing innovations and fierce competition. \r\nConsidering structural differences in organizations, I will focus to discuss the main characteristics and best practices based on scope of responsibilities for each role.\r\nI will also demonstrate examples of output artifacts created by each member of API teams in the API program.\r\n",
            "startsAt": "2019-10-17T09:00:00",
            "endsAt": "2019-10-17T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4c8c4bb5-9ad9-42b3-ab81-fa6909adb7d8",
                "name": "Nahid Farrokhi"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "118306",
            "title": "Static Sites, Dynamic microservices, & Azure: How we built Microsoft Docs and Learn",
            "description": "The so-called JAMStack (JavaScript + APIs + Markup) is a technology-agnostic way to build high-performance, more secure, and more scalable apps for the cloud. In this session, you'll hear how Microsoft built Docs and Learn from the ground up to scale to over 100M page views/month, lowered costs, increased performance and enabled open-sourced community contributions using GitHub. ",
            "startsAt": "2019-10-17T10:20:00",
            "endsAt": "2019-10-17T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "54dd5aee-c38b-4983-9199-5f73adc0636b",
                "name": "Dan Fernandez"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "132871",
            "title": "Busting the Func'ing Jargon",
            "description": "Does \"currying\" sound like a tasty dinner to you? Do \"algebraic data types\" give you flashbacks to high school math classes? Does tail call recursion make you want to turn tail? Do you get frustrated trying to read about functional programming only to be met with a wall of unfamiliar terms and jargon? Then this talk is for you! \r\n\r\nIt's hard to avoid the influence of functional programming in modern software development. FP ideas and techniques are now pervasive even in mainstream imperative programming languages and libraries. You've almost certainly been using some FP ideas already, even if you don't know it! In this talk we'll gradually walk through the very basics of functional programming and learning that the fancy jargon isn't really all that complicated after all! We'll pick up some basic F# along the way, but the jargon-busting will help you understand an FP library in any language.",
            "startsAt": "2019-10-17T11:40:00",
            "endsAt": "2019-10-17T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "aae5b378-b059-401b-9c6b-575c3e6ecd4c",
                "name": "Daniel Chambers"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "131144",
            "title": "Keeping your builds green using Docker",
            "description": "With the number of technologies, lanaguages and platforms that is part of most projects today just keeps on increasing, beginning work on a new project can be daunting. We often end up spending a lot of time installing the correct version of SDK's and build tools until we can make the project build and run. And then we have the same requirements for our build environment, and too often we find that build failures are due to differences between the local development machines and the build server environment, \r\n\r\nIn this session you will learn how to use Docker to define and run your builds both locally and on the build server. By describing your builds in Dockerfile we can make sure that it will build anywhere, without any other dependencies than Docker.\r\nWe will also look at how we can run build agents inside a Docker container to make sure that our build infrastructure is immutable and reliable.",
            "startsAt": "2019-10-17T13:40:00",
            "endsAt": "2019-10-17T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "54973c7d-2fe5-4a49-9a1c-a52afed4d6a4",
                "name": "Jakob Ehn"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "130753",
            "title": "Apache Kafka Event streaming platform for .NET developers",
            "description": "When it comes time to choose a distributed messaging system, everyone knows the answer: Apache Kafka. But how about when you’re on the hook to choose a world-class, horizontally scalable stream data processing system? When you need not just publish and subscribe messaging, but also long-term storage, a flexible integration framework, and a means of deploying real-time stream processing applications at scale without having to integrate many different pieces of infrastructure yourself? The answer is still Apache Kafka.\r\n\r\nIn this talk, Viktor will give a rapid-fire review of the breadth of Kafka as a streaming data platform. You will see its internal architecture, including how it partitions messaging workloads in a fault-tolerant way and how it provides message durability. Viktor will explain Kafka’s approach to pub/sub messaging and how the Confluent .NET client offers a framework for computation over streaming data.",
            "startsAt": "2019-10-17T15:00:00",
            "endsAt": "2019-10-17T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4f858987-1a60-4da8-a4a2-045824a496c7",
                "name": "Viktor Gamov"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "127722",
            "title": "TypeScript - Beyond the Basics",
            "description": "TypeScript enables web developers to improve the clarity and reliability of their code. It also enables more powerful tools for writing code. This led to its rapid rise in popularity. But what can it do for you beyond just adding types to your variables and parameters? In this talk, we look at some of the more advanced features in the language that can help you deliver valuable solutions in less time.\r\n\r\nIn this session, we will look at features such as:\r\n* union types\r\n* intersection types\r\n* mixins\r\n* generics\r\n\r\nWe will also look at some of the new features in TypeScript 3.4 and 3.5. ",
            "startsAt": "2019-10-17T16:20:00",
            "endsAt": "2019-10-17T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f46fcf13-76db-4850-9995-ac8d076ba1de",
                "name": "Eric Potter"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "133385",
            "title": "A Tale Of Four Startups",
            "description": "Liam has had the pleasure of working for four different startups over the past 20 years, all quite different from one another.\r\n\r\nStartup 1 - working at an interactive television startup in the dot com bust in 2001, created by a major UK television channel company and a venture captial fund.\r\n\r\nStartup 2 - forming a brand new company, self funded to provide software services to television companies, successful but very small.\r\n\r\nStartup 3 - contracting to an MP3 download company, funded by angel investors and backed by an ex executive from a major record label.\r\n\r\nStartup 4 - a fully VC funded startup in the Shoreditch startup scene.\r\n\r\nThe aim is to provide some of the lessons learnt, what you might want to ask as a developer thinking of working at a startup, and how to know when to make sure you take all your belongings home just in case it's all going tits up.",
            "startsAt": "2019-10-17T17:40:00",
            "endsAt": "2019-10-17T18:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "1bcc3b50-a8da-47c3-850e-2fc5bde34edf",
                "name": "Liam Westley"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6827,
        "name": "Room 5",
        "sessions": [
          {
            "id": "124925",
            "title": "Best practices for securing CI/CD pipeline",
            "description": "DevOps practices are in a place; containers are everywhere, pipelines are flying. We do Agile. We do DevOps. Now we try to follow security practices for protecting the deployed resources, too. This is a reason why DevSecOps is not hype anymore and is gaining more prominence. There is a lot of information about DevSecOps, but how to do it properly? Where to start? What are the best practices?\r\nIn this session, we will walk through an end-to-end scenario where we will deploy infrastructure components securely to Azure using Azure DevOps, Azure Container Registry and security tools. We will build a pipeline with security in mind to protect and detect potential security flows during the build.\r\nYou will learn:\r\n- How to build end-to-end CI/CD pipeline that builds the application and deploys infrastructure on Azure with security checks for the application, containers and infrastructure;\r\n- What are the security tools available for CI/CD pipeline and how to implement them in the best way into different Git workflows;\r\n- Best practices and patterns of building security pipelines.\r\n\r\n\r\n\r\n",
            "startsAt": "2019-10-17T09:00:00",
            "endsAt": "2019-10-17T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4c3efe89-ab58-4b28-a9c3-78251f25ee06",
                "name": "Victoria Almazova"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "99561",
            "title": "How to do in-app chaos testing",
            "description": "Relax! I'm not here to break your software. But I am here to show you how you can break the software you develop without changing the actual code!\r\nNow, I hear you thinking: \"Why on Earth should I do this? I have unit/integration/... tests\"\r\n\r\nAh, yes, you have tests. Tell me, do you test what happens if a third-party service goes down? Or takes a lot longer to respond when that service hits its busiest time of the day?\r\nOr what would happen if you tried to write data into a SQL database that has no more disk space?\r\n\r\nAll of these - and more! - cases can be discovered early, during development time. And I'll gladly show you how.",
            "startsAt": "2019-10-17T11:40:00",
            "endsAt": "2019-10-17T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "36a0edaf-4f66-4f54-a522-94a92e6a7f3a",
                "name": "Wesley Cabus"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "148896",
            "title": "Lightning Talks",
            "description": "Talk 1: Let the Data Tell the Story - Has AlTaiar\r\nLet's be honest, most people get bored when we show too many graphs and numbers. How can we use storytelling techniques to communicate our data and insight? In this brief session, I will share with you key techniques and tools for effective storytelling in Power BI. Although the talk focuses on Power BI, most of the techniques can be applied everywhere else.\r\n\r\n-----------------------------------------\r\n\r\nTalk 2: Design non-relational database in a relational world - Negar Ghanbari\r\nAfter years of designing and developing object-oriented systems, I see almost everything in the world as an object. With that mindset, data model and schema design in relational databases isn’t very hard; but what about scalability, performance and other benefits that non-relational databases bring to the table? In this talk, I’ll share a few rules of thumb that helped me with designing data models for non-relational databases.\r\n\r\n-----------------------------------------\r\nTalk 3: Let's Talk Crazy: Blockchain + AI - Michael John Pena\r\nIn this lightning talk, the speaker will explain how Blockchain and AI (Artificial Intelligence) can correlate and conflict each other. This short session will explore how Blockchain being `deterministic` with its nature of immutability and AI being `probabilistic` by making it solve problems by understanding patterns and making predictions.\r\n\r\n-----------------------------------------\r\n\r\nTalk 4: The trust in Open Source Software - Vatsalya Goel\r\n\r\nEvery day developers rely on Open Source Software to deliver value and add functionality in their projects. While these Open Source projects are essential to any mature software, have we taken a step back an analysed whether the code it safe? Is this trust misplaced?\r\n\r\nThis talk will go through ways we can bring the trust back and give developers the confidence to add these packages in their projects. We will look at how malicious code can be added to these packages, what actions can be taken to prevent such packages from being added to our source code, and finally what steps need to be taken if a vulnerable package is found in our source code.",
            "startsAt": "2019-10-17T13:40:00",
            "endsAt": "2019-10-17T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "bd9a3ef6-d9f5-44a5-835a-e832cf47070f",
                "name": "Has AlTaiar"
              },
              {
                "id": "f55c3a87-135e-42e5-be15-da4df21a00d9",
                "name": "Negar Ghanbari"
              },
              {
                "id": "fc619aff-6bfa-435e-83bf-2d74ec96c4c0",
                "name": "Michael John Pena"
              },
              {
                "id": "8281d7ac-a795-44b2-b7d6-333e1d0f927c",
                "name": "Vatsalya Goel"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "99669",
            "title": "The future of .NET desktop development",
            "description": "Was there ever any doubt that desktop development is alive and kicking? With .NET Core 3.0 all that doubt, if there was any, should melt away like snow in the sun. Let's have a look at all the juicy goodness that .NET Core 3.0 brings to UWP, WPF and even WinForms! This talk is aimed at developers who have done, or are doing, desktop development and want to see how bright their future shines.",
            "startsAt": "2019-10-17T15:00:00",
            "endsAt": "2019-10-17T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "23da6a18-7d00-4d39-8b8a-86abd5bd66e7",
                "name": "Nico Vermeir"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "103583",
            "title": "Innovation and Trends in Cloud",
            "description": "The accelerated pace of innovation in cloud computing is one of its major benefits, but also one of its challenges. The new features and services released every other day can remove a lot of undifferentiated heavy lifting, but also require continuous awareness and study.\r\n\r\nThis session presents the latest and greatest from Amazon Web Services in a practical presentation. We´ll dive into the technical details and how to build solution leveraging the best of current and upcoming cloud technologies. We’ll talk about infrastructure, platforms, applications and more, including internet of things, big data and machine learning.\r\n\r\nJoin us and let us leverage the recent innovations in practice, discuss questions and understand what is hot in cloud computing. ",
            "startsAt": "2019-10-17T16:20:00",
            "endsAt": "2019-10-17T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "a27a0eb8-d6b8-4541-bf36-14cdabfa1495",
                "name": "Julio Faerman"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "135758",
              "title": "Pragmatic DevOps - How and Why",
              "description": "DevOps is about delivering value to your users faster and safer. This sounds great, but it's a goal, not a guide. Let's forget the buzzwords and the tools for a moment and talk about the practical steps you can take to improve your own DevOps story. More importantly, let's talk about why DevOps is worthwhile in the first place.\r\n\r\nStarting from basic principles, we'll look at practical tips for your whole process with the aim of actually delivering value to our users as effectively as we can. From taming your backlog, managing your code, and dealing with parallel workstreams, all the way to building and versioning, maintaining infrastructure, deploying safely to production, and gathering feedback to guide your next work.",
              "startsAt": "2019-10-17T09:00:00",
              "endsAt": "2019-10-17T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "29cb77cd-590c-44a0-8dc0-4cc46186ebe5",
                  "name": "Damian Brady"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "131042",
              "title": "How to build web apps with Vue.js and friends",
              "description": "Curious about \"that other framework\" for building web front ends? Wondering why people are talking about it so much?\r\n\r\nWell, wonder no more! This is a session you definitely want to come to.\r\n\r\nThis will be a mostly-code session where you'll see how Vue works, how you can manage application state, how you can structure and bundle larger applications, and how you can communicate with SignalR and REST APIs, and so much more!",
              "startsAt": "2019-10-17T09:00:00",
              "endsAt": "2019-10-17T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "04ed3fa6-9ce1-4c9c-8991-d429a8f73b39",
                  "name": "Richard Banks"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "116059",
              "title": "gRPC for ASP.NET Core, a new framework for high performance APIs",
              "description": "gRPC is a modern high performance RPC (Remote Procedure Call) framework that can run in any environment. gRPC is based on HTTP/2, Protocol Buffers and other modern standard-based technologies. Together with excellent tooling, it helps you create high throughput, low latency, real-time services.\r\n\r\nIn this talk, I will introduce gRPC for ASP.NET Core, a new gRPC framework that Microsoft is contributing to the Cloud Native Computing Foundation. I will compare gRPC with familiar REST-based JSON APIs, and recommend scenarios for using gRPC over other technologies. You will see how to integrate gRPC services with existing ASP.NET Core technologies like dependency injection, logging, and authentication, as we use gRPC to create lightning fast microservices and frontend applications.",
              "startsAt": "2019-10-17T09:00:00",
              "endsAt": "2019-10-17T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1a189579-1bb7-4d96-a54e-956c636e664a",
                  "name": "James Newton-King"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "132859",
              "title": "API team characteristics and best practices",
              "description": "After years of designing and developing APIs, I realized the value of API teams as a key component to build and manage APIs.\r\nWhat do API teams do? In “API-as-a-Product”(AaaP) approach, API teams maintain close communication with product customers and developers using their product while they create an API program.\r\nThis  enables API teams to design API based on customers needs. API program will eventually become a strong product that will survive longer in a world with ever-changing innovations and fierce competition. \r\nConsidering structural differences in organizations, I will focus to discuss the main characteristics and best practices based on scope of responsibilities for each role.\r\nI will also demonstrate examples of output artifacts created by each member of API teams in the API program.\r\n",
              "startsAt": "2019-10-17T09:00:00",
              "endsAt": "2019-10-17T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4c8c4bb5-9ad9-42b3-ab81-fa6909adb7d8",
                  "name": "Nahid Farrokhi"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "124925",
              "title": "Best practices for securing CI/CD pipeline",
              "description": "DevOps practices are in a place; containers are everywhere, pipelines are flying. We do Agile. We do DevOps. Now we try to follow security practices for protecting the deployed resources, too. This is a reason why DevSecOps is not hype anymore and is gaining more prominence. There is a lot of information about DevSecOps, but how to do it properly? Where to start? What are the best practices?\r\nIn this session, we will walk through an end-to-end scenario where we will deploy infrastructure components securely to Azure using Azure DevOps, Azure Container Registry and security tools. We will build a pipeline with security in mind to protect and detect potential security flows during the build.\r\nYou will learn:\r\n- How to build end-to-end CI/CD pipeline that builds the application and deploys infrastructure on Azure with security checks for the application, containers and infrastructure;\r\n- What are the security tools available for CI/CD pipeline and how to implement them in the best way into different Git workflows;\r\n- Best practices and patterns of building security pipelines.\r\n\r\n\r\n\r\n",
              "startsAt": "2019-10-17T09:00:00",
              "endsAt": "2019-10-17T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4c3efe89-ab58-4b28-a9c3-78251f25ee06",
                  "name": "Victoria Almazova"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "10:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "155018",
              "title": "Deep Learning with CNTK and F#",
              "description": "Deep Learning is a powerful and mysterious sounding Machine Learning technique. It is based on neural networks, and has shown impressive results in areas as different as computer vision, speech recognition, or automated language translation. And, with the recent release of the Microsoft Cognitive Toolkit (CNTK) .NET API, it is now possible to train and use deep learning models in .NET.\r\n\r\nIn this talk, we will introduce some of the ideas behind the approach, explain how it works behind the scenes, and demonstrate how F# makes it easy to learn models from data and used them from within your .NET code.",
              "startsAt": "2019-10-17T10:20:00",
              "endsAt": "2019-10-17T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4b8d886a-c63c-4b78-a829-ef0ffae50a81",
                  "name": "Mathias Brandewinder"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "102649",
              "title": "Getting Started with Apache Spark",
              "description": "As companies work to gain insight from ever-increasing amounts of data, data platform practitioners need tools which can scale along with the data. Early big data solutions in the Hadoop ecosystem assumed that data sizes overwhelmed available memory, emphasizing heavy disk usage to coordinate work between nodes. As the cost of memory decreases and the amount of memory available per server increases, we see a shift in the makeup of big data systems, emphasizing heavy memory usage instead of disk. Apache Spark, which focuses on memory-intensive operations, has taken advantage of this hardware shift to become the dominant solution for problems requiring distributed data. In this talk, we will take an introductory look at Apache Spark. We will review where it fits in the Hadoop ecosystem, cover how to get started and some of the basic functional programming concepts needed to understand Spark, and see examples of how we can use Spark to solve issues like calculating PageRank and analyzing large data sets.",
              "startsAt": "2019-10-17T10:20:00",
              "endsAt": "2019-10-17T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "7c382501-a37f-49b7-bb28-eb7692995323",
                  "name": "Kevin Feasel"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "126428",
              "title": "Iterative metrics, dashboards and monitors",
              "description": "From our code to our processes, at Atlassian we had learned to harness the power of iterative development. However, when it came to our dashboards and monitors, we noticed we were often falling short. In this talk, we share how we applied a more agile approach to solve a variety of challenges surrounding the definition and maintenance of some of our operational tooling, providing tips for how you can do the same.",
              "startsAt": "2019-10-17T10:20:00",
              "endsAt": "2019-10-17T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3f430a08-b385-4ee4-8179-6e83f2d93164",
                  "name": "Carmel Hinks"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "118306",
              "title": "Static Sites, Dynamic microservices, & Azure: How we built Microsoft Docs and Learn",
              "description": "The so-called JAMStack (JavaScript + APIs + Markup) is a technology-agnostic way to build high-performance, more secure, and more scalable apps for the cloud. In this session, you'll hear how Microsoft built Docs and Learn from the ground up to scale to over 100M page views/month, lowered costs, increased performance and enabled open-sourced community contributions using GitHub. ",
              "startsAt": "2019-10-17T10:20:00",
              "endsAt": "2019-10-17T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "54dd5aee-c38b-4983-9199-5f73adc0636b",
                  "name": "Dan Fernandez"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          }
        ]
      },
      {
        "slotStart": "11:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "124194",
              "title": "C# 8 and Beyond",
              "description": "One of the most popular programming language on the market is getting even better. With every iteration of C# we get more and more features that are meant to make our lives as developers a lot easier. \r\n\r\nJoin me in this session to explore what's new in C# 8, as well as what we can expect in the near (and far) future of C#!\r\n\r\nWe'll talk about:\r\n- News in C# 8\r\n- Pattern Matching (incl. Record Types)\r\n- Nullable Reference Types and How to Avoid Null Reference Exceptions\r\n- How Async & Await is Improving",
              "startsAt": "2019-10-17T11:40:00",
              "endsAt": "2019-10-17T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1f8704d7-04db-4f09-9c0e-d5abcbc7c9ff",
                  "name": "Filip Ekberg"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "102496",
              "title": "Monitoring a Global Multitenant Service",
              "description": "Monitoring, or handling and governing, your Service in the Cloud is not for the faint hearted. The Holy Grail is ever so elusive! Holy Grail meaning that Global Multitenant amazing Service that is going to take over the world and bring you lots of dough! Recent updates to Azure Monitoring create a clearer picture and providing for us more of a unified experience where all diagnosing, metrics, logs, alerting and more happens in one place. It’s like walking up to a “single pane of glass” where you can overview manage and act all in one place! Let us define the needs for monitoring a modern service hosted in the Cloud and walk through the landscape of services and features that makes this possible for us!",
              "startsAt": "2019-10-17T11:40:00",
              "endsAt": "2019-10-17T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c173d7ee-e503-46dc-9392-d016ca0c39f8",
                  "name": "Magnus Mårtensson"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "132498",
              "title": "Service degraded: Tackling burnout in the IT industry",
              "description": "IT has always been a high performance industry, but the pace of continual deployment and technology platform change is skyrocketing. What impact does this have on the humans behind the systems? In this session, you’ll hear real, vulnerable stories of burnout and the warning signs. Learn how to look after yourself and how to help others, so we can build supportive teams, managers, organisations and technical communities.",
              "startsAt": "2019-10-17T11:40:00",
              "endsAt": "2019-10-17T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4c7b8d47-0b4d-4376-9538-0d9b648080d2",
                  "name": "Sonia Cuff"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "132871",
              "title": "Busting the Func'ing Jargon",
              "description": "Does \"currying\" sound like a tasty dinner to you? Do \"algebraic data types\" give you flashbacks to high school math classes? Does tail call recursion make you want to turn tail? Do you get frustrated trying to read about functional programming only to be met with a wall of unfamiliar terms and jargon? Then this talk is for you! \r\n\r\nIt's hard to avoid the influence of functional programming in modern software development. FP ideas and techniques are now pervasive even in mainstream imperative programming languages and libraries. You've almost certainly been using some FP ideas already, even if you don't know it! In this talk we'll gradually walk through the very basics of functional programming and learning that the fancy jargon isn't really all that complicated after all! We'll pick up some basic F# along the way, but the jargon-busting will help you understand an FP library in any language.",
              "startsAt": "2019-10-17T11:40:00",
              "endsAt": "2019-10-17T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "aae5b378-b059-401b-9c6b-575c3e6ecd4c",
                  "name": "Daniel Chambers"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "99561",
              "title": "How to do in-app chaos testing",
              "description": "Relax! I'm not here to break your software. But I am here to show you how you can break the software you develop without changing the actual code!\r\nNow, I hear you thinking: \"Why on Earth should I do this? I have unit/integration/... tests\"\r\n\r\nAh, yes, you have tests. Tell me, do you test what happens if a third-party service goes down? Or takes a lot longer to respond when that service hits its busiest time of the day?\r\nOr what would happen if you tried to write data into a SQL database that has no more disk space?\r\n\r\nAll of these - and more! - cases can be discovered early, during development time. And I'll gladly show you how.",
              "startsAt": "2019-10-17T11:40:00",
              "endsAt": "2019-10-17T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "36a0edaf-4f66-4f54-a522-94a92e6a7f3a",
                  "name": "Wesley Cabus"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "13:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133511",
              "title": "Modern day C# development in Visual Studio 2019",
              "description": "In this demo-filled session from a Microsoft engineer who has worked on VS for over 15 years, you'll get the inside story on improvements across the board: from performance improvements in startup, and solution load, to editing, code style, quick fixes, refactorings, unit testing, debugging, deployment, and more.",
              "startsAt": "2019-10-17T13:40:00",
              "endsAt": "2019-10-17T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "9970d04b-f1b1-4b09-8acd-c1034a1507e4",
                  "name": "Kevin  Pilch"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "101381",
              "title": "Handling Angular Forms Without Losing Your Sanity",
              "description": "“Why’d you have to go and make things so complicated?” - Avril Lavigne, implementing Angular forms in 2019\r\n\r\nForms are such a basic part of web applications; how did they get so complicated? This talk will walk through Angular template driven vs. reactive forms and use cases for their implementation, basic & more complex form-validation, & custom component implementations like typeahead and date-pickers. This talk will also include some useful workarounds for those more complex PITA requirements that always seem to pop up in projects.",
              "startsAt": "2019-10-17T13:40:00",
              "endsAt": "2019-10-17T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "e5b9e6c6-1477-4b19-8347-06683a7417de",
                  "name": "Jennifer Wadella"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "114637",
              "title": "Microservices for building an IDE – The innards of JetBrains Rider",
              "description": "Ever wondered how IDE’s are built? In this talk, we’ll skip the marketing bit and dive into the architecture and implementation of JetBrains Rider. We’ll look at how and why we have built (and open sourced) a reactive protocol, and how the IDE uses a “microservices” architecture to communicate with the debugger, Roslyn, a WPF renderer and even other tools like Unity3D. We’ll explore how things are wired together, both in-process and across those microservices. Let’s geek out!",
              "startsAt": "2019-10-17T13:40:00",
              "endsAt": "2019-10-17T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b425717f-25c3-4863-b893-8f8bb943825a",
                  "name": "Maarten Balliauw"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "131144",
              "title": "Keeping your builds green using Docker",
              "description": "With the number of technologies, lanaguages and platforms that is part of most projects today just keeps on increasing, beginning work on a new project can be daunting. We often end up spending a lot of time installing the correct version of SDK's and build tools until we can make the project build and run. And then we have the same requirements for our build environment, and too often we find that build failures are due to differences between the local development machines and the build server environment, \r\n\r\nIn this session you will learn how to use Docker to define and run your builds both locally and on the build server. By describing your builds in Dockerfile we can make sure that it will build anywhere, without any other dependencies than Docker.\r\nWe will also look at how we can run build agents inside a Docker container to make sure that our build infrastructure is immutable and reliable.",
              "startsAt": "2019-10-17T13:40:00",
              "endsAt": "2019-10-17T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "54973c7d-2fe5-4a49-9a1c-a52afed4d6a4",
                  "name": "Jakob Ehn"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "148896",
              "title": "Lightning Talks",
              "description": "Talk 1: Let the Data Tell the Story - Has AlTaiar\r\nLet's be honest, most people get bored when we show too many graphs and numbers. How can we use storytelling techniques to communicate our data and insight? In this brief session, I will share with you key techniques and tools for effective storytelling in Power BI. Although the talk focuses on Power BI, most of the techniques can be applied everywhere else.\r\n\r\n-----------------------------------------\r\n\r\nTalk 2: Design non-relational database in a relational world - Negar Ghanbari\r\nAfter years of designing and developing object-oriented systems, I see almost everything in the world as an object. With that mindset, data model and schema design in relational databases isn’t very hard; but what about scalability, performance and other benefits that non-relational databases bring to the table? In this talk, I’ll share a few rules of thumb that helped me with designing data models for non-relational databases.\r\n\r\n-----------------------------------------\r\nTalk 3: Let's Talk Crazy: Blockchain + AI - Michael John Pena\r\nIn this lightning talk, the speaker will explain how Blockchain and AI (Artificial Intelligence) can correlate and conflict each other. This short session will explore how Blockchain being `deterministic` with its nature of immutability and AI being `probabilistic` by making it solve problems by understanding patterns and making predictions.\r\n\r\n-----------------------------------------\r\n\r\nTalk 4: The trust in Open Source Software - Vatsalya Goel\r\n\r\nEvery day developers rely on Open Source Software to deliver value and add functionality in their projects. While these Open Source projects are essential to any mature software, have we taken a step back an analysed whether the code it safe? Is this trust misplaced?\r\n\r\nThis talk will go through ways we can bring the trust back and give developers the confidence to add these packages in their projects. We will look at how malicious code can be added to these packages, what actions can be taken to prevent such packages from being added to our source code, and finally what steps need to be taken if a vulnerable package is found in our source code.",
              "startsAt": "2019-10-17T13:40:00",
              "endsAt": "2019-10-17T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "bd9a3ef6-d9f5-44a5-835a-e832cf47070f",
                  "name": "Has AlTaiar"
                },
                {
                  "id": "f55c3a87-135e-42e5-be15-da4df21a00d9",
                  "name": "Negar Ghanbari"
                },
                {
                  "id": "fc619aff-6bfa-435e-83bf-2d74ec96c4c0",
                  "name": "Michael John Pena"
                },
                {
                  "id": "8281d7ac-a795-44b2-b7d6-333e1d0f927c",
                  "name": "Vatsalya Goel"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "15:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133265",
              "title": "Quantum Computing Concepts",
              "description": "Quantum Computing is all over the news these days. Lots of mysterious words like `superposition` and `entanglement`, and unfamiliar physical phenomena.\r\n\r\nHow do you tell fact from fiction in the news? What do these things really mean? How does quantum computing work?\r\n\r\nUsing many pictures, a tiny bit of physics, and a little bit of mathematics, John will walk you through what the main concepts of quantum computing are, and how to get some intuition for how it works. We'll honestly talk about what Quantum Computing is great at, and where it's not. We'll look at what Quantum Computing code looks like, and we'll dissect a Quantum Algorithm to see how it works.\r\n\r\nWhen you leave this talk you should have a few concepts clear, and some tools to get started with exploring Quantum Computing further.\r\n\r\nThis is a follow-up talk to my \"Introduction to Quantum Computing\" talk, and will dive a little deeper into quantum computing than before.\r\n\r\nJohn was one of the original designers of Microsoft Q#, and works on the Microsoft Quantum Computing team with the software engineers and physicists who are building a full-stack quantum computer. ",
              "startsAt": "2019-10-17T15:00:00",
              "endsAt": "2019-10-17T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "5dc5066d-b1ea-4aef-b40b-16c6eb579281",
                  "name": "John Azariah"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "98973",
              "title": "I Don’t Need No Stinkin’ Framework - Mastering Shadow DOM",
              "description": "Want to create components that work regardless of the front-end framework you are using?\r\n\r\nTired of throwing away your components when you change front-end frameworks?\r\nWish you could just code it once and reuse it on all of your projects?\r\n\r\nMe too! Components are a staple of front-end development as they increase development speed, consistency, and reduce the need for repeat code. To create components often we turn to frameworks such as Angular, React, and Vue but we don't need to. \r\n\r\nUsing nothing more than HTML and Javascript that is readily available to us in all modern browsers we can create components that work without being tied to any one front-end framework. \r\n\r\nYou will walk away with the knowledge you need to go forth and create your own components, understand how to make them look gorgeous, and what if any limitations there are. Also, find out how you can bring back the blink tag!\r\n",
              "startsAt": "2019-10-17T15:00:00",
              "endsAt": "2019-10-17T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3336b62f-c81b-4892-8247-d34043767210",
                  "name": "Martine Dowden"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "132338",
              "title": "Bank Grade Security",
              "description": "Banks and financial services providers love to make some big claims when it comes to the security of their products and networks. The truth is, the phrase \"bank grade security\" has become an oxymoron. Many institutions have failed to implement basic security controls, least to keep ahead of security curve. Yet we continue to place considerable trust in them, and put up with security controls that are counter-productive, all to maintain the theatre of security.\r\n\r\nThis session will look at some of Australia's largest institutions. With simple tools we will make some of our own assessments on how well they secure their networks.",
              "startsAt": "2019-10-17T15:00:00",
              "endsAt": "2019-10-17T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b091fa67-10d0-4231-a405-f0a1ec32c120",
                  "name": "Kieran Jacobsen"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "130753",
              "title": "Apache Kafka Event streaming platform for .NET developers",
              "description": "When it comes time to choose a distributed messaging system, everyone knows the answer: Apache Kafka. But how about when you’re on the hook to choose a world-class, horizontally scalable stream data processing system? When you need not just publish and subscribe messaging, but also long-term storage, a flexible integration framework, and a means of deploying real-time stream processing applications at scale without having to integrate many different pieces of infrastructure yourself? The answer is still Apache Kafka.\r\n\r\nIn this talk, Viktor will give a rapid-fire review of the breadth of Kafka as a streaming data platform. You will see its internal architecture, including how it partitions messaging workloads in a fault-tolerant way and how it provides message durability. Viktor will explain Kafka’s approach to pub/sub messaging and how the Confluent .NET client offers a framework for computation over streaming data.",
              "startsAt": "2019-10-17T15:00:00",
              "endsAt": "2019-10-17T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4f858987-1a60-4da8-a4a2-045824a496c7",
                  "name": "Viktor Gamov"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "99669",
              "title": "The future of .NET desktop development",
              "description": "Was there ever any doubt that desktop development is alive and kicking? With .NET Core 3.0 all that doubt, if there was any, should melt away like snow in the sun. Let's have a look at all the juicy goodness that .NET Core 3.0 brings to UWP, WPF and even WinForms! This talk is aimed at developers who have done, or are doing, desktop development and want to see how bright their future shines.",
              "startsAt": "2019-10-17T15:00:00",
              "endsAt": "2019-10-17T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "23da6a18-7d00-4d39-8b8a-86abd5bd66e7",
                  "name": "Nico Vermeir"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "16:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "132455",
              "title": "Clean Architecture with ASP.NET Core 3.0",
              "description": "The explosive growth of web frameworks and the demands of users have changed the approach to building web applications. Many challenges exist, and getting started can be a daunting prospect. Let's change that now.\r\n\r\nThis talk provides practical guidance and recommendations. We will cover architecture, technologies, tools, and frameworks. We will examine strategies for organizing your projects, folders and files. We will design a system that is simple to build and maintain - all the way from development to production. You leave this talk inspired and prepared to take your enterprise application development to the next level.",
              "startsAt": "2019-10-17T16:20:00",
              "endsAt": "2019-10-17T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3a5abb12-c9e2-4641-8ace-a4c067ad8e8d",
                  "name": "Jason Taylor"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "138598",
              "title": "Beyond infrastructure as code DSLs",
              "description": "What if I told you that there was a way to use TypeScript (also python and GO) to declare your infrastructure. Once you do, there is no turning back, this is the next step in infrastructure as code.\r\n\r\nPulumi is a new generation open source infrastructure as code tool which opens up a new world of amazing possibilities without making your team learn a new language. It allows you to write code to declare your infrastructure, write tests for that code, then it will manage your infrastructure allowing you to preview changes against any environment just like you would expect from a good infrastructure management tool.\r\n\r\nIt also opens up a number of opportunities like easily being able to create composite resources, wrap APIs as dynamic resources, share your common infrastructure modules using and a whole bunch of other stuff. This will be a code heavy session so having some understanding of AWS/Azure/GCP will be highly beneficial. If you use an infrastructure as code tool, or want to, you need to come to this session.",
              "startsAt": "2019-10-17T16:20:00",
              "endsAt": "2019-10-17T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1ae7a4a9-3668-4703-840c-05b4cf857d7d",
                  "name": "Jake Ginnivan"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "143156",
              "title": "Access All Areas: Making Accessibility More Accessible",
              "description": "In this modern age more and more information is created in digital form, and there are an increasing amount of ways to consume this information (TV screens, smartwatches, computers, car systems, etc.) It is therefore vitally important that it should not only be available through different media, but also that you reach more and more people, regardless of their technical prowess, disabilities or means of interacting with technology. It is to address these challenges that several rules and regulations were created, to allow everyone the same basic access to this information that we sometimes take for granted.\r\n\r\nAchieving this lofty aim though is difficult. Although we have tools to create U/A (Universally Accessible) compliant documents from scratch, converting and validating existing documents is (for now at least) work that requires care and manual inspection, which takes time.\r\n\r\nIn addition, whilst the Universal Accessibility standards may have been created primarily to address the needs of people with disabilities, there are other issues that could be addressed. The ability to collect data can easily outstrip the throughput of data analysis, leading to masses of documents containing unknown information. It is tempting to make a small foray into this world of “dark data” to analyze and re-purpose some of these documents so that their contents can be processed more easily.\r\n\r\nIn this talk, we will demonstrate typical accessibility cases found in the wild that we should try to address, and discuss some existing strategies that can be used to mitigate the migration costs. In the near future we can automate this process to some extent with Machine Learning and Image Recognition tools, making the vast amount of existing digital information (whether it is in HTML, PDF form, or others) available to a much broader audience, and through an increasingly varied set of delivery mechanisms.",
              "startsAt": "2019-10-17T16:20:00",
              "endsAt": "2019-10-17T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "3a215fc5-484c-4558-b646-ab2984a41da1",
                  "name": "André Lemos"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "127722",
              "title": "TypeScript - Beyond the Basics",
              "description": "TypeScript enables web developers to improve the clarity and reliability of their code. It also enables more powerful tools for writing code. This led to its rapid rise in popularity. But what can it do for you beyond just adding types to your variables and parameters? In this talk, we look at some of the more advanced features in the language that can help you deliver valuable solutions in less time.\r\n\r\nIn this session, we will look at features such as:\r\n* union types\r\n* intersection types\r\n* mixins\r\n* generics\r\n\r\nWe will also look at some of the new features in TypeScript 3.4 and 3.5. ",
              "startsAt": "2019-10-17T16:20:00",
              "endsAt": "2019-10-17T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f46fcf13-76db-4850-9995-ac8d076ba1de",
                  "name": "Eric Potter"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "103583",
              "title": "Innovation and Trends in Cloud",
              "description": "The accelerated pace of innovation in cloud computing is one of its major benefits, but also one of its challenges. The new features and services released every other day can remove a lot of undifferentiated heavy lifting, but also require continuous awareness and study.\r\n\r\nThis session presents the latest and greatest from Amazon Web Services in a practical presentation. We´ll dive into the technical details and how to build solution leveraging the best of current and upcoming cloud technologies. We’ll talk about infrastructure, platforms, applications and more, including internet of things, big data and machine learning.\r\n\r\nJoin us and let us leverage the recent innovations in practice, discuss questions and understand what is hot in cloud computing. ",
              "startsAt": "2019-10-17T16:20:00",
              "endsAt": "2019-10-17T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "a27a0eb8-d6b8-4541-bf36-14cdabfa1495",
                  "name": "Julio Faerman"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "17:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "150684",
              "title": "Blazor in more depth",
              "description": "In this talk, Blazor's two architects will take you deeper into the framework, showing a range of more advanced features and their internal workings. We'll dig into server-side Blazor and how we built the SignalR-based mechanism for efficiently streaming UI updates, as well as authorization in Blazor WebAssembly, and more.\r\n\r\nThis will be a fairly informal talk that encourages conversation with the audience, so bring your questions! If you want to request any specific demos in advance, feel free to tell us on Twitter (Steve:@StevenSanderson, Ryan: @aVerySpicyBoi).",
              "startsAt": "2019-10-17T17:40:00",
              "endsAt": "2019-10-17T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "874615f7-95fe-4651-b3e1-68f15d4c446e",
                  "name": "Steve Sanderson"
                },
                {
                  "id": "d714f4ac-802a-4b8c-898c-32c816778fa0",
                  "name": "Ryan Nowak"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "132901",
              "title": "Thousands of concurrent connections with Azure SignalR Service",
              "description": "As much as everyone loves having real-time applications, it is a pain to have them in high traffic websites. Scaling is a big issue which can be easily solved by using Azure's SignalR Service.\r\n\r\nHow can we add real-time functionality to cloud hosted web applications? How can we test and handle high traffic volume without disrupting real-time capabilities? What new and interesting problems can we solve with a bi-directional-web feature-set?\r\n\r\nOur speakers will explain, demonstrate and guide the audience through current ASP.NET Core SignalR technology and the possibilities that real-time features can give to modern web applications.\r\nThey will also show how to use Serverless technology in the Azure cloud with Azure App Services, Azure Storage and Azure Functions to use SignalR APIs to build your Real-time web application.\r\n ",
              "startsAt": "2019-10-17T17:40:00",
              "endsAt": "2019-10-17T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "53a4f8c5-9fbe-455b-b392-7b403259cb30",
                  "name": "Nelly Sattari"
                },
                {
                  "id": "6aa26696-c92b-4fc5-ba6c-38b8875ca9ff",
                  "name": "Stafford Williams"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "101342",
              "title": "Kubernetes - going beyond the basics",
              "description": "So you've got a good grasp of the Kubernetes basics, you can create a cluster and deploy some applications to it, what about taking things up a notch?\r\n\r\nIn this talk and with demos we'll cover some more advanced topics within Kubernetes such as:-\r\n\r\nInfluencing the scheduling of pods\r\nControlling applications being scheduled using admission controllers\r\nAuto scaling of applications and clusters\r\nOptions for extending/customising Kubernetes using Custom Resources\r\nAdding a service mesh to improve traffic shaping\r\n\r\nAfter this talk attendees should have a much clearer understanding of the additional capability in Kubernetes and associated platforms that they may want to use to improve their application platform.\r\n\r\nAttendees should have a good understanding of the basic Kubernetes concepts and constructs.",
              "startsAt": "2019-10-17T17:40:00",
              "endsAt": "2019-10-17T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "fb14f65c-538d-4980-9010-8ffbd2d8d4b5",
                  "name": "Shahid Iqbal"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133385",
              "title": "A Tale Of Four Startups",
              "description": "Liam has had the pleasure of working for four different startups over the past 20 years, all quite different from one another.\r\n\r\nStartup 1 - working at an interactive television startup in the dot com bust in 2001, created by a major UK television channel company and a venture captial fund.\r\n\r\nStartup 2 - forming a brand new company, self funded to provide software services to television companies, successful but very small.\r\n\r\nStartup 3 - contracting to an MP3 download company, funded by angel investors and backed by an ex executive from a major record label.\r\n\r\nStartup 4 - a fully VC funded startup in the Shoreditch startup scene.\r\n\r\nThe aim is to provide some of the lessons learnt, what you might want to ask as a developer thinking of working at a startup, and how to know when to make sure you take all your belongings home just in case it's all going tits up.",
              "startsAt": "2019-10-17T17:40:00",
              "endsAt": "2019-10-17T18:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "1bcc3b50-a8da-47c3-850e-2fc5bde34edf",
                  "name": "Liam Westley"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          }
        ]
      }
    ]
  },
  {
    "date": "2019-10-18T00:00:00",
    "rooms": [
      {
        "id": 6823,
        "name": "Room 1",
        "sessions": [
          {
            "id": "133512",
            "title": "Keynote: .NET Core the Free, Open Source Framework for Web, Microservices, Big Data, Machine Learnin",
            "description": "In this session Scott will take you through the journey of all the things in .NET Core 3.0.\r\n\r\nThis will including building microservices, using machine learning and big data and include full stack web development with Blazor. And we will end looking at the future roadmap for .NET.",
            "startsAt": "2019-10-18T09:00:00",
            "endsAt": "2019-10-18T10:00:00",
            "isServiceSession": false,
            "isPlenumSession": true,
            "speakers": [
              {
                "id": "399d30b4-be7d-4c5d-8a75-7ae2fac1fee1",
                "name": "Scott  Hunter"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "128391",
            "title": "Empower Your Microservices with Istio Service Mesh",
            "description": "Microservices popularity has grown as a lot of organizations are moving their applications to microservices which enables their teams to autonomously own and operate their own microservices. The microservices have to communicate with each other so how do you efficiently connect, secure, and monitor those services? \r\n\r\nIstio is an open platform for providing a uniform way to integrate microservices, manage traffic flow across microservices, enforce policies and aggregate telemetry data.\r\n\r\nIn this session, we will cover what is service mesh and why it is important for you, what are the core components of Istio, how to empower your microservices to leverage the features that Istio provides on top of Kubernetes such as service discovery, load balancing, resiliency, and observability.",
            "startsAt": "2019-10-18T10:20:00",
            "endsAt": "2019-10-18T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "80f14329-6da2-4fb3-915d-7a2b1f49619f",
                "name": "Hossam Barakat"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133637",
            "title": "F# Code I Love",
            "description": ".NET Core includes a powerful functional programming language called F#. But how do you use it well?\r\nIn this talk, I’ll talk about examples of F# code I love and why. Along the way, I’ll talk about how it relates to doing language design, functional programming, object programming, language features and the “sweet spot” for using functional-first programming both as an individual and in teams. Much of it will be other people’s code.\r\n\r\nTalk objectives: Good Code, Bad Code: Learn which is which, from the Functional-First perspective\r\n\r\nTarget audience: Functional-Curious Developers",
            "startsAt": "2019-10-18T11:40:00",
            "endsAt": "2019-10-18T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "a8571746-257a-40c6-b7a2-e9526c9d6ae3",
                "name": "Don  Syme"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133521",
            "title": "Dungeons, Dragons and Functions",
            "description": "Dungeons & Dragons, or D&D, is the grand-daddy of all role playing games. While playing D&D is great fun, the rules are a bit daunting for the beginner. The basic rulebook, the PHB, clocks in at a solid 300 pages, and can be extended with multiple additional rule sets. This should come as no surprise to software engineers: this is, after all, documentation for a system that models a complex domain, and has been in use for over 40 years now, going through numerous redesigns over time.\r\n\r\nAs such, D&D rules make for a great exercise in domain modelling. In this talk, I will take you along my journey attempting to tame that monster. We will use no magic, but a weapon imbued with great power, F#; practical tips and tricks for the Adventurer on the functional road will be shared. So... roll 20 for initiative, and join us for an epic adventure in domain modeling with F#!",
            "startsAt": "2019-10-18T13:40:00",
            "endsAt": "2019-10-18T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "4b8d886a-c63c-4b78-a829-ef0ffae50a81",
                "name": "Mathias Brandewinder"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "127693",
            "title": "EVE Online: Defending our players from hackers and the evolution of account security",
            "description": "In this session I will walk you through the history of account security in EVE Online, the uniquely player-driven spaceship MMO game set in a vast online sci-fi sandbox, running for more than 15 years. With EVE being a single-shard universe known for it's huge battles, it is a big target for hackers who want to break into and steal player accounts for various purposes. I will show you what methods we have used to prevent and counter online attacks against our players, the challenges we've faced in doing so with minimal impact to user experience, where we've failed and succeeded and how we've had to constantly evolve in the process. By sharing our experiences and methods, we hope you can take advantage of them to increase the security of your own systems.",
            "startsAt": "2019-10-18T15:00:00",
            "endsAt": "2019-10-18T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "88c44f5f-d2fb-47ab-a569-004f372066b8",
                "name": "Stefán Jökull Sigurðarson"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          },
          {
            "id": "133057",
            "title": "Serverless and App Service Security on Azure",
            "description": "Deploying apps to Function as a Service (FaaS) and Platform as a Service (PaaS) on cloud have become very popular due to ease of use and scaling on demand without having to care about managing any infrastructure. But just because there is no infrastructure to patch and manage doesn’t mean that they are secure by default, the app developer is still responsible for security of the application.\r\n\r\nThis talk will provide practical tips to secure your Azure functions and App Service apps. It will include integrating with other services like azure storage, service bus, Cosmos Db and virtual network that are frequently used together in a microservices architecture. \r\n\r\n(This talk will assume some knowledge of Azure Functions and Azure App Services) ",
            "startsAt": "2019-10-18T16:20:00",
            "endsAt": "2019-10-18T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "eb18ee45-4eeb-4850-a73a-807f1477f341",
                "name": "Mahesh Krishnan"
              },
              {
                "id": "6cd631ad-1aaf-4fe9-bca1-eab5df689c94",
                "name": "Pratik Khasnabis"
              }
            ],
            "categories": [],
            "roomId": 6823,
            "room": "Room 1"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6824,
        "name": "Room 2",
        "sessions": [
          {
            "id": "131772",
            "title": "DevOps for the Commodore 64: so what's your excuse?",
            "description": "Ever heard  \"We can't do DevOps because of [insert excuse here]\" ?  This session will expose that lie with an automated delivery pipeline from the cloud to that symbol of mid 80's technology: the Commodore 64.  We'll then look at solutions to some of the most common excuses for embracing DevOps.",
            "startsAt": "2019-10-18T10:20:00",
            "endsAt": "2019-10-18T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c4dfc2aa-1551-4522-b295-fcbebddec96a",
                "name": "Todd Whitehead"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "130550",
            "title": "Introduction to Angular 8",
            "description": "Alain Chautard will go through an introduction to the Angular framework. If you don't know anything about Angular, that's a perfect opportunity to learn all of the basics and get you started with Angular 8! Alain will talk about TypeScript, components, services, pipes, and how to work with Angular CLI through live coding.",
            "startsAt": "2019-10-18T11:40:00",
            "endsAt": "2019-10-18T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "571e64ba-7cb5-4893-8cdb-072b74a27aef",
                "name": "Alain Chautard"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "152444",
            "title": "Containers/Docker - what, why and how",
            "description": "It's easy to feel like you've missed the Docker hype train with containers being discussed to death for the last few years, however there are always people arriving new to the technology and also new features/opportunities.\r\n \r\nThis talk will introduce containers and Docker and cover a variety of topics (with demos) including:\r\n-Why we might want to use containers\r\n-Improving developer workflow with containers\r\n-Security aspects of containers\r\n-Windows containers and how they fit into the landscape.\r\n-Options for running containers in production, including orchestration.\r\n \r\nIf you're completely new to containers/Docker or have some basic knowledge and want to fill in the gaps, this talk will cover the fundamentals right up to production usage.",
            "startsAt": "2019-10-18T13:40:00",
            "endsAt": "2019-10-18T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "fb14f65c-538d-4980-9010-8ffbd2d8d4b5",
                "name": "Shahid Iqbal"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "149168",
            "title": "Trials and Tribulations of a DevOps transformation in a large Company",
            "description": "Every organisation faces different problems when transitioning to a DevOps focused culture and large organisations can present more challenges than most. In this case study, I’ll share our experiences of how we put DevOps Theory into practice in a 3500-developer organisation; what worked for us, what didn’t work and the areas we are still working on 18 months into the transformation.\r\n\r\nThrough automation, we standardised CICD pipeline creation, which saved each team weeks of effort per pipeline. Automation enabled teams to take full advantage of the built in DevOps capabilities such as Shift Left on Security and Continuous Integration. Extending the automation into custom dashboards enabled teams to visualise their progress towards Continuous Delivery and take action where appropriate.",
            "startsAt": "2019-10-18T15:00:00",
            "endsAt": "2019-10-18T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "f029473f-4a45-46fa-9c74-4784f629636a",
                "name": "Ashley Noble"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          },
          {
            "id": "116291",
            "title": "Real-time Face Recognition With Microsoft Cognitive Services",
            "description": "This session is all about Microsoft Face API in practice!\r\nJK the man behind sswSophie.com will cover what it means to use Microsoft Cognitive Services in real-time, why offline detection libraries are essential and why you should use infrared and depth cameras like Kinect and Intel RealSense in your applications.\r\n",
            "startsAt": "2019-10-18T16:20:00",
            "endsAt": "2019-10-18T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "416d4948-2a4a-4a0f-95dd-cb4c1b64ab21",
                "name": "Jernej Kavka"
              }
            ],
            "categories": [],
            "roomId": 6824,
            "room": "Room 2"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6825,
        "name": "Room 3",
        "sessions": [
          {
            "id": "133514",
            "title": "Repeatable execution",
            "description": "What should applications log? Much enterprise code has logging code liberally sprinkled over it. Often, too much. Programmers log lots of things out of fear of not being able to troubleshoot problems that might occur in production. Even if you log a lot, however, how do you know that you haven’t missed a piece of crucial information?\r\n\r\nIn this talk, I’ll discuss a formal method for deciding what to log, and what you don’t need to log. Learning from functional programming, distinguishing between pure and impure code holds the key to such decisions. Examples will be mainly in C#, with some Haskell as well. No knowledge of Haskell is necessary.",
            "startsAt": "2019-10-18T10:20:00",
            "endsAt": "2019-10-18T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "84f7d361-4388-44ad-bc48-31695762bc6d",
                "name": "Mark Seemann"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "132556",
            "title": "Doing Infrastructure as Code? You Can Do Better",
            "description": "Developing infrastructure as code often gets cumbersome. There are long feedback cycles for the developers from the moment they are done with a bit of coding until they find out that something is broken. With the fix there is going to be another wait time, often minutes, yet to find out another thing needs to be fixed. This wastes a lot of time and it is not ideal. There is also some bits of the code that may never be tested on the Dev or CI or even Test environments, for example some things that are specific to the Prod environment, may never be tested until we actually go to production.\r\n\r\nIn this talk we will show techniques that can be used to make developing Infrastructure as Code a better experience for developers, by establishing a faster feedback cycle and also producing higher quality well-tested code.",
            "startsAt": "2019-10-18T11:40:00",
            "endsAt": "2019-10-18T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "80f8276b-0183-40c9-8783-d529b9dfd853",
                "name": "Effy Elden"
              },
              {
                "id": "e69c7eb8-9898-456f-941f-29ec28e8e7f6",
                "name": "Shohre Mansouri"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "126849",
            "title": "CSS Grid - What is this Magic?!",
            "description": "We’ve all heard a lot in the last year about a new advancement in the world of CSS, called CSS Grid. Starting off at whispers, we’re now starting to hear it as a deafening roar as more and more developers write about it, talk about it, share it and start using it. In the world of front end, I see it everywhere I turn and am excited as I start to use it in my own projects.\r\n\r\nBut what does this new CSS specification mean for software developers, and why should you care about it? In the world of tech today, we can do so many amazing things and use whatever language we choose across a wide range of devices and platforms. Whether it’s the advent of React and React Native, or frameworks like Electron, it’s easier than ever to build one app that works on multiple platforms with the language we know and work with best. The ability to do this also expands to styling apps on any platform using CSS, and therefore being able to utilise the magical thing that is\r\nCSS Grid.\r\n\r\nThe reason CSS Grid is gaining so much attention, is because it’s a game changer for front end and layouts. With a few simple lines of code, we can now create imaginative, dynamic, responsive layouts (yep, I know that’s a lot of buzz words). While a lot of people are calling this the new ‘table layout’, grid gives us so much more, with the ability to spread cells across columns and rows to whatever size you choose, dictate which direction new items flow, allow cells to move around to fit in place and even tell certain cells exactly where they need to sit.\r\n\r\nWhile there is so much to worry about when developing an app, CSS Grid means that you can worry less about building the layout on the front end, and more about making sure the back end works well. Let me show you how the magic works.",
            "startsAt": "2019-10-18T13:40:00",
            "endsAt": "2019-10-18T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d387e75c-ed26-4dc6-8612-0f18abdfd9f5",
                "name": "Amy Kapernick"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "128392",
            "title": "Secure Your Kubernetes Containers",
            "description": "Kubernetes became the de-facto standard for deploying and managing containers at scale. However, many developers might not be aware of the new threats that containers introduce and what are the common practices to mitigate them… How to verify that the container images you are using are safe? How to patch unsafe images? How to avoid containers breakout? How to ensure that a compromised container will not gain access to the rest of the cluster?\r\n\r\nThis talk focuses on pragmatic approaches to make your container images and running containers are more secure leveraging features like pod security context, pod security policy and admission control.",
            "startsAt": "2019-10-18T15:00:00",
            "endsAt": "2019-10-18T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "80f14329-6da2-4fb3-915d-7a2b1f49619f",
                "name": "Hossam Barakat"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          },
          {
            "id": "125455",
            "title": "DesignOps - How to get ideas out faster",
            "description": "In this talk I will be discussing how Designers and Developers can work together to get ideas into their customer's hands as quickly as possible, so that they can be used, measured and improved. \r\n\r\nProduct testing will let you know if your customers 'can' use your product, but it will not tell you if they 'will' use your product. These two things are very different. We need to get ideas out quickly and start monitoring and measuring the outcomes.\r\n\r\nTechniques like 'Dual Track Delivery' and 'Designing your backlog' can help multi-capability teams get ideas into the live environment quickly and I will be discussing how they work and the risks you need to be aware of.",
            "startsAt": "2019-10-18T16:20:00",
            "endsAt": "2019-10-18T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d81456c5-e48d-42a5-af7c-b7cb88e66d73",
                "name": "Kristy Sachse"
              }
            ],
            "categories": [],
            "roomId": 6825,
            "room": "Room 3"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6826,
        "name": "Room 4",
        "sessions": [
          {
            "id": "133255",
            "title": "Full Stack Accessibility, and the Business Case for being Inclusive",
            "description": "Hey, yep, Hi — it’s me again! Your friendly neighbourhood accessibility advocate.\r\n\r\nIn this talk, I’m gonna take a break from aria-labels, alt-tags, and screen-reader demos.\r\n\r\nDon't get me wrong, that stuff is still important and needs to be shared as widely as possible, but, you see, I seem to have uncovered bigger problems. One of them is that basic human rights is hard to assign story points to, and we all know what happens to un-estimated stories during Sprint Planning!\r\n\r\nThere seems to be a bit of a misconception that the responsibility of accessibility falls on the shoulders of the front-end engineer or UX designer. In reality, true accessibility, and inclusivity, goes much deeper than text size and colour contrast.\r\n\r\nIn this talk, I’m going to show you how accessibility helps you print money. Nope, we’re not going to launch a new cryptocurrency, but you are leaving money on the table by locking potential customers out of your product.\r\n\r\nI am going to talk numbers - how measurable and tangible returns can be made from an investment in accessibility and inclusion. Plus how to think about accessibility at every layer of your stack and how to build it into your workplace culture.",
            "startsAt": "2019-10-18T10:20:00",
            "endsAt": "2019-10-18T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "99ab0b95-df07-4220-b278-623b75b6b350",
                "name": "Larene Le Gassick"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "121356",
            "title": "Tackling Dreaded .Net Cold Starts When Going Serverless",
            "description": "Out of all the runtimes that AWS natively supports, .NET experiences the worst performance regarding cold starts.  Developers using .NET are reluctant to take up serverless in a time when serverless is on the rise, threatening the relevance of .NET in ever-evolving software.\r\n\r\nHowever, there are solutions specifically tailored for .NET, to overcome cold starts. Implementing these solutions warrant the need to understand the serverless architecture and .NET paradigms to realize where it all goes wrong. Only then can we devise impactful solutions to reduce cold starts and, ideally, even eliminate them completely.\r\n\r\nAt the moment, there are no easily accessible and comprehensive resources discussing the issue. Solutions to the .NET cold start problem are scattered across forums and opinion pages. This session aims at presenting a well-researched insight into the problem, and extensively tested solutions. ",
            "startsAt": "2019-10-18T11:40:00",
            "endsAt": "2019-10-18T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "aea683c3-8ca6-457e-b2db-cb05575b1e7e",
                "name": "Sarjeel Yusuf"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "133045",
            "title": "Reverse Engineering a Classic Video Game",
            "description": "Reverse engineering can be a great tool to learn something new. Pulling apart the code of more advanced developers is the way most of us learn to code in the first place. But what if you don’t have the original source code? Challenge accepted!\r\n\r\nIn this session, you will learn basic tools and techniques to reverse engineer a piece of software using a worked example. It will be a nostalgic trip, as we break down my favourite mid-90s MS-DOS game - BioForge (by Origin Systems) - and piece it back together again in C#. We’ll combine computer science fundamentals, curiosity, and a hex editor to learn about file structures, compression, graphics, audio and more. We’ll also cover debugging skills and ideas to make your own software more resistant to reverse engineering.",
            "startsAt": "2019-10-18T13:40:00",
            "endsAt": "2019-10-18T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "fc7eb058-7e04-4b40-abc1-bca4a1063464",
                "name": "Tim Comport"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "132897",
            "title": "DataDevOps for the Modern Data Warehouse on Microsoft Azure",
            "description": "The Modern Data Warehouse architecture is a response to the emergence of Big Data, Machine Learning and Advanced Analytics. DevOps is a key aspect of successfully operationalizing a multi-source Modern Data Warehouse. \r\nWhile there are many examples of how to build CI/CD pipelines for traditional applications, applying these concepts to Big Data Analytical Pipelines is a relatively new and emerging area. In this demo heavy session, we will see how to apply DevOps principles to an end-to-end Data Pipeline built on the Microsoft Azure Data Platform with technologies such as Data Factory, Databricks, Data Lake Gen2, and AzureDevOps.",
            "startsAt": "2019-10-18T15:00:00",
            "endsAt": "2019-10-18T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "194ba329-d80b-46b1-952e-ab608803b353",
                "name": "Lace Lofranco"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          },
          {
            "id": "133004",
            "title": "How to put a Penguin in a Cloud: Linux on Azure",
            "description": "In the 5 years since Satya Nadella announced \"Microsoft Hearts Linux\", the Azure team has been busy!\r\nThis talk explores some of the many exciting ways you can leverage Linux and the related open source universe on the Azure platform.\r\nIt starts by introducing core Linux concepts before covering VMs, App Services, Docker Containers, Linux-based azure functions and IOT with Azure Sphere.\r\n",
            "startsAt": "2019-10-18T16:20:00",
            "endsAt": "2019-10-18T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "86626c43-0347-4913-956b-3456b08e26c8",
                "name": "Brendan Richards"
              }
            ],
            "categories": [],
            "roomId": 6826,
            "room": "Room 4"
          }
        ],
        "hasOnlyPlenumSessions": false
      },
      {
        "id": 6827,
        "name": "Room 5",
        "sessions": [
          {
            "id": "119547",
            "title": "AI in the battle against fakes.",
            "description": "Counterfeit products have been a longstanding and growing pain for companies. In addition to impacting company revenue, they damage brand reputation and customer confidence. Our company was asked to build a solution for a global electronics brand that can identify counterfeit products by just taking one picture on a smartphone.\r\n\r\nIn this session we zoom into the building blocks that make this AI solution work. We’ll find out that there is much more to it than just training a convolutional neural network. We look at challenges like how to manage and monitor the AI model and how to build and improve the model in a way that fits your DevOps production chain.\r\n\r\nLearn how we used Azure Functions, Cosmos DB and Docker to build a solid foundation. See how we used Azure Machine Learning service to train the models. And find out how we used Azure DevOps to control, build and deploy this state-of-the-art solution. \r\n\r\nAI used to only be in the hands of data science PhDs. Now any developer can integrate this exciting technology into their next project. Join us to find out how.\r\n\r\n\r\n",
            "startsAt": "2019-10-18T10:20:00",
            "endsAt": "2019-10-18T11:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "36a25c2a-4204-42f0-9ba8-d7b9c6f67226",
                "name": "Henk Boelman"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "128112",
            "title": "Opening Doors with JSON Web Tokens",
            "description": "\r\nLet’s connect our front door to the internet! What could possibly go wrong? Securing IoT is hard, and the last thing we want to do is let some stranger in!\r\n\r\nLet’s take a step back and consider other ways of securing that door, and granting access remotely. How can we do this without connecting your door to the internet, and while adhering to common protocols and data formats throughout?\r\n\r\nIn this talk, you will learn:\r\n* how JSON Web Tokens can be used to transmit credentials to an air-gapped device;\r\n* how this process can still allow someone to grant remote access;\r\n* how to apply this theory to other IoT devices; and\r\n* how this theory can help even in IoT devices that need direct internet access.\r\n\r\nThe talk includes a live demo, featuring an actual door.",
            "startsAt": "2019-10-18T11:40:00",
            "endsAt": "2019-10-18T12:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "c939990d-6108-453b-a35f-e65ea921bf71",
                "name": "Ben Dechrai"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "148898",
            "title": "Lightning Talks",
            "description": "Talk 1: Explain functors, applicatives and monads with kids' craft - York Wong\r\nFunctors, applicatives and monads are the most important data types in functional programming. They can handle null safety, asynchronicity and conditional branch by composing pure functions. I am going to use some ping pong balls, containers and tubes to explain how they work.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 2: How to build and test an Alexa skill in ten minutes - Azi Farjad\r\nBuilding voice experiences is fun. Join me in this talk where I build and test and Alexa skill end to end in TEN minutes. You will see how easy it is to build an skill using Alexa voice service.\r\n-----------------------------------------------------------------\r\nTalk 3: Can you read me now? - Martine Dowden\r\n15% of the world’s population has some form of disability, but only very few of our websites are actually accessible. But what does that word mean anyway? Accessible? In this talk we will go over what accessibility means in the context of web content and how to get your team started in making sure your content can be accessed by all.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 4: Navigating the tech graveyard in an ever scaling world - Dom Wenden\r\nShip it, ship it, ship it. This is the mantra we all live and breathe by. But what happens when your micro services, your micro sites and your micro components scale faster than the number of engineers you have around to keep them all up and running? In this session I'll be going through how to live with shipping until you can't ship no more while steering clear of the tech graveyard.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 5: Code Chautari | Reducing the Digital Divide in Public Schools of Nepal - Amrit Puri\r\n\r\n",
            "startsAt": "2019-10-18T13:40:00",
            "endsAt": "2019-10-18T14:40:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "47e823fe-affb-40bf-a38a-7370e354578f",
                "name": "Azi Farjad"
              },
              {
                "id": "f7cf88d3-dfd6-4d3e-a82e-d636cd66ab18",
                "name": "York Wong"
              },
              {
                "id": "1ea30bbc-cc74-450c-b190-1880fa9ae7ef",
                "name": "Dom Wenden"
              },
              {
                "id": "3336b62f-c81b-4892-8247-d34043767210",
                "name": "Martine Dowden"
              },
              {
                "id": "be5d42f0-3295-4d1b-b284-e8ee6e23ddb6",
                "name": "Amrit Puri"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "131490",
            "title": "Testing doesn’t bite, unless it does",
            "description": "Do you find testing the necessary evil at the end of a feature development cycle? Or do you follow test driven development and are an advocate of comprehensive test suites? Whether we enjoy it or not, testing is a critical element in the development process. And it’s not an easy one. We often forget to consider what happens when things go wrong, users change their minds or they simply make their own workflow around our bugs.\r\n\r\nIn this talk, I will show you some of the commonly missed user behaviours I have come across and how you can account for them in your own testing. And I will entertain you with an unexpected language caveat that bit my backside. Having started my career as a tester before I became a developer I have seen my share of bugs that could easily be prevented. I’d like to share the common ones with you, and together, we will give them a farewell, forever.",
            "startsAt": "2019-10-18T15:00:00",
            "endsAt": "2019-10-18T16:00:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "b5a3e62c-b081-4617-9a55-b8623c62a6b1",
                "name": "Blanka Krotilova"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          },
          {
            "id": "99099",
            "title": "Commuting like a developer",
            "description": "While remote work is the dream, reality for many of us is office work. Which means commuting. Have you paid much attention to your commute and how it affects your work day? I never did, just kept scrolling on my phone, until I decided to test three popular methods of commuting.\r\n\r\nJoin me on a journey to discover what skills you can take from commuting, including planning and organising your day, improving your mindfulness and wellbeing, or using the time to learn and develop new skills. I’ll share with you how you can find more time in the day through commuting and how you can create your own journey to happiness and growth.",
            "startsAt": "2019-10-18T16:20:00",
            "endsAt": "2019-10-18T17:20:00",
            "isServiceSession": false,
            "isPlenumSession": false,
            "speakers": [
              {
                "id": "d28cc0f4-2748-4a9e-b8e7-8ec69615814e",
                "name": "Anton Ball"
              }
            ],
            "categories": [],
            "roomId": 6827,
            "room": "Room 5"
          }
        ],
        "hasOnlyPlenumSessions": false
      }
    ],
    "timeSlots": [
      {
        "slotStart": "09:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133512",
              "title": "Keynote: .NET Core the Free, Open Source Framework for Web, Microservices, Big Data, Machine Learnin",
              "description": "In this session Scott will take you through the journey of all the things in .NET Core 3.0.\r\n\r\nThis will including building microservices, using machine learning and big data and include full stack web development with Blazor. And we will end looking at the future roadmap for .NET.",
              "startsAt": "2019-10-18T09:00:00",
              "endsAt": "2019-10-18T10:00:00",
              "isServiceSession": false,
              "isPlenumSession": true,
              "speakers": [
                {
                  "id": "399d30b4-be7d-4c5d-8a75-7ae2fac1fee1",
                  "name": "Scott  Hunter"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "10:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "128391",
              "title": "Empower Your Microservices with Istio Service Mesh",
              "description": "Microservices popularity has grown as a lot of organizations are moving their applications to microservices which enables their teams to autonomously own and operate their own microservices. The microservices have to communicate with each other so how do you efficiently connect, secure, and monitor those services? \r\n\r\nIstio is an open platform for providing a uniform way to integrate microservices, manage traffic flow across microservices, enforce policies and aggregate telemetry data.\r\n\r\nIn this session, we will cover what is service mesh and why it is important for you, what are the core components of Istio, how to empower your microservices to leverage the features that Istio provides on top of Kubernetes such as service discovery, load balancing, resiliency, and observability.",
              "startsAt": "2019-10-18T10:20:00",
              "endsAt": "2019-10-18T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "80f14329-6da2-4fb3-915d-7a2b1f49619f",
                  "name": "Hossam Barakat"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "131772",
              "title": "DevOps for the Commodore 64: so what's your excuse?",
              "description": "Ever heard  \"We can't do DevOps because of [insert excuse here]\" ?  This session will expose that lie with an automated delivery pipeline from the cloud to that symbol of mid 80's technology: the Commodore 64.  We'll then look at solutions to some of the most common excuses for embracing DevOps.",
              "startsAt": "2019-10-18T10:20:00",
              "endsAt": "2019-10-18T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c4dfc2aa-1551-4522-b295-fcbebddec96a",
                  "name": "Todd Whitehead"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "133514",
              "title": "Repeatable execution",
              "description": "What should applications log? Much enterprise code has logging code liberally sprinkled over it. Often, too much. Programmers log lots of things out of fear of not being able to troubleshoot problems that might occur in production. Even if you log a lot, however, how do you know that you haven’t missed a piece of crucial information?\r\n\r\nIn this talk, I’ll discuss a formal method for deciding what to log, and what you don’t need to log. Learning from functional programming, distinguishing between pure and impure code holds the key to such decisions. Examples will be mainly in C#, with some Haskell as well. No knowledge of Haskell is necessary.",
              "startsAt": "2019-10-18T10:20:00",
              "endsAt": "2019-10-18T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "84f7d361-4388-44ad-bc48-31695762bc6d",
                  "name": "Mark Seemann"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133255",
              "title": "Full Stack Accessibility, and the Business Case for being Inclusive",
              "description": "Hey, yep, Hi — it’s me again! Your friendly neighbourhood accessibility advocate.\r\n\r\nIn this talk, I’m gonna take a break from aria-labels, alt-tags, and screen-reader demos.\r\n\r\nDon't get me wrong, that stuff is still important and needs to be shared as widely as possible, but, you see, I seem to have uncovered bigger problems. One of them is that basic human rights is hard to assign story points to, and we all know what happens to un-estimated stories during Sprint Planning!\r\n\r\nThere seems to be a bit of a misconception that the responsibility of accessibility falls on the shoulders of the front-end engineer or UX designer. In reality, true accessibility, and inclusivity, goes much deeper than text size and colour contrast.\r\n\r\nIn this talk, I’m going to show you how accessibility helps you print money. Nope, we’re not going to launch a new cryptocurrency, but you are leaving money on the table by locking potential customers out of your product.\r\n\r\nI am going to talk numbers - how measurable and tangible returns can be made from an investment in accessibility and inclusion. Plus how to think about accessibility at every layer of your stack and how to build it into your workplace culture.",
              "startsAt": "2019-10-18T10:20:00",
              "endsAt": "2019-10-18T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "99ab0b95-df07-4220-b278-623b75b6b350",
                  "name": "Larene Le Gassick"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "119547",
              "title": "AI in the battle against fakes.",
              "description": "Counterfeit products have been a longstanding and growing pain for companies. In addition to impacting company revenue, they damage brand reputation and customer confidence. Our company was asked to build a solution for a global electronics brand that can identify counterfeit products by just taking one picture on a smartphone.\r\n\r\nIn this session we zoom into the building blocks that make this AI solution work. We’ll find out that there is much more to it than just training a convolutional neural network. We look at challenges like how to manage and monitor the AI model and how to build and improve the model in a way that fits your DevOps production chain.\r\n\r\nLearn how we used Azure Functions, Cosmos DB and Docker to build a solid foundation. See how we used Azure Machine Learning service to train the models. And find out how we used Azure DevOps to control, build and deploy this state-of-the-art solution. \r\n\r\nAI used to only be in the hands of data science PhDs. Now any developer can integrate this exciting technology into their next project. Join us to find out how.\r\n\r\n\r\n",
              "startsAt": "2019-10-18T10:20:00",
              "endsAt": "2019-10-18T11:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "36a25c2a-4204-42f0-9ba8-d7b9c6f67226",
                  "name": "Henk Boelman"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "11:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133637",
              "title": "F# Code I Love",
              "description": ".NET Core includes a powerful functional programming language called F#. But how do you use it well?\r\nIn this talk, I’ll talk about examples of F# code I love and why. Along the way, I’ll talk about how it relates to doing language design, functional programming, object programming, language features and the “sweet spot” for using functional-first programming both as an individual and in teams. Much of it will be other people’s code.\r\n\r\nTalk objectives: Good Code, Bad Code: Learn which is which, from the Functional-First perspective\r\n\r\nTarget audience: Functional-Curious Developers",
              "startsAt": "2019-10-18T11:40:00",
              "endsAt": "2019-10-18T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "a8571746-257a-40c6-b7a2-e9526c9d6ae3",
                  "name": "Don  Syme"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "130550",
              "title": "Introduction to Angular 8",
              "description": "Alain Chautard will go through an introduction to the Angular framework. If you don't know anything about Angular, that's a perfect opportunity to learn all of the basics and get you started with Angular 8! Alain will talk about TypeScript, components, services, pipes, and how to work with Angular CLI through live coding.",
              "startsAt": "2019-10-18T11:40:00",
              "endsAt": "2019-10-18T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "571e64ba-7cb5-4893-8cdb-072b74a27aef",
                  "name": "Alain Chautard"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "132556",
              "title": "Doing Infrastructure as Code? You Can Do Better",
              "description": "Developing infrastructure as code often gets cumbersome. There are long feedback cycles for the developers from the moment they are done with a bit of coding until they find out that something is broken. With the fix there is going to be another wait time, often minutes, yet to find out another thing needs to be fixed. This wastes a lot of time and it is not ideal. There is also some bits of the code that may never be tested on the Dev or CI or even Test environments, for example some things that are specific to the Prod environment, may never be tested until we actually go to production.\r\n\r\nIn this talk we will show techniques that can be used to make developing Infrastructure as Code a better experience for developers, by establishing a faster feedback cycle and also producing higher quality well-tested code.",
              "startsAt": "2019-10-18T11:40:00",
              "endsAt": "2019-10-18T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "80f8276b-0183-40c9-8783-d529b9dfd853",
                  "name": "Effy Elden"
                },
                {
                  "id": "e69c7eb8-9898-456f-941f-29ec28e8e7f6",
                  "name": "Shohre Mansouri"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "121356",
              "title": "Tackling Dreaded .Net Cold Starts When Going Serverless",
              "description": "Out of all the runtimes that AWS natively supports, .NET experiences the worst performance regarding cold starts.  Developers using .NET are reluctant to take up serverless in a time when serverless is on the rise, threatening the relevance of .NET in ever-evolving software.\r\n\r\nHowever, there are solutions specifically tailored for .NET, to overcome cold starts. Implementing these solutions warrant the need to understand the serverless architecture and .NET paradigms to realize where it all goes wrong. Only then can we devise impactful solutions to reduce cold starts and, ideally, even eliminate them completely.\r\n\r\nAt the moment, there are no easily accessible and comprehensive resources discussing the issue. Solutions to the .NET cold start problem are scattered across forums and opinion pages. This session aims at presenting a well-researched insight into the problem, and extensively tested solutions. ",
              "startsAt": "2019-10-18T11:40:00",
              "endsAt": "2019-10-18T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "aea683c3-8ca6-457e-b2db-cb05575b1e7e",
                  "name": "Sarjeel Yusuf"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "128112",
              "title": "Opening Doors with JSON Web Tokens",
              "description": "\r\nLet’s connect our front door to the internet! What could possibly go wrong? Securing IoT is hard, and the last thing we want to do is let some stranger in!\r\n\r\nLet’s take a step back and consider other ways of securing that door, and granting access remotely. How can we do this without connecting your door to the internet, and while adhering to common protocols and data formats throughout?\r\n\r\nIn this talk, you will learn:\r\n* how JSON Web Tokens can be used to transmit credentials to an air-gapped device;\r\n* how this process can still allow someone to grant remote access;\r\n* how to apply this theory to other IoT devices; and\r\n* how this theory can help even in IoT devices that need direct internet access.\r\n\r\nThe talk includes a live demo, featuring an actual door.",
              "startsAt": "2019-10-18T11:40:00",
              "endsAt": "2019-10-18T12:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "c939990d-6108-453b-a35f-e65ea921bf71",
                  "name": "Ben Dechrai"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "12:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "ab74317d-98b0-44c4-b257-de4da2562b82",
              "title": "Lunch",
              "description": null,
              "startsAt": "2019-10-18T12:40:00",
              "endsAt": "2019-10-18T13:40:00",
              "isServiceSession": true,
              "isPlenumSession": true,
              "speakers": [],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          }
        ]
      },
      {
        "slotStart": "13:40:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133521",
              "title": "Dungeons, Dragons and Functions",
              "description": "Dungeons & Dragons, or D&D, is the grand-daddy of all role playing games. While playing D&D is great fun, the rules are a bit daunting for the beginner. The basic rulebook, the PHB, clocks in at a solid 300 pages, and can be extended with multiple additional rule sets. This should come as no surprise to software engineers: this is, after all, documentation for a system that models a complex domain, and has been in use for over 40 years now, going through numerous redesigns over time.\r\n\r\nAs such, D&D rules make for a great exercise in domain modelling. In this talk, I will take you along my journey attempting to tame that monster. We will use no magic, but a weapon imbued with great power, F#; practical tips and tricks for the Adventurer on the functional road will be shared. So... roll 20 for initiative, and join us for an epic adventure in domain modeling with F#!",
              "startsAt": "2019-10-18T13:40:00",
              "endsAt": "2019-10-18T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "4b8d886a-c63c-4b78-a829-ef0ffae50a81",
                  "name": "Mathias Brandewinder"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "152444",
              "title": "Containers/Docker - what, why and how",
              "description": "It's easy to feel like you've missed the Docker hype train with containers being discussed to death for the last few years, however there are always people arriving new to the technology and also new features/opportunities.\r\n \r\nThis talk will introduce containers and Docker and cover a variety of topics (with demos) including:\r\n-Why we might want to use containers\r\n-Improving developer workflow with containers\r\n-Security aspects of containers\r\n-Windows containers and how they fit into the landscape.\r\n-Options for running containers in production, including orchestration.\r\n \r\nIf you're completely new to containers/Docker or have some basic knowledge and want to fill in the gaps, this talk will cover the fundamentals right up to production usage.",
              "startsAt": "2019-10-18T13:40:00",
              "endsAt": "2019-10-18T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "fb14f65c-538d-4980-9010-8ffbd2d8d4b5",
                  "name": "Shahid Iqbal"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "126849",
              "title": "CSS Grid - What is this Magic?!",
              "description": "We’ve all heard a lot in the last year about a new advancement in the world of CSS, called CSS Grid. Starting off at whispers, we’re now starting to hear it as a deafening roar as more and more developers write about it, talk about it, share it and start using it. In the world of front end, I see it everywhere I turn and am excited as I start to use it in my own projects.\r\n\r\nBut what does this new CSS specification mean for software developers, and why should you care about it? In the world of tech today, we can do so many amazing things and use whatever language we choose across a wide range of devices and platforms. Whether it’s the advent of React and React Native, or frameworks like Electron, it’s easier than ever to build one app that works on multiple platforms with the language we know and work with best. The ability to do this also expands to styling apps on any platform using CSS, and therefore being able to utilise the magical thing that is\r\nCSS Grid.\r\n\r\nThe reason CSS Grid is gaining so much attention, is because it’s a game changer for front end and layouts. With a few simple lines of code, we can now create imaginative, dynamic, responsive layouts (yep, I know that’s a lot of buzz words). While a lot of people are calling this the new ‘table layout’, grid gives us so much more, with the ability to spread cells across columns and rows to whatever size you choose, dictate which direction new items flow, allow cells to move around to fit in place and even tell certain cells exactly where they need to sit.\r\n\r\nWhile there is so much to worry about when developing an app, CSS Grid means that you can worry less about building the layout on the front end, and more about making sure the back end works well. Let me show you how the magic works.",
              "startsAt": "2019-10-18T13:40:00",
              "endsAt": "2019-10-18T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d387e75c-ed26-4dc6-8612-0f18abdfd9f5",
                  "name": "Amy Kapernick"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133045",
              "title": "Reverse Engineering a Classic Video Game",
              "description": "Reverse engineering can be a great tool to learn something new. Pulling apart the code of more advanced developers is the way most of us learn to code in the first place. But what if you don’t have the original source code? Challenge accepted!\r\n\r\nIn this session, you will learn basic tools and techniques to reverse engineer a piece of software using a worked example. It will be a nostalgic trip, as we break down my favourite mid-90s MS-DOS game - BioForge (by Origin Systems) - and piece it back together again in C#. We’ll combine computer science fundamentals, curiosity, and a hex editor to learn about file structures, compression, graphics, audio and more. We’ll also cover debugging skills and ideas to make your own software more resistant to reverse engineering.",
              "startsAt": "2019-10-18T13:40:00",
              "endsAt": "2019-10-18T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "fc7eb058-7e04-4b40-abc1-bca4a1063464",
                  "name": "Tim Comport"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "148898",
              "title": "Lightning Talks",
              "description": "Talk 1: Explain functors, applicatives and monads with kids' craft - York Wong\r\nFunctors, applicatives and monads are the most important data types in functional programming. They can handle null safety, asynchronicity and conditional branch by composing pure functions. I am going to use some ping pong balls, containers and tubes to explain how they work.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 2: How to build and test an Alexa skill in ten minutes - Azi Farjad\r\nBuilding voice experiences is fun. Join me in this talk where I build and test and Alexa skill end to end in TEN minutes. You will see how easy it is to build an skill using Alexa voice service.\r\n-----------------------------------------------------------------\r\nTalk 3: Can you read me now? - Martine Dowden\r\n15% of the world’s population has some form of disability, but only very few of our websites are actually accessible. But what does that word mean anyway? Accessible? In this talk we will go over what accessibility means in the context of web content and how to get your team started in making sure your content can be accessed by all.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 4: Navigating the tech graveyard in an ever scaling world - Dom Wenden\r\nShip it, ship it, ship it. This is the mantra we all live and breathe by. But what happens when your micro services, your micro sites and your micro components scale faster than the number of engineers you have around to keep them all up and running? In this session I'll be going through how to live with shipping until you can't ship no more while steering clear of the tech graveyard.\r\n\r\n-----------------------------------------------------------------\r\n\r\nTalk 5: Code Chautari | Reducing the Digital Divide in Public Schools of Nepal - Amrit Puri\r\n\r\n",
              "startsAt": "2019-10-18T13:40:00",
              "endsAt": "2019-10-18T14:40:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "47e823fe-affb-40bf-a38a-7370e354578f",
                  "name": "Azi Farjad"
                },
                {
                  "id": "f7cf88d3-dfd6-4d3e-a82e-d636cd66ab18",
                  "name": "York Wong"
                },
                {
                  "id": "1ea30bbc-cc74-450c-b190-1880fa9ae7ef",
                  "name": "Dom Wenden"
                },
                {
                  "id": "3336b62f-c81b-4892-8247-d34043767210",
                  "name": "Martine Dowden"
                },
                {
                  "id": "be5d42f0-3295-4d1b-b284-e8ee6e23ddb6",
                  "name": "Amrit Puri"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "15:00:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "127693",
              "title": "EVE Online: Defending our players from hackers and the evolution of account security",
              "description": "In this session I will walk you through the history of account security in EVE Online, the uniquely player-driven spaceship MMO game set in a vast online sci-fi sandbox, running for more than 15 years. With EVE being a single-shard universe known for it's huge battles, it is a big target for hackers who want to break into and steal player accounts for various purposes. I will show you what methods we have used to prevent and counter online attacks against our players, the challenges we've faced in doing so with minimal impact to user experience, where we've failed and succeeded and how we've had to constantly evolve in the process. By sharing our experiences and methods, we hope you can take advantage of them to increase the security of your own systems.",
              "startsAt": "2019-10-18T15:00:00",
              "endsAt": "2019-10-18T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "88c44f5f-d2fb-47ab-a569-004f372066b8",
                  "name": "Stefán Jökull Sigurðarson"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "149168",
              "title": "Trials and Tribulations of a DevOps transformation in a large Company",
              "description": "Every organisation faces different problems when transitioning to a DevOps focused culture and large organisations can present more challenges than most. In this case study, I’ll share our experiences of how we put DevOps Theory into practice in a 3500-developer organisation; what worked for us, what didn’t work and the areas we are still working on 18 months into the transformation.\r\n\r\nThrough automation, we standardised CICD pipeline creation, which saved each team weeks of effort per pipeline. Automation enabled teams to take full advantage of the built in DevOps capabilities such as Shift Left on Security and Continuous Integration. Extending the automation into custom dashboards enabled teams to visualise their progress towards Continuous Delivery and take action where appropriate.",
              "startsAt": "2019-10-18T15:00:00",
              "endsAt": "2019-10-18T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "f029473f-4a45-46fa-9c74-4784f629636a",
                  "name": "Ashley Noble"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "128392",
              "title": "Secure Your Kubernetes Containers",
              "description": "Kubernetes became the de-facto standard for deploying and managing containers at scale. However, many developers might not be aware of the new threats that containers introduce and what are the common practices to mitigate them… How to verify that the container images you are using are safe? How to patch unsafe images? How to avoid containers breakout? How to ensure that a compromised container will not gain access to the rest of the cluster?\r\n\r\nThis talk focuses on pragmatic approaches to make your container images and running containers are more secure leveraging features like pod security context, pod security policy and admission control.",
              "startsAt": "2019-10-18T15:00:00",
              "endsAt": "2019-10-18T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "80f14329-6da2-4fb3-915d-7a2b1f49619f",
                  "name": "Hossam Barakat"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "132897",
              "title": "DataDevOps for the Modern Data Warehouse on Microsoft Azure",
              "description": "The Modern Data Warehouse architecture is a response to the emergence of Big Data, Machine Learning and Advanced Analytics. DevOps is a key aspect of successfully operationalizing a multi-source Modern Data Warehouse. \r\nWhile there are many examples of how to build CI/CD pipelines for traditional applications, applying these concepts to Big Data Analytical Pipelines is a relatively new and emerging area. In this demo heavy session, we will see how to apply DevOps principles to an end-to-end Data Pipeline built on the Microsoft Azure Data Platform with technologies such as Data Factory, Databricks, Data Lake Gen2, and AzureDevOps.",
              "startsAt": "2019-10-18T15:00:00",
              "endsAt": "2019-10-18T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "194ba329-d80b-46b1-952e-ab608803b353",
                  "name": "Lace Lofranco"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "131490",
              "title": "Testing doesn’t bite, unless it does",
              "description": "Do you find testing the necessary evil at the end of a feature development cycle? Or do you follow test driven development and are an advocate of comprehensive test suites? Whether we enjoy it or not, testing is a critical element in the development process. And it’s not an easy one. We often forget to consider what happens when things go wrong, users change their minds or they simply make their own workflow around our bugs.\r\n\r\nIn this talk, I will show you some of the commonly missed user behaviours I have come across and how you can account for them in your own testing. And I will entertain you with an unexpected language caveat that bit my backside. Having started my career as a tester before I became a developer I have seen my share of bugs that could easily be prevented. I’d like to share the common ones with you, and together, we will give them a farewell, forever.",
              "startsAt": "2019-10-18T15:00:00",
              "endsAt": "2019-10-18T16:00:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "b5a3e62c-b081-4617-9a55-b8623c62a6b1",
                  "name": "Blanka Krotilova"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      },
      {
        "slotStart": "16:20:00",
        "rooms": [
          {
            "id": 6823,
            "name": "Room 1",
            "session": {
              "id": "133057",
              "title": "Serverless and App Service Security on Azure",
              "description": "Deploying apps to Function as a Service (FaaS) and Platform as a Service (PaaS) on cloud have become very popular due to ease of use and scaling on demand without having to care about managing any infrastructure. But just because there is no infrastructure to patch and manage doesn’t mean that they are secure by default, the app developer is still responsible for security of the application.\r\n\r\nThis talk will provide practical tips to secure your Azure functions and App Service apps. It will include integrating with other services like azure storage, service bus, Cosmos Db and virtual network that are frequently used together in a microservices architecture. \r\n\r\n(This talk will assume some knowledge of Azure Functions and Azure App Services) ",
              "startsAt": "2019-10-18T16:20:00",
              "endsAt": "2019-10-18T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "eb18ee45-4eeb-4850-a73a-807f1477f341",
                  "name": "Mahesh Krishnan"
                },
                {
                  "id": "6cd631ad-1aaf-4fe9-bca1-eab5df689c94",
                  "name": "Pratik Khasnabis"
                }
              ],
              "categories": [],
              "roomId": 6823,
              "room": "Room 1"
            },
            "index": 0
          },
          {
            "id": 6824,
            "name": "Room 2",
            "session": {
              "id": "116291",
              "title": "Real-time Face Recognition With Microsoft Cognitive Services",
              "description": "This session is all about Microsoft Face API in practice!\r\nJK the man behind sswSophie.com will cover what it means to use Microsoft Cognitive Services in real-time, why offline detection libraries are essential and why you should use infrared and depth cameras like Kinect and Intel RealSense in your applications.\r\n",
              "startsAt": "2019-10-18T16:20:00",
              "endsAt": "2019-10-18T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "416d4948-2a4a-4a0f-95dd-cb4c1b64ab21",
                  "name": "Jernej Kavka"
                }
              ],
              "categories": [],
              "roomId": 6824,
              "room": "Room 2"
            },
            "index": 1
          },
          {
            "id": 6825,
            "name": "Room 3",
            "session": {
              "id": "125455",
              "title": "DesignOps - How to get ideas out faster",
              "description": "In this talk I will be discussing how Designers and Developers can work together to get ideas into their customer's hands as quickly as possible, so that they can be used, measured and improved. \r\n\r\nProduct testing will let you know if your customers 'can' use your product, but it will not tell you if they 'will' use your product. These two things are very different. We need to get ideas out quickly and start monitoring and measuring the outcomes.\r\n\r\nTechniques like 'Dual Track Delivery' and 'Designing your backlog' can help multi-capability teams get ideas into the live environment quickly and I will be discussing how they work and the risks you need to be aware of.",
              "startsAt": "2019-10-18T16:20:00",
              "endsAt": "2019-10-18T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d81456c5-e48d-42a5-af7c-b7cb88e66d73",
                  "name": "Kristy Sachse"
                }
              ],
              "categories": [],
              "roomId": 6825,
              "room": "Room 3"
            },
            "index": 2
          },
          {
            "id": 6826,
            "name": "Room 4",
            "session": {
              "id": "133004",
              "title": "How to put a Penguin in a Cloud: Linux on Azure",
              "description": "In the 5 years since Satya Nadella announced \"Microsoft Hearts Linux\", the Azure team has been busy!\r\nThis talk explores some of the many exciting ways you can leverage Linux and the related open source universe on the Azure platform.\r\nIt starts by introducing core Linux concepts before covering VMs, App Services, Docker Containers, Linux-based azure functions and IOT with Azure Sphere.\r\n",
              "startsAt": "2019-10-18T16:20:00",
              "endsAt": "2019-10-18T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "86626c43-0347-4913-956b-3456b08e26c8",
                  "name": "Brendan Richards"
                }
              ],
              "categories": [],
              "roomId": 6826,
              "room": "Room 4"
            },
            "index": 3
          },
          {
            "id": 6827,
            "name": "Room 5",
            "session": {
              "id": "99099",
              "title": "Commuting like a developer",
              "description": "While remote work is the dream, reality for many of us is office work. Which means commuting. Have you paid much attention to your commute and how it affects your work day? I never did, just kept scrolling on my phone, until I decided to test three popular methods of commuting.\r\n\r\nJoin me on a journey to discover what skills you can take from commuting, including planning and organising your day, improving your mindfulness and wellbeing, or using the time to learn and develop new skills. I’ll share with you how you can find more time in the day through commuting and how you can create your own journey to happiness and growth.",
              "startsAt": "2019-10-18T16:20:00",
              "endsAt": "2019-10-18T17:20:00",
              "isServiceSession": false,
              "isPlenumSession": false,
              "speakers": [
                {
                  "id": "d28cc0f4-2748-4a9e-b8e7-8ec69615814e",
                  "name": "Anton Ball"
                }
              ],
              "categories": [],
              "roomId": 6827,
              "room": "Room 5"
            },
            "index": 4
          }
        ]
      }
    ]
  }
]
