[
  {
    "Title": "Pain, Grief, Perseverance and Technology",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "pain-grief-perseverance-and-technology",
    "Day": "Tuesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "24 May 2022 | 08:45 - 09:45",
    "Track": "Keynote",
    "TrackSlug": "keynote",
    "Speakers": "Derek Martin",
    "Description": "Everyone\u0027s story is different but we all can find inspiration in the similarities of life\u0027s challenges. My story began at the ripe age of 13 when I was traveling the world and hanging out of helicopters on TV above an erupting volcano. Next was sailing on a boat around the entire planet. Then...life. From success and \u0022fame\u0022 at an early age, to the pain and anguish of mental illness, to a successful (yet often times complicated) career in technology, I\u0027ll chronicle my journey and what lessons I\u0027ve learned along the way. Lift people up. Make others famous. Smile from the background. Breathe."
  },
  {
    "Title": "A Love Letter to Rust",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "a-love-letter-to-rust",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Rainer Stropek",
    "Description": "Rust is exciting. The language promises zero-cost abstractions without the stability and security problems often seen with C and C\u002B\u002B. Given that, Rust is gaining popularity in the area of systems programming – but it is not limited to that. Rust is a great choice for application development, too. You can use it to build blazingly fast web APIs in the cloud or enhance web apps using WebAssembly. In this talk, Rainer Stropek, founder of the Rust Linz Meetup, will talk about the reasons for his excitement for Rust. You will hear about some unique properties of the language and its related tooling that distinguishes Rust from other programming platforms. If you have not found the time to look into Rust but you are curious about it, this is the session for you."
  },
  {
    "Title": "User Definied Functions – From SQL 2000 – SQL 2019",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "user-definied-functions-from-sql-2000-sql-2019",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Uwe Ricken",
    "Description": "User Definied Functions (UDF) came first with SQL Server 2000. While developers welcomed the introduction of these features, they became a DAB nightmare.\r\nThis session start with the very basics of User Definied Functions (SCALAR, MULTI-LINE, INLINE) and shows the problems of functions when they get used in queries.\r\nLots of improvements have been made since to speed up queries which are using UDF.\r\nThe second part of the session treat the great improvements of execution of functions and show ways to reach new records in the execution of your queries with UDFs.\r\n"
  },
  {
    "Title": "An introduction to Microsoft Dataverse for Developers",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "an-introduction-to-microsoft-dataverse-for-developers",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Jurgen Postelmans",
    "Description": "Are you new to Microsoft Dataverse and wonder what role it might play for developers? This session will explain the concepts behind and benefits of Microsoft Dataverse. Creating an environment, building a data model using tables, columns, relationships,… The session also talks about the extensibility points of Microsoft Dataverse for .NET and JavaScript/TypeScript developers using plug-ins, custom actions, Azure Service Bus,… "
  },
  {
    "Title": "Automating Database Deployments using Azure DevOps",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "automating-database-deployments-using-azure-devops",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Grant Fritchey",
    "Description": "Automation is a fundamental aspect when adopting a DevOps-style deployment process. Learn how you can use Azure DevOps tools to automate your database deployments successfully. Topics include the challenge of supporting more than one database system, deployments in Azure SQL Database, Postgres and Maria DB. We\u0027ll also show how you can use Azure DevOps to deploy to an on-premises database. All the databases you have under management can have their deployments automated. Come to this session to learn how."
  },
  {
    "Title": "Adventures of building Promitor, an open-source product",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "adventures-of-building-promitor-an-opensource-product",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Tom Kerkhove",
    "Description": "When a wild idea becomes an open-source product you need to get organized, automate and make a contributor-friendly environment - It is more than just writing code.\r\n\r\nThis talk will walk through the phases that the product has been through, how I was discouraged by others and how important it is to not become the slave of your own success."
  },
  {
    "Title": "Business Continuity...It is really not that hard",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "business-continuityit-is-really-not-that-hard",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Robert Hedblom, Dieter Wijckmans",
    "Description": "In today’s world where cybercrime with ransomware attacks is exceeding the revenue of the global drug industry it has never been more important to understand how to keep your business up and running in a crisis. Everyone knows that a plan for continuity is crucial for your survival but the ones created has very poor quality or has never been tested nor validated or rehearsed.\r\n\r\nDuring this session we will go through the five most common scenarios and what to keep in mind when planning for continuity and crisis. You will gain a deeper understanding of the five most common BCP scenarios:\r\n\r\n• Loss of Technology\r\n• Loss of Building\r\n• Denial of Access of Building\r\n• Loss of Staff\r\n• Loss of Supplier\r\n\r\nEveryone is relying on Backup but the Restore Capabilities must be the focus controlling the RTO, RPO and RLO for your Business Services. Backed up data is only valid if validated via a Restore Test. How should you build your Disaster Recovery Plans? Do you know your Business Services dependencies? What are Business Services? How should those be monitored and are there different monitoring approaches that applies to different tiers within your company? There are many questions regarding \u0022Loss of Technology\u0022 that needs to be sorted out. Attending this session you will gain some insight on how to understand you own business and goals for recovery.\r\n\r\nCOVID-19 has set a permanent mark in the way we need to work regarding crisis management. What are the major changes that you need to honour? How should, or must, your Crisis Management Team (CMT) operate.\r\n\r\nWelcome to this session where you will gain a deeper understanding on how to create a sustainable Business Continuity Plan (BCP) that really works.\r\n"
  },
  {
    "Title": "Azure Service Bus - The Architect\u0027s Cut",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "azure-service-bus-the-architects-cut",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Clemens Vasters",
    "Description": "I\u0027m the lead architect of Azure Service Bus. This is the deep dive. Not a feature delta session, but a behind-the-curtain view of how the technology works and an exploration of features the audience might not know about. "
  },
  {
    "Title": "Azure Cloud Shell in Depth",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "azure-cloud-shell-in-depth",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Aleksandar Nikolic",
    "Description": "Azure Cloud Shell is managed by Microsoft, it gives us access to a pre-authenticated environment loaded with popular command-line tools and languages, and offers PowerShell and Bash experience to manage Azure resources. It\u0027s the easiest way to manage Azure with command-line tools. Would you like to know how authentication works inside Cloud Shell? How Cloud Shell stores your files? Is it possible to install your own versions of tools? Maybe you want to customize prompts in PowerShell and Bash? Best practices to deal with secrets? Are you curious how to run the Cloud Shell container locally? Join us for behind-the-scenes details about Azure Cloud Shell and improve the way you use it."
  },
  {
    "Title": "What\u0027s new in ASP.NET Core",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "whats-new-in-aspnet-core",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Jon Galloway",
    "Description": "We\u0027ll look at what\u0027s new in ASP.NET Core in .NET 6, including minimal APIs, SPA updates, Blazor, microservices, and more."
  },
  {
    "Title": "App Service Networking Demystified",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "app-service-networking-demystified",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "gitte vermeiren",
    "Description": "Ever wonder how Azure app service networking works out of the box? What are ways to make sure users of my application make calls to it in a secure way and how in its turn can my app in a secure way connect to its backend Azure SQL database? \r\nIn this session I will draw out how network communication travels and how you can lock it down. It\u0027s also loaded with demo\u0027s you can try out and set up as well in your own environment. \r\nThis session is based on best practices we preach (well, maybe not preach, let\u0027s say \u0027tell\u0027) to FastTrack for Azure customers so their deployments are production ready from the start. "
  },
  {
    "Title": "Comet",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "comet",
    "Day": "Tuesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "24 May 2022 | 10:00 - 11:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "James Clancey",
    "Description": "Let\u0027s explore Comet, an MVU framework for .NET MAUI. "
  },
  {
    "Title": "Automating Azure Migrations",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "automating-azure-migrations",
    "Day": "Tuesday",
    "TimeSlot": "11:05 - 11:25",
    "Date": "24 May 2022 | 11:05 - 11:25",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Yannick Dils",
    "Description": "Migrating resources to Azure has never been more accessible with all the latest automation possibilities that Azure Migrate offers. This session will cover the different automation possibilities from onboarding an Azure Migrate project until the final migration of a resource to Azure."
  },
  {
    "Title": "Real World Minimal APIs",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "real-world-minimal-apis",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Shawn Wildermuth",
    "Description": "With .NET 6, Minimal APIs come to .NET developers. But this introduction poses the question of whether this replaces or enhances our existing Controller-base APIs. In this talk, Shawn Wildermuth will show you how Minimal APIs work and why you\u0027d use them instead of Controller-based APIs (as well as when to maturate your APIs from Minimal to Controller-based APIs)."
  },
  {
    "Title": "An Introduction to Elasticsearch for .NET Developers",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "an-introduction-to-elasticsearch-for-net-developers",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Steve Gordon",
    "Description": "Elasticsearch is a leading search and analytics solution used by thousands of companies worldwide for use cases, including search, analytics, monitoring and security information and event management. With an emphasis on speed, scale, and relevance, it\u0027s transforming how the world uses data.\r\n\r\nIn this session, we\u0027ll learn about leveraging the power of Elasticsearch within .NET applications, utilising the Elasticsearch.NET client library. Join Steve to learn about the .NET client, how to install it in .NET applications and use it to begin indexing and searching documents.\r\n\r\nThis session is aimed at software developers, looking to get started by combining the capabilities of Elasticsearch with their .NET applications. You\u0027ll leave with the core knowledge, required to begin using Elasticsearch and the NEST client library."
  },
  {
    "Title": "Securing ASP.NET Core 6 with OAuth2 and OpenID Connect: Making the Complicated, Less So.",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "securing-aspnet-core-6-with-oauth2-and-openid-connect-making-the-complicated-less-so",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Ruby Jane Cabagnot",
    "Description": "OAuth2 and OpenID Connect are popular standard protocols for implementing security features to protect your application and data from unauthorized access. In this session, let\u0027s simplify the flow of OAuth2 and OpenID Connect. Let\u0027s see how we can secure our ASP.Net Core App using the Microsoft Identity Platform, enabling us to add identity authentication and authorization of our solution in a few easy steps. "
  },
  {
    "Title": "Ordering the chaos - cleaning logs and ordering events in microservices",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "ordering-the-chaos-cleaning-logs-and-ordering-events-in-microservices",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Adam Furmanek",
    "Description": "No more monoliths! Let\u0027s use microservices and asynchronous invocations everywhere! But how to track logs when multiple calls are in place, clocks are skewed, network is faulty and something goes wrong? How to figure out what happened first? And how to debug this single request which caused so many troubles?\r\n\r\nIn this talk I explain problems with synchronizing clocks and why relying on timestamps doesn\u0027t work in the world of microservices. We will see happened-before relation, vector clocks, correlation ids and other patterns used to introduce some meaningful order. We will understand why common understanding of \u0022time\u0022 is misleading in distributed systems and what to use to mitigate that.\r\n\r\nExamples will be in .NET. Level 200, moderately intense session."
  },
  {
    "Title": "Building Offline Capable Progressive Web Apps",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "building-offline-capable-progressive-web-apps",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Yves Goeleven",
    "Description": "Past weekend we delivered over 1300 meals at our basketball clubs takeaway fundraiser in under 3 hours.\r\n\r\nThe unsung hero of this effort is an order management system that runs equally well online as well as offline.\r\n\r\nBuilding such a system proved to be quite a challenge.\r\n\r\nIn this session I want to share some of the architectural, design and implementation lessons that I\u0027ve learned along the way while solving this challenge."
  },
  {
    "Title": "Building beautiful Teams apps - Teams UI Toolkit for Makers",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "building-beautiful-teams-apps-teams-ui-toolkit-for-makers",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Carmen Ysewijn",
    "Description": "If you\u0027re building a canvas app that will be used inside Microsoft Teams, ideally you want it to look like a Teams-native application. Very similar to the ones that code-first developers create. But how do they get their apps to look Teams-native? Part of the secret is the Teams UI Toolkit: the set of design standards for Microsoft Teams apps that is shared publicly by Microsoft.\r\n\r\nIn this session we will first answer the question why we, as Makers, should even think about app design. We will also take a look at the Teams UI toolkit, where to find it and how to work with it. Finally, we will apply the guidelines to an example app and see the difference it makes. At the end of the session, you will have all the tools in hand to apply this to your own Teams canvas apps.\r\n"
  },
  {
    "Title": "NuGet: things you didn\u0027t know",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "nuget-things-you-didnt-know",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Claire Novotny",
    "Description": "In this hands-on tips-and-tricks session, you’ll learn how to increase your productivity and discover a few new things about your favorite package manager directly from the NuGet team. Bring your questions as there will be plenty of time for Q\u0026A."
  },
  {
    "Title": "Let\u0027s take a look at Azure Monitor!",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "lets-take-a-look-at-azure-monitor",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Robert Hedblom, Dieter Wijckmans",
    "Description": "You have a lot of workloads running in Azure but are they properly monitored? Connecting them to your onprem monitoring tool is most of the time a hassle so why not use Azure monitor to keep an eye on those workloads? Join this session to witness how far Microsoft have come to deliver monitoring as a service with full control to tailor to your needs. "
  },
  {
    "Title": "Time traveling in the cloud.  Time series analytics with Microsoft Azure.",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "time-traveling-in-the-cloud-time-series-analytics-with-microsoft-azure",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Sam Vanhoutte",
    "Description": "The data collected in IoT scenarios are often thought of as a ‘time series”. Through this data it’s possible to understand the past and use this data to anticipate the future. But time traveling is never straight forward. That’s why in this session Sam will walk you through the processing of time series data and he\u0027ll discuss some common roadblocks in time series analytics.\r\n \r\nNot only will we focus on time series analytics and predictions for the future but you’ll also see which Azure services can be used and how they can be applied. We will tackle Time Series Insights, Azure Machine Learning and Azure Data Explorer and how they can be combined in data driven solutions."
  },
  {
    "Title": "Azure Event Hubs - The Architect\u0027s Cut",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "azure-event-hubs-the-architects-cut",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Clemens Vasters",
    "Description": "I\u0027m the lead architect of Azure Event Hubs. This is the deep dive. Not a feature delta session, but a behind-the-curtain view of how the technology works and an exploration of features the audience might not know about. "
  },
  {
    "Title": "Battle for the Hybrid Cloud: The Spring Edition",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "battle-for-the-hybrid-cloud-the-spring-edition",
    "Day": "Tuesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "24 May 2022 | 11:30 - 12:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Wim Matthyssen, Micha Wets",
    "Description": "These days more and more companies are using a hybrid cloud model. But still a lot of those companies struggle with how they can view, govern and secure all their hybrid resources in a seamless way.\r\n\r\nLuckily these days those companies can overcome their cloud fears and pains and start using the full potential of their hybrid infrastructure, by combining the capabilities of Azure Arc and Windows Admin Center.\r\n\r\nTo guide you on your way, in this session, Micha and Wim will first look into Azure Arc-enabled servers.\r\n\r\nSecondly they will also show you how you can use Windows Admin Center (WAC) to integrate and manage Azure Hybrid services, for example how you can manage Azure Stack HCI with WAC \u0026 Azure Arc.\r\n\r\nSo join them in this demo-packed session and learn all about how Azure Arc and Windows Admin Center can help you to manage your hybrid cloud. So let the battle begin."
  },
  {
    "Title": "Breaking a Monolith Data Import into Azure Logic Apps Quick",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "breaking-a-monolith-data-import-into-azure-logic-apps-quick",
    "Day": "Tuesday",
    "TimeSlot": "12:30 - 12:50",
    "Date": "24 May 2022 | 12:30 - 12:50",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Wouter Bauchart",
    "Description": "Everyone probably has made them: Scheduled tasks to download files and import the data into a different database after some transformations and business logic.\r\nBut those can get vulnerable quickly by piling up its purposes and external dependencies, creating a small monolith.\r\n \r\nAzure has different resource types to help you create these kind of tasks.\r\nBut if you start from an existing one, you can use Azure Logic Apps to offload your external connections without any code.\r\nCombine it with Azure Storage Accounts and Service Bus to create a whole extendable integration solution.\r\n \r\nWe\u0027ll start with an Azure Function that was responsible for all steps of an import, and break it down with Logic Apps to the point where it can ingest files from different sources at the same time.\r\n"
  },
  {
    "Title": "Distributed systems in Azure",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "distributed-systems-in-azure",
    "Day": "Tuesday",
    "TimeSlot": "13:00 - 13:20",
    "Date": "24 May 2022 | 13:00 - 13:20",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Tom Reunes",
    "Description": "CAS, a Customs4trade product, is an Azure native SaaS solution to simplify and standardize the customs declarations of the C4T customers. \r\nIn this talk we will focus on the high level architecture of the solution, the choices that were made and the steps that were taken to bring this startup to the state we are in right now."
  },
  {
    "Title": "Tailwind CSS: A Different Approach to Styling Websites",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "tailwind-css-a-different-approach-to-styling-websites",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Shawn Wildermuth",
    "Description": "Using a prescribed CSS framework like Bootstrap can help you quickly build websites, but when you need more control and want to leverage your CSS skills, Tailwind CSS provides a different approach. In this talk, Shawn Wildermuth will show you how Tailwind CSS is a different way to style your websites."
  },
  {
    "Title": "The Developer\u0027s Guide to Data Modelling with Document Databases",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "the-developers-guide-to-data-modelling-with-document-databases",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Adrienne Braganza Tacke",
    "Description": "Document databases enable an extremely flexible data model for faster and more iterative development. At the same time, however, the data model you design can seriously speed up or slow down your application. 😅 While flexibility is great in theory, it\u0027s not practical in reality!\r\n \r\nIf you’re wondering how to develop a data model with document databases (or if it\u0027s even necessary!), or wondering how to leverage its flexibility (rather than be hindered by it), wonder no more! In this session, we\u0027ll:\r\n\r\n- Examine a methodology that helps us develop a data model using document databases.\r\n- Put the methodology we learn into practice by walking through a use case, phase-by-phase.\r\n- Understand not only HOW to develop a model, but WHAT to model for, including the tradeoffs of each option.\r\n\r\nAt the end of this session, you’ll leave understanding the best practices for developing a document data model and be confident in your ability to continuously improve it as your application evolves!\r\n"
  },
  {
    "Title": "A Tale of Three Triggers",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "a-tale-of-three-triggers",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Lander Verhack",
    "Description": "When you want to trigger an Azure function based on file creation, you use a BlobTrigger right?\r\nWell, it’s not that easy. This session is about a seemingly simple problem that hits many bumps along the way.\r\nMoving from BlobTriggers to EventTriggers to QueueTriggers and experimenting with the different hosting plans has taught us many things beyond the text-book example. Join this session to learn from our struggle and save yourself the pain."
  },
  {
    "Title": "Emulating a Game Boy in .NET 6",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "emulating-a-game-boy-in-net-6",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Wesley Cabus",
    "Description": "In 1989, Nintendo released their first handheld console with cartridges, the Game Boy, which sold over 100 million of units. This device has been the inspiration for game developers around the world to start creating games, and even today, games are still being created for the Game Boy, although not officially on cartridges. \r\n\r\nEnter the world of emulation, where the Game Boy is now available as a .NET 6 project. Want to know more about how to emulate a CPU, graphical unit, hardware interrupts and more? Let\u0027s dive into C# code and dusty hardware manuals on this journey back to our favorite Italian plumber."
  },
  {
    "Title": "Secure mobile apps with the Microsoft Identity platform",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "secure-mobile-apps-with-the-microsoft-identity-platform",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Christos Matskas",
    "Description": "If you ever had to deal with identity within your solutions then this is the session for you. Join Christos to find out how to implement authentication and authorization for your mobile apps and services using the Microsoft Identity platform. Learn how to use our libraries to quickly connect to our platform and authenticate your users in a few, basic steps. Get ready for demos and examples the highlight how the Microsoft Identity Platform allows you to create scalable and secure applications."
  },
  {
    "Title": "Troubleshooting the MEM managed Windows 11 client  - Deep dive!",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "troubleshooting-the-mem-managed-windows-11-client-deep-dive",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Jörgen Nilsson, Ronni Pedersen",
    "Description": "Learn how to troubleshoot a MEM managed Windows 11 client. Configuration Profiles, Enrollment, Settings, App deployment. Everything you need to know!\r\nThis session covers real-word examples and notes from the fields where we dive deep into the nuts and bolts of these scenarios through the tools of troubleshooting."
  },
  {
    "Title": "Azure AD Authentication and Conditional Access Deep-dive",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "azure-ad-authentication-and-conditional-access-deepdive",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "John Craddock",
    "Description": "Proving a user\u0027s identity and ensuring that user\u0027s access is compliant with your organisation\u0027s required policies is key to securing M365, Azure AD, and Azure B2C environments. Whenever you access an application protected by Azure AD, the user will be authenticated and then allowed or denied access based on the evaluation of conditional access policies. How does the flow work? When are and how often are authentication and conditional access policies checked?\r\nCome to this session, and John Craddock will dig into the details of authentication and conditional access policies. He will also explain how Conditional Access Evaluation improves response time to changes in security. A session not to be missed; it will set you on the path to a more secure future.\r\n"
  },
  {
    "Title": "Workflow Engines: the glitter glue for microservice orchestration",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "workflow-engines-the-glitter-glue-for-microservice-orchestration",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Nele Lea Uhlemann",
    "Description": "Breaking down a monolith or managing transactions in a distributed system are common challenges today when we talk about IT-architecture. The popularity of “cloud native” means  requirements are changing. We need continuous delivery the ability to deploy new applications independently, and be able to find the right glue for a polyglot system.\r\n\r\nThe glue should not be too sticky, ensuring everything remains loosely coupled. Still, we want to be able to understand more complex Sagas in our system. Modern workflow engines provide a glue to orchestrate microservices in a loosely coupled way. Like adding glitter to glue the right workflow engine adds functionalities to define Saga rollbacks, error handling and retries and therefore helps to reduce boilerplate code.\r\nThe presentation will give insight on how to orchestrate microservices with Open Source technology.  Bring your own infrastructure or run it in the Cloud. The talk outlines the different infrastructure possibilities that exist with modern process automation. "
  },
  {
    "Title": "Has Your Puppy Joined The Dark Side?",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "has-your-puppy-joined-the-dark-side",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Michelle @ Microsoft",
    "Description": "Machine learning is permeating mobile and web app development. To create modern, interactive apps that can evolve over time, it\u0027s a good idea to learn how to build and use machine learning models. \r\n\r\nWhat better way to super-charge an App than to integrate some AI? I\u0027ll step you through how to build a web app, embed an ML model that is trained using the Custom Vision AI service to tell if the furry animals living in your house are Shihtzu or Ewoks. \r\n\r\nIn this talk I\u0027ll share my experience of building a progressive web app, integrating ML and adding in a bit of Continuous Integration/Continuous Delivery (CI/CD) to push updates to GitHub. By the end of the session you should be able to build your own app [Note: There will be gratuitous puppy and Ewok pictures throughout] "
  },
  {
    "Title": "So, what about JSON in my database?",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "so-what-about-json-in-my-database",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Thomas Hütter",
    "Description": "The JSON data format, also called hipster\u0027s XML, is all around, not only in Javascript environments. In this session we\u0027ll first see where it comes from, what it looks like and what it can be used for.\r\n\r\nNext we\u0027ll explore how SQL Server handles JSON. Despite not providing a dedicated data type for it, there are some sophisticated functions for storing and retrieving JSON data, thus bridging NoSQL and relational concepts.\r\n\r\nAfter that we\u0027re joined by the NoSQL/document store solutions. Microsoft\u0027s own Azure Cosmos DB, as well as the \u0022original\u0022 called MongoDB enter the comparison with SQL Server in terms of features and limitations, pros and cons. Eventually we\u0027ll know when to prefer which solution."
  },
  {
    "Title": "Software development antipatterns",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "software-development-antipatterns",
    "Day": "Tuesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "24 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Mustafa Toroman",
    "Description": "In software development, we like to recognize good choices and identify them as patterns. This leads into implementing these patterns as best practices. But as we have good choices, we have bad choices as well. We identify them as antipatterns in order to avoid them in future projects. If you identify them in time, you can avoid them on your next project. Come and check what warning signs you need to look for!"
  },
  {
    "Title": "Uno Platfrom: Your apps everywhere",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "uno-platfrom-your-apps-everywhere",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Martin Zikmund",
    "Description": "Developing cross-platform applications is complex. Some frameworks allow us to share the business logic layer. Some go further and allow us to share the UI layer, usually limited to the lowest common denominator. But even then – working with device hardware still requires not only error-prone platform-specific code but also developers familiar with each of the target platforms to maintain it. What if there was a framework, which would allow you to write all your code in C#/XAML, with full styling and templating capabilities, with a single API to access device hardware? Meet the Uno Platform - your C#/XAML apps on Windows, Android, iOS, macOS, Linux, and WebAssembly!"
  },
  {
    "Title": "The future of Computing with Spatial Computing and Quantum Computing",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "the-future-of-computing-with-spatial-computing-and-quantum-computing",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "René Schulte",
    "Description": "The next wave of digital disruption is Spatial Computing, an emerging technology that will change how we interact with computers and the physical world, using intelligent edge devices like a HoloLens and other mobile devices. Mainly driven by AI computer vision and advanced sensors, those devices can spatially sense the world around us and make the spatially aware context part of the experience. With technologies like the AR Cloud, a common spatial map can be shared between heterogeneous devices to build connected, collaborative, and cross-platform Metaverse apps where virtual objects anchored in the physical world can be shared across devices and over time with persistence. \r\nDuring the Spatial Computing era we will also enter the Quantum Computing age. Quantum Computers are still in its infancy with limited Qubits, but Q-Day is coming, the day when Quantum Advantage will be readily available and deprecating today’s cryptography. Even with the hardware infancy, Quantum-inspired computing (QIC) already provides significant advantages for things like Quantum Machine Learning (QML) and Quantum-Inspired Optimization (QIO).\r\nIn this session Rene will explain the concepts and technologies supporting these transformative computing paradigm changes and will show applied and practical use cases to make these abstracts concepts more feasible."
  },
  {
    "Title": "Performance with Span\u003C T \u003E for dummies (should I care?)",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "performance-with-span-t-for-dummies-should-i-care",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Jiří Činčura",
    "Description": "Span\u003C T \u003E, although not exactly brand new, is still new kind on the block. In this session I\u0027ll show you what the Span\u003C T \u003E (and Memory\u003C T \u003E) is, how it works and the concepts behind. All explained using plain simple C# constructs."
  },
  {
    "Title": "Azure Synapse Analytics Serverless",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "azure-synapse-analytics-serverless",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Nico Jacobs",
    "Description": "Azure Synapse Analytics Serverless (ASAS) databases do not contain data, only external tables which point to files holding the data. Yet they are able to solve many of your big data challenges, while you only pay for what your query.\r\nIn this demo-heavy session you will learn how to explore large volumes of data, create a logical data warehouse and see how ASAS can be used for data transformation."
  },
  {
    "Title": "Message processing failed! But what\u0027s the root cause?",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "message-processing-failed-but-whats-the-root-cause",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Laila Bougria",
    "Description": "Teams that are new to building and maintaining distributed systems with messaging are faced with challenges when it comes to investigating failure scenarios. With messages flowing through the system, it\u0027s hard to quickly identify where a failure originates from and why it\u0027s occurring. Without a call stack to guide you, we need other techniques to keep a good overview.\r\nIn this session, we\u0027ll navigate how modeling techniques, integration testing, and instrumentation with OpenTelemetry can help you create visibility for your entire distributed system."
  },
  {
    "Title": "When Open Source Came to Microsoft",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "when-open-source-came-to-microsoft",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Richard Campbell",
    "Description": "Today Microsoft seems to have open source running through its veins - but it wasn\u0027t always that way! So what changed? Join Richard Campbell as he takes you on a ride through the various moments in Microsoft history that led to its current focus on open source. The path to open source was not a straight line, but the twists and turns are what makes the story great!"
  },
  {
    "Title": "Does spam have an opinion? Using machine learning to understand your spam.",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "does-spam-have-an-opinion-using-machine-learning-to-understand-your-spam",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Lars Klint",
    "Description": "What if we could interpret the sentiment and opinion of spam messages, and then respond? What if we could turn spam against itself? In this talk Lars will do just that using the power of cloud computing, machine learning and very very cute llama photos. Most likely without angering the spam gods."
  },
  {
    "Title": "Secure Web Applications: ASP.NET Core and the OWASP Top Ten 2021",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "secure-web-applications-aspnet-core-and-the-owasp-top-ten-2021",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Christian Wenz",
    "Description": "Since 2003, the Open Web Application Security Project curates a list of the top ten security risks for web applications. After several delays, the 2021 list was finally released in late September.\r\nTime to take a look from an ASP.NET Core perspective: what\u0027s new, what has changed, and to get an up-to-date refresh on how to create secure web applications and prevent the top ten issues from happening. We will also discuss whether the list is still relevant, and what is missing from that list. Many code samples will demonstrate those risks, and countermeasures, to keep your applications secure. "
  },
  {
    "Title": "Microsoft Teams Rooms best practices \u0026 notes from the field",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "microsoft-teams-rooms-best-practices-notes-from-the-field",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Johan Delimon",
    "Description": "Learn how to enable any meeting space as a Teams Meeting space. Teams Meeting Rooms enable the hybrid workspace and bring modern, secure and inclusive meetings to everyone. Find out how you can easily deploy, configure and manage Microsoft Teams Room with best practices and notes from the field."
  },
  {
    "Title": "Power BI Premium - Practical Tips for making the most of it",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "power-bi-premium-practical-tips-for-making-the-most-of-it",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Benni De Jagere",
    "Description": "Your company is thinking about investing into Power BI Premium, or has it already taking the plunge? Quite common, I\u0027ve encountered belief that all (Power BI related) worries will magically disappear. Out in the wild, the reality is often different. Power BI Dedicated Capacity requires some attention, but doing so will result in the ability to do great things!\r\n\r\nDuring this talk, I\u0027ll touch base on some of the key activities your organisation needs to perform, to make sure your investment is one that pays off. \r\n\r\nUsing the Premium Capacity Metrics App as our base of operation, we\u0027ll expand into auditing, licensing, and some common dataset performance patterns, to make sure you\u0027re up to the task!"
  },
  {
    "Title": "Building a 2000\u002B screen Core Banking solution with .NET Core and .NET Maui",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "building-a-2000-screen-core-banking-solution-with-net-core-and-net-maui",
    "Day": "Tuesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "24 May 2022 | 15:00 - 16:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Marc Ghys",
    "Description": "At Bank Van Breda, we are building a 2000\u002B screen Core Banking solution using .NET Core and .NET Maui. In this session we will dive into the technical details of this project."
  },
  {
    "Title": "3 Effective habits to become a 10x developer",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "3-effective-habits-to-become-a-10x-developer",
    "Day": "Tuesday",
    "TimeSlot": "16:05 - 16:25",
    "Date": "24 May 2022 | 16:05 - 16:25",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Kim Van Renterghem",
    "Description": "How to become a better developer, some short habits."
  },
  {
    "Title": "Adopting A DevOps Process for Your Database",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "adopting-a-devops-process-for-your-database",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Steve Jones",
    "Description": "DevOps is changing today’s software development world by helping us build better software, faster. However most of the knowledge and experience with DevOps is based around application software and ignores the database. We will examine how the concepts and principles of DevOps can be applied to database development by looking at both automated comparison analysis as well as migration script management. Automated building, testing, and deployment of database changes will be shown."
  },
  {
    "Title": "Payment Gateways for ASP.NET Core",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "payment-gateways-for-aspnet-core",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Ruby Jane Cabagnot",
    "Description": "Need to sell products or services online using your personal or commercial application? This course teaches how to implement payment gateways in ASP.NET Core apps using two popular payment services: Stripe and Braintree.\r\n\r\nUsing real-world examples, I will explain what payment gateways are and why you\u0027d want to use one versus creating your own payments system. Then we will delve into how to use the Braintree payment gateway to process credit card and PayPal transactions and leverage Stripe to offer subscription-based payments to users. Plus, I will explain how to create a custom Stripe admin dashboard to manage your account quickly."
  },
  {
    "Title": ".NET MAUI Blazor - Build Hybrid Mobile, Desktop, and Web apps",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "net-maui-blazor-build-hybrid-mobile-desktop-and-web-apps",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Gerald Versluis",
    "Description": "Blazor enables building client-side web UI with .NET, but sometimes you need more than what the web platform offers. Sometimes you need full access to the native capabilities of the device. \r\n\r\nYou can now host Blazor components in .NET MAUI apps to build cross-platform native apps using web UI. The components run natively in the .NET process and render web UI to an embedded web view control using a local interop channel.\r\n\r\nThis hybrid approach gives you the best of native and the web. Your components can access native functionality through the .NET platform, and they render standard web UI. .NET MAUI Blazor apps can run anywhere .NET MAUI can (Windows, Mac, iOS, and Android)."
  },
  {
    "Title": "Living in a Bug-Free World with Open-Source",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "living-in-a-bugfree-world-with-opensource",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Claire Novotny",
    "Description": "You don\u0027t have to be a Rockstar Developer™ to be a catalyst for change. Open-Source Developers are people like you and me, just ordinary people. Some are paid by companies to maintain projects; others do passion projects in their spare time. Even if you use open-source in your day job, you can still give back to the community where you are able. This improves the ecosystem during your regular course of work for the mutual benefit of the community. When you fix open-source issues, you’re removing a bug from the world for everyone, and others will do the same for you. This can be applied to internal teams being open-source within your company; even if your company doesn\u0027t permit external contributions, consider how an open-source mindset can help improve cross-team collaboration and velocity. Fix issues faster by submitting a patch instead of creating a ticket. You don’t have to look far to find an open-source project…I know you’re using at least one open-source tool because .NET is open source! Find out how adopting an open-source mindset helps us get closer to creating a bug-free world. "
  },
  {
    "Title": "Security Patterns for Microservice Architectures",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "security-patterns-for-microservice-architectures",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Kevin Dockx",
    "Description": "Microservice architectures come with a specific set of security challenges.  Multiple patterns for securing them have emerged, from an easy but not-so-secure (yet widely used...) approach to a best-of-class but quite complex approach.  \r\n\r\nIn this session we\u0027ll look into these different patterns \u0026 challenges, and we\u0027ll learn how to implement them in ASP.NET Core for both synchronous and asynchronous communication.\r\n\r\nNote that some previous knowledge of OAuth2 and OpenID Connect is highly advised to be able to follow along with this session."
  },
  {
    "Title": "Unified Governance for Power Automate, Power Apps and Power BI  ",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "unified-governance-for-power-automate-power-apps-and-power-bi",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Serge Luca, Isabelle Van Campenhoudt",
    "Description": "In this session, Isabelle Van Campenhoudt (Data Platform MVP) and Doctor Flow (aka Serge Luca- Business Application MVP) will illustrate their proposal for a unified pragmatic Power Platform governance and adoption plan combining Power Apps, Power Automate, and Power BI. \r\n\r\nEven though Power BI and the Power Platform apps creation tools are different, the governance and adoption challenges remain the same.  \r\n\r\nConceptually, when it comes to self-service BI and citizen developers, the classical centralized governance approach does not fit the needs of flexibility required by the business. \r\n\r\nThe presenters will detail the benefit of having a single polymorphic approach where the concrete associated actions can be product-specific.  \r\n\r\nMany elements of this governance have been experimented on the field by Isabelle during the last 5 years for Power BI and during the last 4 years for Power Automate and Power Apps by Doctor Flow. \r\n\r\nMany use cases will illustrate this session to be aligned with real-world requirements. "
  },
  {
    "Title": "Supercharge your Power Apps for better performance",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "supercharge-your-power-apps-for-better-performance",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Luise Freese",
    "Description": "Improving performance of your canvas apps will have a huge effect on good user experience and adoption rate of your apps. Understand in this session how choosing a data source can either create or resolve a bottle neck and how to approach this. Also learn some good practices on how to deal with large datasets, delegation and how to optimize the start of your app.  "
  },
  {
    "Title": "Performance tricks I learned from contributing to the Azure .NET SDK",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "performance-tricks-i-learned-from-contributing-to-the-azure-net-sdk",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Daniel Marbach",
    "Description": "As a practical learner, I\u0027ve found performance optimizations are my biggest challenge and where I\u0027ve learned the most helpful tricks, mostly by trial and error. It turns out the Azure .NET SDK is a perfect “playground” for learning those tricks—it\u0027s maintained by people who care and give feedback. \r\n\r\nOver the past few years, I\u0027ve contributed over fifty pull requests to the Azure .NET SDK. In this session, I\u0027ll walk you through the performance improvements I made, and help you develop your own “superpowers”—spotting and avoiding closure allocations, finding opportunities for memory pooling, and more."
  },
  {
    "Title": "The Ethical Dilemma of AI: Save Humanity or Destroy It?",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "the-ethical-dilemma-of-ai-save-humanity-or-destroy-it",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Tim Huckaby",
    "Description": "Artificial Intelligence (AI) has the processing capabilities of speed, scale, and capacity far beyond that of humans.  As computers become more powerful, Machine learning (ML) the “brains” behind AI become exponentially more powerful.  But…\r\n\r\nCan that power always be trusted to be fair and neutral? \r\nCan that power be trusted to protect your privacy within civic, state and federal laws worldwide?\r\nCan the government hysteria of removing facial recognition technology from authorities like the police make me less safe against terrorism?\r\nWhen Facebook or Google’s Photos service uses AI on my personal photos to identify people, locations, objects and scenes and consequently targets internet advertising at me based on that AI is it an invasion of my privacy?\r\nAI has already proven for years that it is saving lives.  Not that it has to potential to save lives; it is already saving lives and has been for years.  From cancer research to medical diagnosis to safety and security to covid-19 detection and everything in between; AI is saving lives. \r\n\r\nYet we have technology industry pillars like Google, Amazon, and Facebook, leaders AI, who’s revenue, and consequently shareholder value is rooted in internet advertising.  Companies who are using AI to track your activities on the internet to detailed granularity which produces influenceable advertising that is simply scary.  And these companies have basically been doing this unimpeded for years.  And then there is Microsoft, arguably the leader in AI in terms of sheer R\u0026D, with revenue and shareholder value mainly based in cloud consumption who is pushing federal governments worldwide hard for AI regulation.\r\n\r\nIt is years beyond the right time to talk about the nearly boundless landscape of artificial intelligence. In many ways, AI is just as much a new frontier for ethics and risk assessment as it is for emerging technology.  Join Tim Huckaby in the discussion; a demo heavy keynote which will elaborate the power, the risk, the ethical dilemmas we are currently facing in AI and that we will face for many years to come.\r\n\r\n "
  },
  {
    "Title": "OpenAI and Artificial General Intelligence (AGI)",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "openai-and-artificial-general-intelligence-agi",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Ben Selleslagh",
    "Description": "OpenAI is a research organisation aimed at developing state-of-the-art deep learning models. The company was founded by Elon Musk, Sam Altman and others.\r\n\r\nDuring this session, we will elaborate on some of the Artificial General Intelligence (AGI) models created by OpenAI and how to implement them into your applications using publicly available APIs.\r\n\r\nWe will demo the use of these models and process live requests to see how the AI responds.\r\n\r\n💡 In-depth knowledge of machine learning is not required for this session, as we will only demo the model and integrate it into a simple application using Python and JSON over REST API services.\r\n\r\n"
  },
  {
    "Title": ".NET MAUI Deep Dive",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "net-maui-deep-dive",
    "Day": "Tuesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "24 May 2022 | 16:30 - 17:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "James Clancey",
    "Description": "Let\u0027s explore .NET MAUI\u0027s new architecture. "
  },
  {
    "Title": "Database Development with SQL Server Data Tools",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "database-development-with-sql-server-data-tools",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Leonard Lobel",
    "Description": "SQL Server Data Tools (SSDT) is a powerful integrated development environment for designing, testing, and deploying SQL Server databases — whether you’re working locally or remotely, connected or offline, or in the cloud on Microsoft Azure — all from right in-side of Visual Studio. While SQL Server Management Studio (SSMS) continues to serve as the primary tool for database administrators, SSDT plugs in to Visual Studio as a special database project type designed specifically for the application developer.\r\n\r\nIn this session, Lenni describes the various difficulties that developers face, and demonstrates how SSDT can be used to remedy those pain points. You will learn how to use features such as code navigation, IntelliSense, and refactoring with your database model — indispensable tools traditionally available only for application development in Visual Studio. We’ll also cover the declarative model that allows you to design databases offline and under source control right from within solution in Visual Studio, as well as how to deploy to SQL Database on Microsoft Azure. Don’t miss out on this demo-centric information-packed session on the current generation of database tools for application developers!"
  },
  {
    "Title": "Diversity for Better Software: Pragmatic Reasons to Have Diverse Teams",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "diversity-for-better-software-pragmatic-reasons-to-have-diverse-teams",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Shawn Wildermuth",
    "Description": "In my past three years, I’ve been investigating and interviewing a series of developers about the problems of diversity in software. Both women and people of color still represent a smaller share of developers than they should. In this keynote, Shawn will talk about pragmatic reasons to diversity and add inclusion to make software better, not just for the social justice reasons."
  },
  {
    "Title": "Ocean’s Fish Tank: Building Secure IoT solutions on Microsoft Azure",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "oceans-fish-tank-building-secure-iot-solutions-on-microsoft-azure",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Glenn Colpaert",
    "Description": "In 2018, hackers successfully targeted a Las Vegas casino’s high-roller database via the internet connected thermometer in the lobby’s fish tank. \r\n\r\nWhat does it take to avoid that your IoT solutions are being compromised? In this session Glenn will give you a deep dive into the different Azure offerings regarding the Internet of Things and how to make them secure from the ground up! \r\nLearn from the different IoT solutions Glenn has been involved in over the past years and understand what is needed to build an IoT solution that is robust, future-proof and secure."
  },
  {
    "Title": "C# Records Inside Out",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "c-records-inside-out",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Rainer Stropek",
    "Description": "Records have been one of the recent key enhancements in C#. In this session, we take a close look at the feature and take a look behind the scenes. What are records? How do record structs and record classes differ? In which use cases do records really shine? In this code-only talk, Rainer Stropek tells you all there is to know about records based on a series of fast-paced code samples."
  },
  {
    "Title": "Take your network security to the next level on Azure PaaS",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "take-your-network-security-to-the-next-level-on-azure-paas",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Erwin Staal",
    "Description": "Ever used SQL-server in Azure? If you did, you probably added your IP-address to the firewall whitelist to be able to access it from your dev machine. You checked the ‘allow azure services checkbox’ which allows a web app for example to access your database. I believe in the layered security model where we add different layers on top of each other to strengthen our security. By enabling that ‘allow...’ checkbox we just peeled off one important layer of security. All a hacker now needs to get your data is a service on Azure and a leaked password.\r\nOver the last year there were quite a few features released in Azure that help us prevent this. In this session, I will show you how you can add additional security layers using virtual networks, Azure Private Link, Service endpoints, VPN connections, and more. For all of these services, I will tell you how to get started and what limitations you can expect. You see me build a demo in which we completely lock-down a database and API and let a front-end application access that securely."
  },
  {
    "Title": "Preventing cyberattacks in real-time with Microsoft Defender for Cloud automations",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "preventing-cyberattacks-in-realtime-with-microsoft-defender-for-cloud-automations",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Tom Janetscheck",
    "Description": "It\u0027s obvious that protecting hybrid and multicloud environments from bad actors is mandatory. Part of that is using a solution that will create security alerts once malicious behavior is detected. But it\u0027s never enough to only raise an alert, you will always have to \u0022work\u0022 with it.\r\nMicrosoft Defender for Cloud, formerly known as Azure Security Center, offers several automation capabilities that help you protect and secure your cloud estate, gain visibility into alerts and security posture, and react to threats once they occur. In this session, Tom Janetscheck, Senior Program Manager in the Microsoft Defender for Cloud team, will guide you through the variety of automation options and share ideas for building your own artifacts based on Logic Apps, Workflow Automation, REST APIs, Continuous Export, and KQL."
  },
  {
    "Title": "C# Source Generators - let the machine do the programming",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "c-source-generators-let-the-machine-do-the-programming",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Jiří Činčura",
    "Description": "Source Generators are one of longest requested features in C# language. What is a source generator? What I can use it for? Also what I can\u0027t use it for? Answers to these and more in this session."
  },
  {
    "Title": "Security and compliance in Microsoft Teams",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "security-and-compliance-in-microsoft-teams",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Anders Olsson",
    "Description": "We can read about more and more incidents around information leakage  and most of them are caused by end user mistakes. \r\nIn this session you learn how to best ensure security with Microsoft Teams while everyone\u0027s working from home during the COVID-19 outbreak.\r\nInformation and team based classification can prevent unauthorized; access to information, file sharing and guest access. Different DLP solutions can be used to define what kind of data that is allowed to be stored in the cloud.\r\nThis and much more will be demonstrated in this session!"
  },
  {
    "Title": "The Bizarre Quantum World with Q# and Azure Quantum",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "the-bizarre-quantum-world-with-q-and-azure-quantum",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Filip w",
    "Description": "Without our ability to master quantum mechanics there would be no modern technology or chemistry, and the world would be a very different place. Yet, its strangeness is both inexplicable and inescapable. Richard Feynman once said, \u0022I think I can safely say that nobody understands quantum mechanics.\u0022 Things can be in many states at once (superposition), can instantaneously affect each other or we can even teleport their state (entanglement), can behave as both particles and waves (wave-particle duality) and probabilities appear to be built into the very fabric of reality. In this talk, we will learn how to take advantage of these bizarre concepts of quantum mechanics to build quantum programs in Q# and Azure Quantum using computation theory fundamentally different from what we know from regular computers."
  },
  {
    "Title": "What\u0027s new in C# 11",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "whats-new-in-c-11",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Bart De Smet",
    "Description": "As the shipping cadence of C# has changed over the last couple of years, it may have been challenging to keep up with the latest language features. No worries, this talk will get you right back on track with a quick recap of C# 10.0 features and a closer look at what\u0027s in store for C# 11.0, including list patterns, UTF-8 string support, params support using Span \u003C T \u003E, required members, parameter null checking, primary constructors, and more. We\u0027ll also have a quick peek at upcoming proposals for future versions of the language."
  },
  {
    "Title": "dotnet new maui (live remote session)",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "dotnet-new-maui-live-remote-session",
    "Day": "Tuesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "24 May 2022 | 17:45 - 18:45",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "James Montemagno",
    "Description": "Multi-platform client app development for all .NET developers is here! .NET 6 for the first time ever introduces \u0022in the box\u0022 support for building client applications that target Android, iOS, macOS, and Windows for a simple codebase. Building upon the legacy of Xamarin, .NET MAUI is architected around developer feedback and customer needs, and it\u0027s just the beginning. Come learn about what .NET MAUI does today, how you can get the most from it, and where it\u0027s going in .NET 7 and beyond. We will cover topics such as:\r\n\r\n* .NET MAUI controls, styling, and native platform integrations\r\n* Productive developer experience with hot reload and Visual Studio 2022 tools\r\n* CI/CD with Github Actions and Azure Pipelines on DevOps"
  },
  {
    "Title": "Data Modeling and Partitioning Patterns in Azure Cosmos DB",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "data-modeling-and-partitioning-patterns-in-azure-cosmos-db",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Leonard Lobel",
    "Description": "For many newcomers to Cosmos DB, the learning process starts with data modeling and partitioning. How should you structure your model? When should you combine multiple entity types in a single container? Should you de-normalize your entities? What’s the best partition key for your data?\r\n\r\nIn this session, we discuss the key strategies for modeling and partitioning data effectively in Cosmos DB. Using a real-world NoSQL example based on the AdventureWorks relational database, we explore key Cosmos DB concepts—request units (RUs), partitioning, and data modeling—and how their understanding guides the path to a data model that yields the best performance and scalability. Attend this session, and acquire the critical skills you’ll need to design the optimal database for Cosmos DB."
  },
  {
    "Title": "Introduction to Azure Data Factory",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "introduction-to-azure-data-factory",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Koen Verbeeck",
    "Description": "Azure Data Factory (ADF) is the tool in the Azure cloud for creating your data pipelines. It allows you to move and transform data from a multitude of sources to as many possible destinations. In this session, we will give an introduction to this product and demonstrate how you can build your first pipeline. \r\nThe following topics are covered:\r\n* creating a pipeline and scheduling it for execution\r\n* monitoring the results\r\n* migrating SSIS packages to ADF\r\n* what are mapping and wrangling data flows?\r\n\r\nYou don\u0027t need any special knowledge for this session, but an understanding of the Azure cloud and ETL tools are a plus."
  },
  {
    "Title": "Offensive Azure Security",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "offensive-azure-security",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Sergey Chubarov",
    "Description": "These days, working with a cloud platform is already commonplace. Companies choose Microsoft Azure for a number of benefits, including security. But there are some responsibilities on the customer side and that\u0027s may become weakest link in the chain.\r\n\r\nA demo-based session shows attacks on the weakest link in 3 scenarios: Hybrid Active Directory, Legacy VM-based application and Modern Application.\r\n\r\nThe session includes:\r\n- Pentesting Azure AD Connect\r\n- Bypassing authentication \u0026 MFA\r\n- Getting control over Compute\r\n- Extracting secrets from Key Vault\r\n- Getting Access to App Service and Azure SQL Database\r\n- Exploring Azure Web App Firewall"
  },
  {
    "Title": "Building modern applications with GraphQL 2021 and beyond in ASP.NET Core 6",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "building-modern-applications-with-graphql-2021-and-beyond-in-aspnet-core-6",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Michael Staib",
    "Description": "GraphQL was created to cater to the mobile-first, cloud-first generation of backends. GraphQL, since its inception, has reinvented itself quite a bit with new capabilities like subscription back in the 2018 spec release. With the new spec release, GraphQL strengthens its type system with more capable interfaces and allows for pipelining features through repeatable directives. Moreover, we are finally getting support for @stream and @defer in modern GraphQL Servers that take full advantage of async iterators. \r\n\r\nThis talk will explore how to take advantage of these new capabilities and how to build a next-generation mobile-first, cloud-first GraphQL backend with the revamped ASP.NET Core 6 web stack."
  },
  {
    "Title": "How to build scalable, deployable and enterprise-grade solutions for Teams",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "how-to-build-scalable-deployable-and-enterprisegrade-solutions-for-teams",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Luise Freese, Carmen Ysewijn",
    "Description": "Carmen and Luise will walk you through key concepts of developing solutions for Microsoft Teams, covering the why’s and how’s.  Learn about creating a UI that looks and feels like Teams, designing a reliable data model and ensuring security. Discover how to make solutions enterprise-grade by providing proper documentation and making them deployable at scale.  \r\n\r\nAs an outcome, your solutions will be more sustainable, you will mitigate the risk of technical debt and increase your developer productivity.  \r\n\r\nConcepts apply to every Teams solution, regardless of the toolset it’s built with, session is suitable for both maker and developer audiences.  "
  },
  {
    "Title": "Building beautiful Blazor apps with Tailwind CSS",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "building-beautiful-blazor-apps-with-tailwind-css",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Chris Sainty",
    "Description": "Tailwind CSS has been growing in popularity for some time. It’s fast becoming one of the top frameworks to use when styling applications. It offers a different approach to the traditional frameworks like Bootstrap—utility based styling. Rather than using prebuilt components—which result in your application looking like a lot of others on the web—you can tailor your design by applying small focused CSS classes resulting in a unique style for your app.\r\n\r\nIn this talk, you will learn how to bring the power of Tailwind CSS to your Blazor applications. We’ll start off with an introduction to Tailwind and how it differs from other CSS frameworks. Then we’ll get into some code and see how we can integrate Tailwind with Blazor. For the rest of the time, we’ll explore the various features of Tailwind and see how just how beautiful we can make our Blazor app!"
  },
  {
    "Title": "Right {thing, focus, place}: Cloud-native microservices - with Dapr",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "right-thing-focus-place-cloudnative-microservices-with-dapr",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Christian Weyer",
    "Description": "Microservices-all-the-things. Yeah, we heard you. Today, let\u0027s talk about pragmatic ways of implementing service-based architectures, satisfying modern cloud-native approaches. Doing the right thing. With exemplary use of the open-source Dapr runtime and framework, Christian shows how to concentrate your time and brainpower on writing features \u0026 business logic, not infrastructure. Keeping the right focus. Last, but not least, he discusses how to run your [micro]services on a spectrum of execution environments, from self-hosted on-premises to the public cloud. Picking the right place."
  },
  {
    "Title": "Turning Dreaming into Doing - A Life Manual for Nerds",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "turning-dreaming-into-doing-a-life-manual-for-nerds",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Lars Klint",
    "Description": "What separates success from mediocrity? How do you turn that brilliant idea into reality? Why is everyone else so successful?\r\n\r\nQuestions of how to shape your life are never simple to answer and they always present more problems once you try. In this talk Lars provides simple, yet hard answers to many of the questions we want answered to succeed in life. Based on decades of soul searching, failures, wrong decisions and a mountain of hard work, Lars shares all the nuggets of what works and what doesn’t. "
  },
  {
    "Title": "Deploy Azure Container Apps with Pulumi",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "deploy-azure-container-apps-with-pulumi",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Andrea Ceroni",
    "Description": "After a briefly introduction to the new powerful Azure Container Apps, a fully managed platform for microservice applications that runs on top of K8s, lets see how to completely deploy it using Pulumi, starting from the app containerization up to the azure resources needed."
  },
  {
    "Title": "Managing the unmanaged with Security Management for Defender for Endpoint",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "managing-the-unmanaged-with-security-management-for-defender-for-endpoint",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Ronny de Jong, Pim Jacobs",
    "Description": "The security threat landscape is confusing and changing rapidly – there’s so much out there, how do you keep up to understand where the true risks are and keep your assets safe from bad actors? It all starts with insights and managing your endpoints. But what if they are not? Security Management sets the benchmark for unified protection regardless of how your endpoints are managed or aren’t managed at all. No matter how fragmented or complex the landscape of your endpoints looks, with Security Management you can manage and configure them without dependence of GPOs, SCCM or 3rd party management. After this session you have a clear understanding of the various management scenarios, seen demo’s how the solution works and you’re able to define a strategy to kickstart your deployment to apply Security Management in your organization. Make the unknown known!"
  },
  {
    "Title": "What\u0027s New in Azure",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "whats-new-in-azure",
    "Day": "Wednesday",
    "TimeSlot": "08:45 - 09:45",
    "Date": "25 May 2022 | 08:45 - 09:45",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Derek Martin",
    "Description": "Azure reinvents itself every 6 months. Come discover all of the amazing new features with Azure, how you can leverage them within your organization and learn of what\u0027s to come in the coming months!"
  },
  {
    "Title": "Zero Credential Development with Managed Identities for Azure Resources",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "zero-credential-development-with-managed-identities-for-azure-resources",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Joonas Westlin",
    "Description": "Keys are always needed to access services in Azure and beyond. Storing and managing keys presents many problems, for example rotating and disabling them. Keys often also allow blanket access to the service with no way to limit it. Sometimes there is only one key that needs to be shared by services, so you won\u0027t have any way to disable access from one individually.\r\n\r\nIn this talk we will go through Managed Identities for Azure Resources, how they work, and how you can use them to use Azure services in a secure way without having to manage any keys yourself. We will go through a demo application which uses various Azure services through a managed identity, removing the need to use keys entirely.\r\n\r\nThe source code will be available to the audience so they have samples that they can use to implement managed identities in their own applications."
  },
  {
    "Title": "Protect your data from tampering with SQL Ledger",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "protect-your-data-from-tampering-with-sql-ledger",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Pieter Vanhove",
    "Description": "Establishing trust around the integrity of data stored in database systems has been a longstanding problem for all organizations that manage financial, medical, or other sensitive data.  SQL Ledger is a new feature in Azure SQL and SQL Server that incorporates blockchain crypto technologies into the RDBMS to ensure the data stored in a database is tamper evident. SQL Ledger introduces ledger tables that make data tampering easy to detect.\r\n\r\nIn this session, we will cover \r\n•\tThe basic concepts of Ledger and how it works\r\n•\tLedger Tables\r\n•\tDigest management and database verification\r\n\r\nAfter completing this session, you will understand how SQL Ledger works and how it can help to protect sensitive data.\r\n"
  },
  {
    "Title": "Real-Time Apps with SignalR",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "realtime-apps-with-signalr",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Sam Basu",
    "Description": "SignalR is cool piece of tech that powers real-time communications and is one the latest additions to the ASP.NET Core family. Yes, SignalR is open source and enables two-way client-server RPC calls – across .NET and JavaScript. This means seamless real-time communications across web, desktop and mobile platforms.\r\n\r\nLet’s go under the covers to see how real-time communication works. With rich server-side Hubs, SignalR allows for granular communication and management of .NET, JS \u0026 other clients. SignalR easily powers common scenarios of web server backends and cross-platform mobile/desktop/web front ends. And modern SignalR has well thought out features – like streaming, configuration, MessagePack support and security considerations. Need scalable hosting or serverless real-time apps - Azure SignalR Service is here to help. Let’s explore SignalR and deep dive into what’s possible with real-time communications!\r\n"
  },
  {
    "Title": "From 0 to 60 with Azure Kubernetes Service",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "from-0-to-60-with-azure-kubernetes-service",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Jakob Ehn",
    "Description": "Join me for a hands-on, demo only, whirlwind tour of Azure Kubernetes Service!\r\n\r\nWe\u0027ll start with an existing application running locally, and by the end of the session the application will run in Azure Kubernetes Service. But not just that, on they way there we will:\r\n\r\n* Setup a CI/CD pipeline for automated deployments\r\n* Expose the application securely using Lets Encrypt certs\r\n* Configure autoscaling in AKS to handle high load\r\n* Extend to serverless using Azure Container Instances \r\n"
  },
  {
    "Title": "Intelligent Automation in your Supply Chain",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "intelligent-automation-in-your-supply-chain",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Robin Mata",
    "Description": "Intelligent Automation (IA) has changed the game! It is now playing a key role in enabling Supply Chains around the world to place the right product at the right time at the right shelf so it is available to the right consumer who is in great need of it.\r\nCome and learn practical examples on how IA is adding value and a framework to prioritize the right automation initiatives to enable you to reach your strategic supply chain goals."
  },
  {
    "Title": "Becoming API \u0026 Cloud-First at the LEGO Group",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "becoming-api-cloudfirst-at-the-lego-group",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Rasmus Hald",
    "Description": "At the LEGO Group we are investing in business agility through technology by moving to API \u0026 Cloud-First as the foundation for all our digital products. \r\n\r\nJoin us for a unique peek inside the workings of the LEGO Group and get the story of how the technology transformation is accelerating innovation of this iconic 90 years old company.\r\n\r\nThis session features strategy, architecture and most of all, insights on how to execute a cloud and API journey and will look to inspire you on how to help your organization gain business agility through technology\r\n"
  },
  {
    "Title": "Flutter vs. MAUI - what should you pick and why?",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "flutter-vs-maui-what-should-you-pick-and-why",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Tobias Hoppenthaler",
    "Description": "There are many contenders in the mobile and cross-platform realm. Flutter by google and .net MAUI by Microsoft are probably one of the stronger candidates. Both deliver a broad range of features, but they do differ quite a bit in how they work and what bases they cover. Come to see an unbiased overview of where they shine and where there still are dragons."
  },
  {
    "Title": "Being a Lead Software Developer",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "being-a-lead-software-developer",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Jeroen Leenarts",
    "Description": "You worked hard. Solving problems and coding smart solutions is your thing. And then there is a day when the bomb is dropped. \u0022Would you like to be promoted to the team\u0027s lead developer?\u0022\r\n\r\nThis was my reality a few years ago. I did not know much about being a lead developer.  I  worked with many great ones over the years. But now I had to become one.\r\n\r\nI had to learn new skills, consider factors outside of my comfort zone. But… I had to learn.\r\n\r\nOn a number of topical areas I will go into details about the lessons I learned when growing into my role as a lead software developer. Everybody\u0027s environment is different, but I think there is something useful in this presentation for everyone.\r\n"
  },
  {
    "Title": "How Microsoft 365 Priva helps to safeguard personal data and build a privacy-resilient workplace ",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "how-microsoft-365-priva-helps-to-safeguard-personal-data-and-build-a-privacyresilient-workplace",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Martina Grom",
    "Description": "Sooner or later, most of the world’s population will have its personal data covered under modern privacy regulations. Join Martina when she shows how Microsoft 365 privacy management can support you within your organization to identify this data and evaluate the risks in an automated way.\r\nIdentify and discover privacy risks and conflicts, automate privacy operations and data subject requests and support employees to raise awareness about privacy management. \r\nNote: this is a pre-recorded session"
  },
  {
    "Title": "The Future is Fusion",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "the-future-is-fusion",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Sven Noomen",
    "Description": "Low code is hot. All big analysts see this as one of the biggest trends for the coming years. Low code will change the landscape for IT\u0027ers for ever. In this session Sven will cover how Low Code in general en Microsoft\u0027s Power Platform especially will work together with traditional development (e.g. .Net / Python etc.) tools to establish the best results.\r\n\r\nFuthermore Fusion will also change the traditional roles and members of an IT project. Be prepared for the future and join this session"
  },
  {
    "Title": "No, I don\u0027t need servers in AWS!",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "no-i-dont-need-servers-in-aws",
    "Day": "Wednesday",
    "TimeSlot": "10:00 - 11:00",
    "Date": "25 May 2022 | 10:00 - 11:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Rob Van Pamel",
    "Description": "No, I do not need to manage any servers for .NET development in AWS. \r\n\r\nServerless is a hot topic, and for most .NET developers, that means they instinctively look at Microsoft Azure. But what if I told you that you can move to AWS as well if you want to throw away these virtual machines, SQL servers, ... ? But what does that mean for our architecture?\r\nIn this session I will show how to set up an application architecture, using C#, for serverless on AWS. I\u0027ll touch on topics like Serverless Compute, Storage, Databases and serverless Identity Management.\r\n \r\nAfter this session you will have an understanding on how to use AWS services as your new development \u0027framework\u0027. And although AWS will be used for demonstration, the same principles can be applied to Azure.\r\n "
  },
  {
    "Title": "Bluecrux session",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "bluecrux-session",
    "Day": "Wednesday",
    "TimeSlot": "11:05 - 11:25",
    "Date": "25 May 2022 | 11:05 - 11:25",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Philippe Thys",
    "Description": "We would like to immerse you in the world of Digital Supply Chain Twin technology and complex scheduling optimization puzzles. Fueled by algorithms and ML/AI technologies."
  },
  {
    "Title": "MOV, async/await, DSL, Lambda Calculus, DDD - are they connected?",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "mov-asyncawait-dsl-lambda-calculus-ddd-are-they-connected",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Adam Furmanek",
    "Description": "MOV is an assignment instruction in the assembly language. C# supports async and await pattern by rewriting method into a state machine. Domain specific languages give us languages tuned for some domain problems. Lambda Calculus shows how to calculate things using functions only. These things are completely different! Or are they?\r\n\r\nIn this talk we will go through abstraction and why it is important to extract common patterns into specific solutions. We will understand why we need multiple programming languages and cannot just have \u0022one language to suit everyone\u0022. We will see basics of async/await, Lambda Calculus and DSL. We will then discuss some ideas behind theory of computations to see why we don\u0027t need to have anything beside MOV. Finally, we will see why we build tools and abstractions to deliver customer value."
  },
  {
    "Title": "Embrace chaos to achieve stability",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "embrace-chaos-to-achieve-stability",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "René van Osnabrugge",
    "Description": "What do you do in case of a cyber attack? And a natural disaster? The absence of a person? Or, more concrete. What happens if the network is down, your data center is not available, your VM\u0027s cannot spin up, you get the DDOSed or your website becomes a success overnight? \r\n\r\nUsually we cater for a number of scenarios, but do we actually test them and can we actually find out what happens when doomsday shows up? \r\n\r\nChaos engineering is a practice that can help you to prepare for these scenario and be ready when you need to be. In this session I will talk you through the principles of chaos engineering and explain why this could benefits you and your company. \r\n\r\nWith some demos I can also show you some tools that can help you to overcome this crisis."
  },
  {
    "Title": "Developing and Deploying a Static Web App with Blazor and Azure Functions",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "developing-and-deploying-a-static-web-app-with-blazor-and-azure-functions",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Matthias Koch",
    "Description": "Blazor brings C# to the browser. Azure Functions lets your back-end scale. But how do you get started creating an Azure Static Web App using these two and how do you implement a rock-solid CI/CD pipeline for it?\r\n\r\nWe will walk through the whole process! Starting from writing and debugging your Blazor app and Functions API, we will also unit test our front and back-end and glue them together with the authentication service emulator for local development. For CI/CD and service management needs, like staging environments and user invitations, we will conclude with a scalable build pipeline that can be flexibly reused for your future projects!\r\n\r\nCome to this talk when you want to improve your development process with the best tooling and focus on the business value of your app!"
  },
  {
    "Title": "Predicting earthquake damages with Azure ML Workspace",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "predicting-earthquake-damages-with-azure-ml-workspace",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Eve Pardi",
    "Description": "In April, 2015 there was an earthquake with 7.8 magnitude, and an epicenter in the Ghorka District of Nepal. The disaster injured more than 30000 people, which was in most cases caused by the collapsed buildings in the earthquake.\r\n\r\nDuring the demo-oriented session you receive hands-on knowledge about Microsoft Azure Machine Learning Workspace. You will be able to use the same platform to examine your dataset, to build your own predictive model, to improve it for better results and to deploy the model.\r\n\r\nThe data we use for the demo can be used to mitigate which buildings might need strengthening, so not only many buildings, but also thousands of lives could be saved in case of another earthquake."
  },
  {
    "Title": "La Casa de P̶a̶p̶e̶l AVD: Protect your m̶o̶n̶e̶y users",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "la-casa-de-papel-avd-protect-your-money-users",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Micha Wets",
    "Description": "As seen before in previous sessions, creating a AVD environment is easy. But creating a solid Azure environment, with a secure \u0026 stable AVD workplace is a lot more work.\r\n\r\nFollow this session if you want to learn from el Profesor which actions you can take to protect your users against attacks like hackers, ransomware, data leaks \u0026 more, but also to protect yourself for an unstable environment"
  },
  {
    "Title": "Implementing Domain Driven Design with .NET 6",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "implementing-domain-driven-design-with-net-6",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Peter Himschoot",
    "Description": "Domain Driven Design applies a series of patterns to build better and maintainable software. But what features does .NET 6 give us to implement DDD? Come to this session to find out!"
  },
  {
    "Title": "Better architecture without architects",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "better-architecture-without-architects",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Geert van der Cruijsen",
    "Description": "As a developer, have you ever had to implement an architecture thought up by an architect not in your team? Have you worked in an environment where you needed to propose changes in a CAB? Do you have architects in your organization who don\u0027t code? If you answer yes to any of the questions this session is for you!\r\n\r\nIn this session Geert will talk about how DevOps organizations with autonomous teams work faster and build better architecture without the need of enterprise architects or complex processes before decisions are made. Come discuss the future of architecture with us in this session. Architects \u0026 Developers are welcome!"
  },
  {
    "Title": "The latest Teams development innovations",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "the-latest-teams-development-innovations",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Rick  Van Rousselt",
    "Description": "In this session, we will deep dive into all the new things available for Teams developers. Even if you are not into Teams development, this session will let you know all Microsoft Teams\u0027 latest and greatest options. We will see what updates Microsoft did to the Teams developer platform and take a peek at the multiple community initiatives because they are the treasure trove of good ideas to speed up our application development.\r\n"
  },
  {
    "Title": "Database Worst Practices - Secrets of SQL Server (pre-recorded session)",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "database-worst-practices-secrets-of-sql-server-prerecorded-session",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Pinal Dave",
    "Description": "Not everyone is perfect, and this session contains some of the big mistakes I have made in my early career. This demo-oriented session shows many examples where database professionals were dumbfounded by their own mistakes and could even bring back memories of your early DBA days. The goal of this session is to expose the small details that can be dangerous to the production environment and SQL Server as a whole and talk about worst practices and how to avoid them. This session focuses on some of the common errors and their resolution. The major topics we discussed during the sessions are: \r\n•\tPoor table joining strategies \r\n•\tOvercomplicated execution plans\r\n•\tDefective index maintenance \r\n•\tIncorrect configuration settings\r\nThis session is built to keep the recent SQL Server versions and online data platforms.\r\n"
  },
  {
    "Title": "Find and Seek: Leveraging visual \u0026 functional best practices for actionable Power BI reports",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "find-and-seek-leveraging-visual-functional-best-practices-for-actionable-power-bi-reports",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Kurt Buhler",
    "Description": "Three seconds. When a user arrives at a Power BI report, that’s how long you have to seize their attention with the most critical facts. As they mouse-over the report, they search for their most important categories and trends, then their details-on-demand… do they quickly find answers to their questions, or do they drown in the data of yet another report? The answer isn’t solely determined by elegant and performant visuals or deep AI and analytics; Power BI developers need to first know their users, then design a holistically effective, logical user experience. This experience, known as the Information-Seeking Mantra – or the 3/30/300 rule - leverages visual best practices to split the report into three parts: The information gained by the user in (A) three seconds, (B) thirty seconds and (C) three hundred seconds. In the deeper layers, interactivity in Power BI enables powerful, self-driven question-and-answer data exploration. Effectively combining both these visual and functional elements in a user-oriented way can lead to powerhouse reporting that can revolutionize a workplace. With these reports, Business users can test their ideas and questions to get reliable answers, and, more importantly, use them to drive actions to get the desired results.\r\n\r\nIn this talk, we will explain three principles we employ in an effort to design quality, usable Power BI reports that allow business users to quickly answer both basic and complex questions in an action-oriented way. We see these principles as valuable best practice guidelines for (1) co-creating reports with users, as well as (2) visual and (3) functional guidelines for design. For (1), we will illustrate our typical approach to user-oriented design using examples. For (2), we will illustrate key data visualization principles and demonstrate how they are typically executed when designing a report in Power BI using the default visualization types. For (3) we will demonstrate our experience with effectively leveraging powerful interactions in Power BI like drillthrough, graphical tooltips, page navigation, dynamic measure \u0026 dimension selection, and more. In addition, (2) – (3) will include short technical \u0027recipes\u0027 on how to these can be implemented by yourself. Finally, we will put it all together with an example that we hope highlights how the whole is greater than the sum of its parts. By the end of the talk, we hope you will understand this approach to design, and the value it can provide in designing useful Power BI reports. \r\n"
  },
  {
    "Title": "Tools in the dev toolbox to deliver quality",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "tools-in-the-dev-toolbox-to-deliver-quality",
    "Day": "Wednesday",
    "TimeSlot": "11:30 - 12:30",
    "Date": "25 May 2022 | 11:30 - 12:30",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Frederic Pape",
    "Description": "Software development is expensive, software has bugs, fixing bugs is expensive. Is there no way to turn things around?\r\nIn this session I\u0027ll share my experiences which tools really contribute to deliver quality in software development.\r\nSpoiler alert: VGhpcyBzZXNzaW9uIGlzIG5vdCBhYm91dCBsYW5ndWFnZXMgYW5kIGZyYW1ld29ya3Mh\r\n"
  },
  {
    "Title": "Mirror mirror on the wall, what is the fairest API of the all?",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "mirror-mirror-on-the-wall-what-is-the-fairest-api-of-the-all",
    "Day": "Wednesday",
    "TimeSlot": "12:30 - 12:50",
    "Date": "25 May 2022 | 12:30 - 12:50",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Ruben Mertens",
    "Description": "Reflection in C# is a vast and deep ocean. \r\nLet\u0027s explore what\u0027s out there by contrasting a simple library built using the different reflection technologies available today."
  },
  {
    "Title": "Building Intelligent Vessels that navigate the world\u0027s oceans",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "building-intelligent-vessels-that-navigate-the-worlds-oceans",
    "Day": "Wednesday",
    "TimeSlot": "13:00 - 13:20",
    "Date": "25 May 2022 | 13:00 - 13:20",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Frederik Gheysels",
    "Description": "Codit recently worked with the leading crude oil carrier Euronav, helping them to connect their vessels to the shore. During this discussion, Codit will cover how we collected and transformed telemetry for multiple vessels using IoT Edge. Join us for a fascinating deep-dive into how we manage secrets that are required in our IoT Edge solution, and how we operate the software running on the vessels using Azure Arc. Our use of Azure Connected Container Registry will also be covered, in the context of how to overcome connection issues when deploying software updates to the vessels. Join us there!   "
  },
  {
    "Title": "Azure SQL Database - A true story journey from migration, through synchronization and beyond.",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "azure-sql-database-a-true-story-journey-from-migration-through-synchronization-and-beyond",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Pieter Vanhove",
    "Description": "You will be challenged with a case study to design a solution using Azure SQL Database capabilities. \r\nAt the end of this session, you will better understand the possibilities to migrate on-premises databases to Azure SQL Database. You will learn how to synchronize data across different environments and get more insights on how to troubleshoot issues in Azure SQL Database.\r\nThis is a hands-on, open discussions and team work kind of session (not a traditional slideshow).\r\nAttendees should already have basic knowledge of Azure SQL Database. "
  },
  {
    "Title": "Data modeling 101: Understanding the basics of a good data model",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "data-modeling-101-understanding-the-basics-of-a-good-data-model",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Marc Lelijveld",
    "Description": "What is a good data model in Power BI? How do you make sure you have the basics in place so the model you build today, will still work next year? During this session we will lift of from basic level and build up in complexity to understand the key element of a good data model! Everything presented in this session will include real-life examples and can be directly brought to practice. \r\n\r\nAfter this session you will be able to: \r\n- Explain basic dimensional modeling concepts\r\n- Create a well working and performing data model in Power BI\r\n- Decide when to use Power Query vs the data model\r\n- Decide when to use Calculated columns or measures\r\n- Handle complex situations with inactive relationships and role-playing dimensions. "
  },
  {
    "Title": "Windows Hello for Business Hybrid Access: How Does It Work Under The Covers?",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "windows-hello-for-business-hybrid-access-how-does-it-work-under-the-covers",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Sander Berkouwer",
    "Description": "As weak, stolen and cracked passwords are at the root of 80% of cybersecurity incidents, Passwordless has the potential to change the world. Under the covers, Windows Hello for Business, Microsoft\u0027s Passwordless solution, has already changed the authentication paradigm for Active Directory. \r\n\r\nRegardless of the device being domain-joined, hybrid Azure AD-joined or Azure AD-joined, you can access organizational resources without specifying credentials. \r\n\r\nIn this session, Sander Berkouwer, 13-time Microsoft MVP, explains how Windows Hello works in all three scenarios and what you need to get it going for your organization."
  },
  {
    "Title": "Secure minimal APIs with .NET 6 and Microsoft Identity",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "secure-minimal-apis-with-net-6-and-microsoft-identity",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Christos Matskas",
    "Description": "Join Christos to learn how to build secure minimal APIs with .NET 6 and Microsoft Identity! Demos, demos and more demos to show you how to Implement strong authorization with only a few lines of code - this is the session for YOU"
  },
  {
    "Title": "Windows 11 - How to get there!",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "windows-11-how-to-get-there",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Jörgen Nilsson, Ronni Pedersen",
    "Description": "Windows 11 is here! So how do we get there? \r\nHow do I manage the new start Menu?\r\nWhat happens to my customizations when I upgrade?\r\nCreating and managing our different scenarios and user types and making sure Windows 11 fits their needs is always a challenge with a new Operating System.\r\nWe will cover upgrade scenarios, customizations basically everything an IT admin needs to known!\r\n"
  },
  {
    "Title": "Migration \u0026 Modernization with .NET MAUI",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "migration-modernization-with-net-maui",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Sam Basu",
    "Description": "Migration \u0026 Modernization with .NET MAUI\r\n\r\n.NET MAUI is the evolution of Xamarin.Forms and ushers in modern development stacks with polished tooling running on top of .NET 6. Developers get to build native cross-platform apps for mobile \u0026 desktop from single codebase. Inner loops get tighter, app architectures smarter and performance faster - .NET MAUI sounds like a total win.\r\n\r\nBut what if you have existing mobile apps with Xamarin? How much work would it be to migrate to .NET MAUI? Would the Upgrade Assistants help? Would you have to drop Custom Renderers in favor of the new MAUI Handlers? And there are lots of enterprise ‘legacy’ desktop apps out there written in WinForms or WPF. What role could .NET MAUI play with app modernization? Could Blazor be brought in to modernize and share code better with web apps? What if you had investments in frontend apps with JS SPA frameworks like Angular/React/Vue – do they come over to .NET MAUI? How do .NET \u0026 JS talk to each other? Could your .NET backend APIs be Minimal and more efficient?\r\n\r\nAll this \u0026 more as we take a real-world look at migration strategies and app modernization with .NET MAUI. Catch the right waves \u0026 you’ll surf into the future with MAUI."
  },
  {
    "Title": "gRPC \u0026 Blazor WebAssembly: A match made in heaven",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "grpc-blazor-webassembly-a-match-made-in-heaven",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Christian Weyer",
    "Description": "With Blazor WebAssembly, developers can write C# code for SPAs in the browser and share code with the server-side of their applications. Usually, you design and use JSON-based Web APIs to communicate between the client and the server logic. In this session, Christian Weyer demonstrates how to employ gRPC \u0026 gRPC-Web in a code-first manner to share .NET interface contracts in a strongly-typed way. With this approach, no code generation is needed, you get the same syntax and full IntelliSense on both sides. In fact, you gain the good parts we already had many years ago with WCF - now for the ubiquitous \u0026 open web. But: is really everything gold that glitters?"
  },
  {
    "Title": "You’re Not Just Tired: The Psychology of Burnout (pre-recorded session)",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "youre-not-just-tired-the-psychology-of-burnout-prerecorded-session",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Arthur Doler",
    "Description": "After the events of the last year, burnout has been on everyone’s minds. Are you feeling nostalgia for the days when your job wasn’t such a hassle? Do you find yourself struggling to care about your job… or anything at all? You may be wrestling with burnout.. But what exactly IS burnout? If you’re dealing with it, what do you do about it, or how do you talk to someone else about it?\r\n\r\nCome and get a glimpse beneath the surface of this phenomenon in this talk pulling from both personal experiences and psychological studies. You’ll learn the basics of burnout... and also what sorts of situations lead to it, how it can intertwine with other mental challenges including trauma, and why fixing it isn’t just as simple as taking time off work. Most importantly, you’ll learn things you can start doing tomorrow to bounce back from burnout, and how you can even help prevent it for yourself and others."
  },
  {
    "Title": "5 Things Every .NET Developer Should Know About GitHub Actions",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "5-things-every-net-developer-should-know-about-github-actions",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Jon Galloway",
    "Description": "I\u0027ll show you some tips and tricks with GitHub actions that have transformed my .NET developer experience recently. I\u0027ll start with a few that take literally seconds to set up, show you how we use GitHub actions on the .NET team, and work up to writing some custom GitHub actions in .NET code."
  },
  {
    "Title": "The Visible Developer: Why You Shouldn\u0027t Blend In",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "the-visible-developer-why-you-shouldnt-blend-in",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Heather Downing",
    "Description": "Ever wonder how some technical people are recognized and promoted quicker than others with the same skillset? Yes, there is a formula to make it more likely. We will explore the habits of well known developers outside of their coding chops, to identify what additionally allowed them to become a trusted and known voice in their environment. This approach can be a benefit to you, no matter how junior or senior you are."
  },
  {
    "Title": "Distributed tracing and logging with OpenTelemetry and Grafana",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "distributed-tracing-and-logging-with-opentelemetry-and-grafana",
    "Day": "Wednesday",
    "TimeSlot": "13:45 - 14:45",
    "Date": "25 May 2022 | 13:45 - 14:45",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Glenn Versweyveld",
    "Description": "In this talk you will learn the basics on how to start with distributed tracing and logging.\r\nWhat does it take to follow your customers website actions while they pass through your backend that consist of different technology stacks? We will focus on OpenTelemetry as middle man and use Grafana tooling to handle and visualise the logs and traces."
  },
  {
    "Title": "Building real-time processes and notifications on Microsoft 365 with webhooks",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "building-realtime-processes-and-notifications-on-microsoft-365-with-webhooks",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Giuliano De Luca",
    "Description": "Keep informed the end-user in real-time with new changes by displaying notifications. \r\nIn this session, we will explore how to leverage the capabilities of SharePoint and Graph API webhooks, in order to trigger your business processes.\r\nWe will see how to subscribe webhooks and automatically renew the subscription, we will see several scenarios using SharePoint Framework, Power Automate, and Azure Function with webhooks."
  },
  {
    "Title": "A Version Control Primer for Databases",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "a-version-control-primer-for-databases",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Steve Jones",
    "Description": "Why would a DBA or database developer need to learn Git? Version control systems (VCS) have typically not been a part of the database professional\u0027s daily work, but with DevOps software development, we need to work more closely with application developers.\r\n \r\nThis session give an overview of version control systems, the various types, and the most popular systems. We will focus on Git and how this can be used with SSMS, ADS, and from the command line to capture and share your code with others.\r\n"
  },
  {
    "Title": "Mixing Paradigms with the Latest C# Language Specification",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "mixing-paradigms-with-the-latest-c-language-specification",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "Zoran Horvat",
    "Description": "Mixing functional programming and metaprogramming into good-old object-oriented C# is not new. Still, so many programmers don\u0027t see it clearly yet: Those paradigms are not additions to an established programming model; they are genuine parts of a unified programming method, support for which is progressively being added to the C# programming language.\r\nIn this session, we will demonstrate use of latest functional additions to C# - records, tuples, deconstruction, nullable reference types, LINQ, extension methods, and a few others - which will be integrated with object-oriented and even procedural elements into a unified design which effectively solves a practical problem."
  },
  {
    "Title": "Bicep: Infrastructure as Code for Azure Reinvented",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "bicep-infrastructure-as-code-for-azure-reinvented",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Henry Been",
    "Description": "In a fast-moving software project, the demands that your application poses on its infrastructure might change often and drastically. Are you also fed up with having to apply infrastructure changes by hand? Not to worry! In Azure, there is the Azure Resource Manager, a unified API for managing all your Azure services in a declarative style, and a new more powerful templating language: Bicep!\r\n\r\nIn this session, Henry Been will give you a full tour of Bicep templates. Starting from scratch, we will explore how you can set up an architecture that is ready for deployment of your application code. We will touch upon syntax, manual deployment, and more advanced features as nesting templates, loops and conditions.\r\n"
  },
  {
    "Title": "Kubernetes goes Serverless with Azure Container Apps",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "kubernetes-goes-serverless-with-azure-container-apps",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Thorsten Hans",
    "Description": "Meet the latest addition to Microsoft’s serverless offering – Azure Container Apps (ACA). Leverage scaling, resilience, and self-healing capabilities offered by Kubernetes without having the burden to manage and master Kubernetes itself. That’s the mission statement from Microsoft when it comes to ACA. But how does the new serverless runtime for containerized architectures work? What does it offer and what does not? And will developers be able to focus just on solving business requirements instead of taming the cloud infrastructure? Join this talk by Azure MVP and cloud-native enthusiast Thorsten Hans and get your questions answered."
  },
  {
    "Title": "Zzzzzzzzzzz",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "zzzzzzzzzzz",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Martin Zikmund",
    "Description": "Sleep. As geeks we often forgo the natural need for it to just figure out this one last bug, play a few more rounds of our favorite multiplayer game, or unwind with our favorite TV show. The cost, however, may be much more than just a slight tiredness throughout the following day. Let\u0027s journey through what sleep is, why it is vital to our life, and how reducing its length has dire consequences to you as well as everyone around you. Finally, we will also cover practical tips to help you get more zzzzzzzz!"
  },
  {
    "Title": "How to KISS using MAM",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "how-to-kiss-using-mam",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Peter Daalmans, Kenneth van Surksum",
    "Description": "In this session, Microsoft Enterprise Mobility MVPs Peter Daalmans and Kenneth van Surksum will do a deep dive on Mobile Application Management as part of Microsoft Endpoint Manager/Intune. Peter and Kenneth will explain how to configure MAM, how to integrate it with Conditional Access and how to troubleshoot MAM related issues in case something goes wrong. Also lessons learned will be shared with you. You can learn from our experience while implementing it with MDM and without MDM, so that you don\u0027t have to experience the issues we had."
  },
  {
    "Title": "The Sceptics Guide to Pattern Matching",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "the-sceptics-guide-to-pattern-matching",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Matt Ellis",
    "Description": "So C# has pattern matching now. But what is “pattern matching”? What does it mean, and more importantly, what does it mean to me? I’ve been using C# for ages now, and haven’t needed it so far. Why now?\r\n\r\nLet’s try to figure this whole pattern matching thing out. We’ll take a look at what it is, how it works, in C# and other languages, why it needs new syntax and how it maps to the old fashioned C# that we all know and love. And we’ll look at where you’d use it, and where you wouldn’t. Is it really better than a bunch of if statements?"
  },
  {
    "Title": "Increase your .NET Productivity with Visual Studio 2022 (pre-recorded session)",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "increase-your-net-productivity-with-visual-studio-2022-prerecorded-session",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Mika Dumont",
    "Description": "Increase your .NET productivity with the latest additions to Visual Studio 2022. This demo-heavy session includes new tips to help you understand code at a glance and the tooling improvements around Hot Reload, Razor, code style, diagnostics, and much more!"
  },
  {
    "Title": "Rise of the Tech Influencer - Small steps you can take to increase your reach",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "rise-of-the-tech-influencer-small-steps-you-can-take-to-increase-your-reach",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "Motivational \u0026 self-improvement",
    "TrackSlug": "motivational-self-improvement",
    "Speakers": "Michelle @ Microsoft",
    "Description": "Keeping your head down and working hard is not enough anymore. If you want to move onwards and upwards in this world you have to make sure the world knows your name. This can be hard when all you care about is the code and you don\u0027t want to look like you are self-promoting.\r\n\r\nAs Microsoft\u0027s #1 Social Seller on LinkedIn - I have more influence and engagement across that platform than Mark Russinovich. I will share the small steps you can take each day to increase your reach, establish credibility from a distance, influence by volume, and access all areas - whilst keeping your focus where it counts."
  },
  {
    "Title": "Playing with toys AND saving money on your energy bill, dreams come true",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "playing-with-toys-and-saving-money-on-your-energy-bill-dreams-come-true",
    "Day": "Wednesday",
    "TimeSlot": "15:00 - 16:00",
    "Date": "25 May 2022 | 15:00 - 16:00",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Joeri Maes",
    "Description": "The dreaded digital meter caused a lot of fuss in our little country. You can\u0027t get around it anymore but it can be used to your advantage, definitely if you are into data. We\u0027ll have a look on how you can gather the digital meter data, visualize it and use it to optimize your energy bill by using a raspberry pi, openhab, grafana, machine learning and some python."
  },
  {
    "Title": "Automate Third-Party Patching in Microsoft ConfigMgr and Intune",
    "Room": "Partner stage",
    "RoomInt": 0,
    "Slug": "automate-thirdparty-patching-in-microsoft-configmgr-and-intune",
    "Day": "Wednesday",
    "TimeSlot": "16:05 - 16:25",
    "Date": "25 May 2022 | 16:05 - 16:25",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Scott McAllister",
    "Description": "Join us for a 100% live demo where you will learn how to automate third-party application updates and application packaging in Microsoft Configuration Manager and Intune. With a repository of 500\u002B applications, you will save countless hours and help your organization stay more secure by reducing vulnerabilities in outdated third-party applications. In addition, you will learn about customizations available when installing and updating third-party applications through Patch My PC. Over 3,500 organizations use Patch My PC, and we have the highest customer satisfaction rating in the Patch Management category on G2."
  },
  {
    "Title": "Multi-Cloud Magic: Leveraging Multi-Cloud Clusters in Real-World Scenarios",
    "Room": "Room 3",
    "RoomInt": 3,
    "Slug": "multicloud-magic-leveraging-multicloud-clusters-in-realworld-scenarios",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Adrienne Braganza Tacke",
    "Description": "Public, Private, Hybrid...Multi-Cloud?\r\n\r\nAs the cloud development options and architectures continue to evolve, we\u0027ve finally found ourselves at the next new thing: Multi-Cloud. What is it? Do we really need it? How would you take advantage of a multi-cloud solution? \r\n\r\nIn this talk, I\u0027d like to describe a few real-world use cases where a multi-cloud solution is currently in production, specifically when it comes to data. A demo on how to setup a multi-cloud cluster will also be shown.\r\n\r\nThe audience will leave with a more confident understanding of real-world, multi-cloud use cases and see how to create their own!"
  },
  {
    "Title": "Identify Poorly Performing Queries - Three Tools You Already Own",
    "Room": "Room 7",
    "RoomInt": 7,
    "Slug": "identify-poorly-performing-queries-three-tools-you-already-own",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Data Platform \u0026 BI",
    "TrackSlug": "data-platform-bi",
    "Speakers": "Grant Fritchey",
    "Description": "One of the first challenges you’ll face when you decide to address poor query performance is identifying which query you should focus on. While you can simply wait for the people using your application to complain, a more proactive approach will serve you better. This session will walk you through three different, built-in tools within SQL Server that can be used to identify poorly performing queries. We’ll focus on the ubiquitous Dynamic Management Views (DMVs) since you can use them anywhere. Then, we’ll talk about what’s possible in SQL Server 2012 and greater through the use of Extended Events. Finally, we’ll talk about how you can put Query Store to use if you’re working in SQL Server 2016 or greater. Between these three tools, you can better understand which queries you need to focus on to fix problems in your environment right away."
  },
  {
    "Title": "Deep dive into Durable Functions",
    "Room": "Room 12",
    "RoomInt": 12,
    "Slug": "deep-dive-into-durable-functions",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Cloud Services",
    "TrackSlug": "cloud-services",
    "Speakers": "Laurent Bugnion",
    "Description": "Azure Functions are one of the offerings implemented by Microsoft for serverless technologies. While they are extremely easy and fast to deploy and run, and offer a lot of versatility to implement backend functionalities, they also have some limitations. This is why Durable Functions were developed.\r\nWith Durable Functions, you have even more power to create powerful backend systems. You can have long running functions, massively parallel processing, and other application patterns that we will review and demo. But all this power comes with some caveats, and it is very important to understand precisely how Durable Functions work, and what the underlying mechanisms are. In this session, Laurent Bugnion, a Microsoft Cloud Advocate since 2017 will take you to a deep dive into Azure Durable Functions. You will get out of this talk with a deeper understanding of Azure Functions, the Durable extensions and some demos illustrating all the points."
  },
  {
    "Title": "Deploying to Azure: Azure DevOps Pipelines vs GitHub Actions",
    "Room": "Room 6",
    "RoomInt": 6,
    "Slug": "deploying-to-azure-azure-devops-pipelines-vs-github-actions",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Barbara Forbes",
    "Description": "When it comes to infrastructure as code, Azure DevOps is a great way to bring your resources directly to Azure with the pipelines. It helps you automate the processes around the code so you are always sure your environment is consistent.\r\n\r\nA few years ago, GitHub announced a new pipeline on the block: GitHub Actions. You are able to deploy to Azure as well, but how do they compare? In this session, we will look at the similarities and the differences between these two tools. How much time does it take to learn, how much management do they require and how do they connect to Azure? Let\u0027s find out which of the two fits your own use case best! "
  },
  {
    "Title": "Everybody Dance with Azure Machine Learning",
    "Room": "Room 10",
    "RoomInt": 10,
    "Slug": "everybody-dance-with-azure-machine-learning",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "AI \u0026 IOT \u0026 ML",
    "TrackSlug": "ai-iot-ml",
    "Speakers": "Alan Smith",
    "Description": "The “Everybody Dance Now” project (Caroline Chan et al. UC Berkeley) demonstrated how generative adversarial networks (GANs) can be trained to produce effective motion transfer between professional dancers and test subjects. The training of these networks requires high-end GPU cards that are often beyond the reach of most hobby developers. Azure Machine Learning (Azure ML) provides developers with the capability to provision learning environments equipped with these high-end GPU cards with prices starting at $0.18 per hour. This enables anyone with an Azure subscription and a curious mind to experiment with advanced image to image transfer with generative adversarial networks.\r\nIn this demo-intensive session Alan will explain the theory of generative adversarial networks and describe how they can be trained in image transfer scenarios. He will then demonstrate how Azure ML can be leveraged as a platform for training complex GANs by running the Everybody Dance Now source code as an Azure ML experiment. The transfer of motion between a test subject and a real dancer will be demonstrated and explained along with tips for generating more accurate results. Throughout the session Alan will highlight the features of Azure ML and how they can be leveraged by developers working with AI and ML solutions.\r\n"
  },
  {
    "Title": "Leading Collaborative Innovation Sessions with MS Office 365 PowerPoint for the Web / Google Slides",
    "Room": "Room 14",
    "RoomInt": 14,
    "Slug": "leading-collaborative-innovation-sessions-with-ms-office-365-powerpoint-for-the-web-google-slides",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Modern Workplace",
    "TrackSlug": "modern-workplace",
    "Speakers": "Robin Mata",
    "Description": "Come and learn how to use \u0022Power Point on the Cloud\u0022 to simply and effectively lead a brainstorming session with your team. Trigger innovation using collaborative tools available to most organizations"
  },
  {
    "Title": "Design Systems of a Down: Steal this Guide!",
    "Room": "Room 4",
    "RoomInt": 4,
    "Slug": "design-systems-of-a-down-steal-this-guide",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Web \u0026 Frontend",
    "TrackSlug": "web-frontend",
    "Speakers": "m4dz ",
    "Description": "Remember Atomic Design? It\u0027s been a while since we started talking about Design Systems. They\u0027re supposed to solve our interfaces inconsistencies issues, as a single source of truth. But do you know well how to build and use them, from a developer perspective?\r\n\r\nHere\u0027s your ultimate guide to Design Systems, for Devs! From the fundamentals of Design Tokens definition, to how to build advanced versatile layouts. You\u0027ll learn all best practices, tips \u0026 tricks, components splicing strategies, from this comprehensive step-by-step handbook talk.\r\n\r\nNever be lost again in front of a creating Design System from scratch!"
  },
  {
    "Title": "Controlling Chaos with Backstage",
    "Room": "Room 11",
    "RoomInt": 11,
    "Slug": "controlling-chaos-with-backstage",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Suzanne Daniels",
    "Description": "You have a complex ecosystem of frameworks, technologies, and platforms. Each with their own portal or tooling surrounding it. To remove friction, your autonomous teams all have their own implementation. Onboarding new developers is super confusing, and docs are scattered around the place. In short: chaos.\r\n\r\nThe solution to solving all this fragmentation might as well be.. another portal? Let\u0027s take a look at Backstage [https://backstage.io], an Open Source  platform which you can use to build your own developer portal, is highly customisable and adopted by companies like Expedia, Netflix, American Airlines, and Epic Games. .\r\n\r\nSuzanne will share the story why Backstage was developed at Spotify, how it became the core of their Developer Experience, and eventually a CNCF project.  You’ll get a tour of the Backstage platform, the plugin ecosystem, an understanding of the key use cases for Backstage and how Backstage might be a solution to control the chaos in your organization."
  },
  {
    "Title": "How to use GitHub Actions with security in mind",
    "Room": "Room 1",
    "RoomInt": 1,
    "Slug": "how-to-use-github-actions-with-security-in-mind",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Rob Bos",
    "Description": "When working in the real world with continuous integration / continuous deployment, you have to take care of your pipelines and the things they have access to. \r\n\r\n- Who can push code into to an environment?\r\n- Who could read and change the connection strings to the database?\r\n- Who can create new resources in your cloud environment?\r\n- Do you trust your third party extensions?\r\n- What part of the network does your pipeline have access to?\r\n\r\nI\u0027ll go over each of these aspects of your GitHub Actions Workflows and show you what to look for and how to improve your security stance without locking every DevOps engineer out."
  },
  {
    "Title": "Zen of Architecture (live-remote session)",
    "Room": "Room 9",
    "RoomInt": 9,
    "Slug": "zen-of-architecture-liveremote-session",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "DevOps \u0026 Architecture \u0026 Security",
    "TrackSlug": "devops-architecture-security",
    "Speakers": "Juval Löwy",
    "Description": "In this dense session renowned architect Juval Lowy explains his approach to system analysis and design, using volatility to decompose a system into its comprising services. Juval will contrast it with the most common mistake done in architecture, using functionality to identify services. These are universal design principles, and Juval will use examples from software and non-software systems alike. You will also see how to overcome the real hurdles architects face pursuing volatility-based decomposing, simple and practical techniques for identifying areas of volatility, and common telltale signs or \u0022smells\u0022 when your design is still functional. Juval Lowy has helped hundreds of companies apply successfully these ideas, and he has transformed the lives of countless of architects. "
  },
  {
    "Title": "Adding a new Language Feature to C# in 60 minutes",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "adding-a-new-language-feature-to-c-in-60-minutes",
    "Day": "Wednesday",
    "TimeSlot": "16:30 - 17:30",
    "Date": "25 May 2022 | 16:30 - 17:30",
    "Track": "Developer Trends",
    "TrackSlug": "developer-trends",
    "Speakers": "Bart De Smet",
    "Description": "If you ever wanted to see how language features get implemented in the C# compiler and language services, then this talk is for you. Come and join us for a rollercoaster ride in the Roslyn compiler source code, implementing a small language feature in 60 minutes, starting from \u0022git clone\u0022, building Roslyn, implementing our feature, compiling the compiler, and finally compiling a little snippet of code using our new language feature using our custom compiler build. During this talk, we\u0027ll encounter syntax trees, semantic analysis, bound trees, and more."
  },
  {
    "Title": "The Next Decade of Software Development",
    "Room": "Room 8",
    "RoomInt": 8,
    "Slug": "the-next-decade-of-software-development",
    "Day": "Wednesday",
    "TimeSlot": "17:45 - 18:45",
    "Date": "25 May 2022 | 17:45 - 18:45",
    "Track": "Keynote",
    "TrackSlug": "keynote",
    "Speakers": "Richard Campbell",
    "Description": "It\u0027s 2022 - and besides a pandemic, we\u0027re in a new decade! How will software development evolve in the 2020s? Join Richard Campbell as he explores the landscape of technology that will have a huge impact on development over the next ten years. What new devices are coming? Will Artificial Intelligence take over everything? How will people connect to the web in the next ten years? And what about Quantum Computing? All these topics and more will shape our future!"
  }
]